
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>算法工程师从零到一 · 算法工程师从零到一</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="作者峰池和这本书，算法工程师从零到一">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="峰池">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-bibtex-indexed-cite/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap01/1-internet_industry_trend.html" />
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    算法工程师从零到一
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">01 行业背景</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="chap01/1-internet_industry_trend.html">
            
                <a href="chap01/1-internet_industry_trend.html">
            
                    
                    1-1 互联网整体发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="chap01/position_description.html">
            
                <a href="chap01/position_description.html">
            
                    
                    1-2 互联网中的主要岗位都是在干些啥？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="chap01/3-work_experience.html">
            
                <a href="chap01/3-work_experience.html">
            
                    
                    1-3 工作体验
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="chap01/2-the_way_grown_up.html">
            
                <a href="chap01/2-the_way_grown_up.html">
            
                    
                    1-4 晋升路径&回报
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="chap01/4-other_questions.html">
            
                <a href="chap01/4-other_questions.html">
            
                    
                    1-5 其他问题：城市、户口&实习
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">02 找工作</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="chap02/1-preparing.html">
            
                <a href="chap02/1-preparing.html">
            
                    
                    2-1 求职准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="chap02/2-process.html">
            
                <a href="chap02/2-process.html">
            
                    
                    2-2 整体流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="chap02/3-resume.html">
            
                <a href="chap02/3-resume.html">
            
                    
                    2-3 简历制作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="chap02/4-interview.html">
            
                <a href="chap02/4-interview.html">
            
                    
                    2-4 面试准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="chap02/5-choice.html">
            
                <a href="chap02/5-choice.html">
            
                    
                    2-5 Offer选择
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">03 日常工作</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="chap03/1-basics.html">
            
                <a href="chap03/1-basics.html">
            
                    
                    3-1 工程基础：线上系统，代码先行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="chap03/2-sort.html">
            
                <a href="chap03/2-sort.html">
            
                    
                    3-2 排序模块：推荐系统的目标是什么？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="chap03/3-recall.html">
            
                <a href="chap03/3-recall.html">
            
                    
                    3-3 召回模块：海量候选的快速匹配
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="chap03/4-instance.html">
            
                <a href="chap03/4-instance.html">
            
                    
                    3-4 样本拼接&模型训练
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">04 新人进阶</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="chap04/write_to_new_engineer.html">
            
                <a href="chap04/write_to_new_engineer.html">
            
                    
                    4-1 写给新人算法工程师
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="chap04/2-how_to_make_money.html">
            
                <a href="chap04/2-how_to_make_money.html">
            
                    
                    4-2 商业模式：互联网如何赚钱
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">05 推荐资料</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="chap05/1-book_recommend.html">
            
                <a href="chap05/1-book_recommend.html">
            
                    
                    5-1 推荐资料
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >算法工程师从零到一</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4ECE;&#x96F6;&#x5230;&#x4E00;"><b></b>&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4ECE;&#x96F6;&#x5230;&#x4E00;</a></li></ul></div><a href="#&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4ECE;&#x96F6;&#x5230;&#x4E00;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4ECE;&#x96F6;&#x5230;&#x4E00;"><a name="&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4ECE;&#x96F6;&#x5230;&#x4E00;" class="anchor-navigation-ex-anchor" href="#&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4ECE;&#x96F6;&#x5230;&#x4E00;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4ECE;&#x96F6;&#x5230;&#x4E00;</h1>
<p>&#x6211;&#x662F;&#x5CF0;&#x6C60;&#xFF0C;&#x662F;&#x4E00;&#x540D;&#x63A8;&#x8350;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x76EE;&#x524D;&#x5C31;&#x804C;&#x4E8E;&#x5B57;&#x8282;&#x8DF3;&#x52A8;&#x3002;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#xFF1A;&#x300A;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4ECE;&#x96F6;&#x5230;&#x4E00;&#x300B;&#xFF0C;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5C1D;&#x8BD5;&#x3002;<strong>&#x6211;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x628A;&#x81EA;&#x5DF1;&#x5BF9;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x548C;&#x8FD9;&#x4E2A;&#x5C97;&#x4F4D;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x548C;&#x8BA4;&#x77E5;&#x7CFB;&#x7EDF;&#x7684;&#x8F93;&#x51FA;&#x51FA;&#x6765;&#xFF0C;&#x7ED9;&#x90A3;&#x4E9B;&#x4E92;&#x8054;&#x7F51;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E9B;&#x53C2;&#x8003;&#x3002;</strong></p>
<p><strong>&#x5E0C;&#x671B;&#x8FD9;&#x672C;&#x4E66;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x90A3;&#x4E9B;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x6709;&#x5174;&#x8DA3;&#x7684;&#xFF0C;&#x60F3;&#x6210;&#x4E3A;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x3002;</strong></p>
<p>&#x6211;&#x662F;&#x4E00;&#x540D;&#x975E;&#x79D1;&#x73ED;&#x51FA;&#x8EAB;&#x7684;&#x7801;&#x519C;&#xFF0C;&#x672C;&#x79D1;&#x5B66;&#x7684;&#x662F;&#x5DE5;&#x5546;&#x7BA1;&#x7406;&#x3002;16&#x5E74;&#x8003;&#x7814;&#x65F6;&#x624D;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x4EE3;&#x7801;&#xFF0C;&#x5168;&#x9760;&#x81EA;&#x5B66;&#x3002;&#x7855;&#x58EB;&#x8BFB;&#x7684;&#x662F;&#x5E94;&#x7528;&#x7EDF;&#x8BA1;&#xFF0C;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7A0D;&#x5FAE;&#x6CBE;&#x70B9;&#x8FB9;&#x3002;18&#x5E74;&#x7855;&#x58EB;&#x6BD5;&#x4E1A;&#xFF0C;&#x6821;&#x62DB;&#x52A0;&#x5165;&#x5B57;&#x8282;&#x8DF3;&#x52A8;&#x505A;&#x63A8;&#x8350;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x521A;&#x5165;&#x804C;&#x7684;&#x65F6;&#x5019;&#x7ECF;&#x5386;&#x4E86;&#x975E;&#x5E38;&#x957F;&#x4E14;&#x75DB;&#x82E6;&#x7684;&#x9002;&#x5E94;&#x65F6;&#x95F4;&#x3002;<strong>&#x4E3B;&#x8981;&#x7684;&#x70B9;&#x5728;&#x4E8E;&#x81EA;&#x5DF1;&#x5728;&#x5B66;&#x6821;&#x91CC;&#x9762;&#x5B66;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4E0E;&#x771F;&#x5B9E;&#x7684;&#x5DE5;&#x4E1A;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x5DE8;&#x5927;&#x9E3F;&#x6C9F;&#xFF1A;&#x597D;&#x50CF;&#x5B9E;&#x9645;&#x5728;&#x5DE5;&#x4E1A;&#x573A;&#x666F;&#x5E94;&#x7528;&#x7684;&#x91CD;&#x70B9;&#xFF0C;&#x548C;&#x81EA;&#x5DF1;&#x5728;&#x5B66;&#x6821;&#x5B66;&#x4E60;&#x7684;&#x8981;&#x70B9;&#xFF0C;&#x6709;&#x592A;&#x591A;&#x5BF9;&#x4E0D;&#x4E0A;&#x7684;&#x4E86;&#x3002;</strong></p>
<p>&#x4E8E;&#x662F;&#x5728;&#x81EA;&#x5DF1;&#x9002;&#x5E94;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x5728;&#x60F3;&#x81EA;&#x5DF1;&#x80FD;&#x4E0D;&#x80FD;&#x505A;&#x4E00;&#x70B9;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x90A3;&#x4E9B;&#x5728;&#x6821;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x66F4;&#x597D;&#x7684;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x73B0;&#x5728;&#x5DE5;&#x4F5C;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6280;&#x80FD;&#x548C;&#x4EBA;&#x624D;&#xFF0C;&#x8BA9;&#x540E;&#x6765;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x4EE5;&#x5C11;&#x8D70;&#x90A3;&#x4E9B;&#x81EA;&#x5DF1;&#x4E4B;&#x524D;&#x8D9F;&#x8FC7;&#x7684;&#x5751;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x5F00;&#x901A;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF1A;&#x5CF0;&#x6C60;(fengchitalk)&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x5C1D;&#x8BD5;&#x505A;&#x8FD9;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x52AA;&#x529B;&#x3002;&#x56E0;&#x4E3A;&#x5DE5;&#x4F5C;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5176;&#x5B9E;&#x66F4;&#x65B0;&#x7684;&#x6B21;&#x6570;&#x5E76;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x7684;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x4F9D;&#x7136;&#x6709;&#x540E;&#x6765;&#x7684;&#x5E08;&#x5F1F;&#x5E08;&#x59B9;&#x4EEC;&#x8DDF;&#x6211;&#x53CD;&#x9988;&#x8BF4;&#xFF0C;&#x6211;&#x7684;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x5BF9;&#x4ED6;&#x4EEC;&#x804C;&#x4E1A;&#x9053;&#x8DEF;&#x9009;&#x62E9;&#x8D77;&#x5230;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x540C;&#x5B66;&#x751A;&#x81F3;&#x5B8C;&#x5168;&#x662F;&#x6309;&#x7167;&#x6211;&#x5212;&#x5B9A;&#x7684;&#x65B9;&#x6848;&#x5236;&#x5B9A;&#x7684;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x6700;&#x540E;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4E92;&#x8054;&#x7F51;&#x4EBA;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;</p>
<p>&#x81EA;&#x5DF1;&#x5728;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x611F;&#x5230;&#x975E;&#x5E38;&#x9AD8;&#x5174;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x5199;&#x4E0B;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6765;&#x5E2E;&#x52A9;&#x66F4;&#x591A;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x3002;&#x540C;&#x65F6;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x7CFB;&#x7EDF;&#x4E00;&#x4E9B;&#xFF0C;&#x5E2E;&#x52A9;&#x5230;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x3002;</p>
<p><strong>&#x6240;&#x4EE5;&#x6211;&#x628A;&#x81EA;&#x5DF1;&#x516C;&#x4F17;&#x53F7;&#x4E0A;&#x7684;&#x5185;&#x5BB9;&#x6574;&#x7406;&#x603B;&#x7ED3;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5E76;&#x91CD;&#x5199;&#x4E86;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x6BB5;&#x843D;&#xFF0C;&#x96C6;&#x7ED3;&#x6210;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#x3002;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x4F60;&#x4ECE;&#x4E00;&#x540D;&#x6821;&#x56ED;&#x840C;&#x65B0;&#xFF0C;&#x6210;&#x957F;&#x4E3A;&#x4E00;&#x540D;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;</strong></p>
<p>&#x76EE;&#x524D;&#x81EA;&#x5DF1;&#x7C97;&#x7565;&#x7684;&#x7EDF;&#x8BA1;&#x5E94;&#x8BE5;&#x5B57;&#x6570;&#x662F;&#x4E94;&#x4E07;&#x6709;&#x4F59;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x81EA;&#x5DF1;&#x8FD8;&#x662F;&#x633A;&#x5F00;&#x5FC3;&#x7684;&#x3002;&#x5F53;&#x7136;&#x5B57;&#x6570;&#x53EA;&#x662F;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x771F;&#x7684;&#x5BF9;&#x5927;&#x5BB6;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x90A3;&#x5C31;&#x662F;&#x592A;&#x5F00;&#x5FC3;&#x4E86;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x6211;&#x63D0;&#x4F9B;&#x4E86;PDF&#x548C;&#x7F51;&#x9875;&#x7AEF;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;</p>
<ul>
<li>&#x7F51;&#x9875;&#x7AEF;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;<a href="https://dongfengchi.github.io/algo_engineer_zero_to_one/" target="_blank">https://dongfengchi.github.io/algo_engineer_zero_to_one/</a></li>
<li>pdf&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x6211;&#x7684;&#x5FAE;&#x4FE1;<code>fengchi_dong</code>&#x6216;&#x8005;&#x5728;&#x516C;&#x4F17;&#x53F7;&#x540E;&#x53F0;&#x56DE;&#x590D;<code>&#x4ECE;&#x96F6;&#x5230;&#x4E00;</code>&#x83B7;&#x5F97;&#x3002;</li>
</ul>
<p>&#x5F53;&#x7136;&#xFF0C;&#x56FF;&#x4E8E;&#x81EA;&#x5DF1;&#x81EA;&#x8EAB;&#x80FD;&#x529B;&#x4E0A;&#x7684;&#x5C40;&#x9650;&#xFF0C;&#x4E66;&#x4E2D;&#x80AF;&#x5B9A;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x6027;&#x7684;&#x9519;&#x8BEF;&#x3001;&#x4E00;&#x4E9B;&#x89C2;&#x70B9;&#x4E0A;&#x7684;&#x504F;&#x5DEE;&#x751A;&#x81F3;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x6392;&#x7248;&#x4E0A;&#x611A;&#x8822;&#x7684;&#x5730;&#x65B9;&#x3002;&#x8FD8;&#x671B;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x591A;&#x591A;&#x6307;&#x51FA;&#xFF0C;&#x5CF0;&#x6C60;&#x5728;&#x8FD9;&#x91CC;&#x4E0D;&#x5C3D;&#x611F;&#x6FC0;&#x3002;</p>
<hr>
<p><strong>&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x6240;&#x5728;&#x7684;&#x56E2;&#x961F;&#x8D1F;&#x8D23;&#x5E38;&#x5E74;&#x62DB;&#x6536;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x6821;&#x62DB;&#x793E;&#x62DB;&#x5B9E;&#x4E60;&#x5747;&#x53EF;&#x3002;&#x6211;&#x4EEC;&#x662F;&#x5B57;&#x8282;&#x8DF3;&#x52A8;GIP&#x63A8;&#x8350;&#x7B97;&#x6CD5;&#xFF0C;&#x5305;&#x62EC;&#x4ECA;&#x65E5;&#x5934;&#x6761;&#x3001;&#x897F;&#x74DC;&#x89C6;&#x9891;&#x3001;&#x756A;&#x8304;&#x5C0F;&#x8BF4;&#x7B49;&#x5176;&#x4ED6;App&#x7684;&#x63A8;&#x8350;&#x7B97;&#x6CD5;&#x5DE5;&#x4F5C;&#x3002;&#x6B22;&#x8FCE;&#x540C;&#x5B66;&#x4EEC;&#x76F4;&#x63A5;&#x52A0;&#x6211;&#x4E2A;&#x4EBA;&#x5FAE;&#x4FE1;<code>fengchi_dong</code>&#x8FDB;&#x884C;&#x5185;&#x63A8;&#x3002;&#x60F3;&#x4E86;&#x89E3;&#x4E5F;&#x884C;&#xFF0C;&#x5305;&#x884C;&#x4E1A;&#x80CC;&#x666F;&#x4ECB;&#x7ECD;&#xFF0C;&#x7B80;&#x5386;&#x8F85;&#x5BFC;&#xFF0C;&#x610F;&#x5FD7;&#x4E0D;&#x575A;&#x5B9A;&#x704C;&#x9E21;&#x6C64;&#xFF0C;&#x9762;&#x8BD5;&#x51C6;&#x5907;&#x65B9;&#x6848;&#x5236;&#x5B9A;&#x7B49;&#x7B49;&#x4E00;&#x6761;&#x9F99;&#x670D;&#x52A1;&#x3002;&#x6CA1;&#x6709;&#x505A;&#x4E0D;&#x5230;&#xFF0C;&#x53EA;&#x6709;&#x60F3;&#x4E0D;&#x5230;&#xFF01;</strong></p>
<hr>
<p>&#x5982;&#x679C;&#x5BF9;&#x6211;&#x4E2A;&#x4EBA;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x6216;&#x8005;&#x5BF9;&#x5185;&#x5BB9;&#x6709;&#x7591;&#x95EE;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x627E;&#x5230;&#x6211;~</p>
<ul>
<li>&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF1A;&#x5CF0;&#x6C60;<a href="https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat_mp.jpg" target="_blank">(fengchitalk)</a></li>
<li>&#x77E5;&#x4E4E;&#xFF1A;<a href="https://www.zhihu.com/people/fengchitalk" target="_blank">@&#x5CF0;&#x6C60;</a></li>
</ul>
<p>&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF1A;
<img src="wechat_mp.jpg" alt="&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF1A;fengchitalk"></p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> &#x4F5C;&#x8005;: <a href="https://dongfengchi.github.io/algo_engineer_zero_to_one" target="_blank">&#x5CF0;&#x6C60;</a>&#xFF0C;&#x4E00;&#x4E2A;&#x7231;&#x8BFB;&#x4E66;&#x7684;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08; </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> &#x6700;&#x8FD1;&#x66F4;&#x65B0;&#xFF1A; 2021-03-09 06:44:53 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="chap01/1-internet_industry_trend.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 1-1 互联网整体发展趋势">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"description":"作者峰池和这本书，算法工程师从零到一","title":"算法工程师从零到一","level":"1.1","depth":1,"next":{"title":"1-1 互联网整体发展趋势","level":"2.1","depth":1,"path":"chap01/1-internet_industry_trend.md","ref":"./chap01/1-internet_industry_trend.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","-sharing","github-buttons","editlink","ga","-highlight","prism","bibtex-indexed-cite","anchor-navigation-ex","page-footer-ex","splitter","todo","copy-code-button","expandable-chapters-small","donate","katex","statistics"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"ignore":["mermaid","eval-js"],"css":["prismjs/themes/prism-solarizedlight.css"]},"statistics":{"bd_url":"https://hm.baidu.com/hm.js","cnzz_url":"https://s95.cnzz.com/z_stat.php","google_url":"https://www.googletagmanager.com/gtag/js","cnzz_id":1279720611},"editlink":{"label":"Edit","multilingual":false,"base":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"},"todo":{},"page-footer-ex":{"copyright":"作者: [峰池](https://dongfengchi.github.io/algo_engineer_zero_to_one)，一个爱读书的算法工程师","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"最近更新："},"splitter":{},"search-pro":{"cutWordLib":"nodejieba","defineWord":["Gitbook Use"]},"donate":{"alipay":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat.jpg","alipayText":"微信打赏","button":"赏","title":"","wechat":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat_mp.jpg","wechatText":"关注公众号：峰池"},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":false},"bibtex-indexed-cite":{"path":"/"},"github-buttons":{"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]},"expandable-chapters-small":{},"links":{"sidebar":{"Home":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"}},"copy-code-button":{},"ga":{"configuration":"auto","token":"G-0FKP0E9H88"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"峰池","pdf":{"pageNumbers":true,"fontSize":14,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":30,"left":30,"top":32,"bottom":32}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"bibCount":0,"variables":{},"title":"算法工程师从零到一","bib":[],"gitbook":"*"},"file":{"path":"README.md","mtime":"2021-03-09T06:44:53.136Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-09T06:45:42.115Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-statistics/statistics.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

