
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1-3 工作体验 · 算法工程师从零到一</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="峰池">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-bibtex-indexed-cite/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2-the_way_grown_up.html" />
    
    
    <link rel="prev" href="position_description.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    算法工程师从零到一
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">01 行业背景</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="1-internet_industry_trend.html">
            
                <a href="1-internet_industry_trend.html">
            
                    
                    1-1 互联网整体发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="position_description.html">
            
                <a href="position_description.html">
            
                    
                    1-2 互联网中的主要岗位都是在干些啥？
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.3" data-path="3-work_experience.html">
            
                <a href="3-work_experience.html">
            
                    
                    1-3 工作体验
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="2-the_way_grown_up.html">
            
                <a href="2-the_way_grown_up.html">
            
                    
                    1-4 晋升路径&回报
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="4-other_questions.html">
            
                <a href="4-other_questions.html">
            
                    
                    1-5 其他问题：城市、户口&实习
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">02 找工作</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../chap02/1-preparing.html">
            
                <a href="../chap02/1-preparing.html">
            
                    
                    2-1 求职准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../chap02/2-process.html">
            
                <a href="../chap02/2-process.html">
            
                    
                    2-2 整体流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../chap02/3-resume.html">
            
                <a href="../chap02/3-resume.html">
            
                    
                    2-3 简历制作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="../chap02/4-interview.html">
            
                <a href="../chap02/4-interview.html">
            
                    
                    2-4 面试准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="../chap02/5-choice.html">
            
                <a href="../chap02/5-choice.html">
            
                    
                    2-5 Offer选择
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">03 日常工作</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../chap03/1-basics.html">
            
                <a href="../chap03/1-basics.html">
            
                    
                    3-1 工程基础：线上系统，代码先行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../chap03/2-sort.html">
            
                <a href="../chap03/2-sort.html">
            
                    
                    3-2 排序模块：推荐系统的目标是什么？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="../chap03/3-recall.html">
            
                <a href="../chap03/3-recall.html">
            
                    
                    3-3 召回模块：海量候选的快速匹配
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="../chap03/4-instance.html">
            
                <a href="../chap03/4-instance.html">
            
                    
                    3-4 样本拼接&模型训练
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">04 新人进阶</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../chap04/write_to_new_engineer.html">
            
                <a href="../chap04/write_to_new_engineer.html">
            
                    
                    4-1 写给新人算法工程师
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="../chap04/2-how_to_make_money.html">
            
                <a href="../chap04/2-how_to_make_money.html">
            
                    
                    4-2 商业模式：互联网如何赚钱
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">05 推荐资料</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../chap05/1-book_recommend.html">
            
                <a href="../chap05/1-book_recommend.html">
            
                    
                    5-1 推荐资料
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1-3 工作体验</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#1-3-&#x5DE5;&#x4F5C;&#x4F53;&#x9A8C;"><b></b>1-3 &#x5DE5;&#x4F5C;&#x4F53;&#x9A8C;</a></li><ul><li><span class="title-icon "></span><a href="#&#x5DE5;&#x4F5C;&#x73AF;&#x5883;"><b></b>&#x5DE5;&#x4F5C;&#x73AF;&#x5883;</a></li><li><span class="title-icon "></span><a href="#&#x65E5;&#x5E38;&#x8282;&#x594F;"><b></b>&#x65E5;&#x5E38;&#x8282;&#x594F;</a></li><li><span class="title-icon "></span><a href="#&#x65B0;&#x4EBA;&#x4F53;&#x9A8C;"><b></b>&#x65B0;&#x4EBA;&#x4F53;&#x9A8C;</a></li></ul></ul></div><a href="#1-3-&#x5DE5;&#x4F5C;&#x4F53;&#x9A8C;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="1-3-&#x5DE5;&#x4F5C;&#x4F53;&#x9A8C;"><a name="1-3-&#x5DE5;&#x4F5C;&#x4F53;&#x9A8C;" class="anchor-navigation-ex-anchor" href="#1-3-&#x5DE5;&#x4F5C;&#x4F53;&#x9A8C;"><i class="fa fa-link" aria-hidden="true"></i></a>1-3 &#x5DE5;&#x4F5C;&#x4F53;&#x9A8C;</h1>
<p>&#x4E3B;&#x8981;&#x5206;&#x6210;&#x4EE5;&#x4E0B;&#x8FD9;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x3001;&#x5DE5;&#x4F5C;&#x7684;&#x65E5;&#x5E38;&#x8282;&#x594F;&#x4EE5;&#x53CA;&#x7B80;&#x5355;&#x8BF4;&#x8BF4;&#x65B0;&#x4EBA;&#x4F53;&#x9A8C;&#x3002;</p>
<h2 id="&#x5DE5;&#x4F5C;&#x73AF;&#x5883;"><a name="&#x5DE5;&#x4F5C;&#x73AF;&#x5883;" class="anchor-navigation-ex-anchor" href="#&#x5DE5;&#x4F5C;&#x73AF;&#x5883;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5DE5;&#x4F5C;&#x73AF;&#x5883;</h2>
<p>&#x73B0;&#x5728;&#x4E3B;&#x6D41;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#xFF0C;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x6BD4;&#x8F83;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x5173;&#x952E;&#x8BCD;&#x662F;&#x8212;&#x9002;&#x3002;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x4ECE;&#x4E8B;&#x7684;&#x662F;&#x521B;&#x9020;&#x6027;&#x7684;&#x52B3;&#x52A8;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8212;&#x9002;&#x7684;&#x73AF;&#x5883;&#x624D;&#x80FD;&#x6700;&#x5927;&#x7684;&#x6FC0;&#x53D1;&#x4ED6;&#x4EEC;&#x7684;&#x751F;&#x4EA7;&#x529B;&#x3002;&#x800C;&#x516C;&#x53F8;&#x4E00;&#x822C;&#x4E5F;&#x4F1A;&#x628A;&#x8FD9;&#x79CD;&#x8212;&#x9002;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x4F5C;&#x4E3A;&#x5438;&#x5F15;&#x4EBA;&#x624D;&#x7684;&#x91CD;&#x8981;&#x5BA3;&#x4F20;&#x7D20;&#x6750;&#x3002;</p>
<p>&#x4F53;&#x73B0;&#x4E3A;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<p><strong>&#x4E00;&#x3001;&#x751F;&#x4EA7;&#x8BBE;&#x5907;&#x3002;</strong>&#x73B0;&#x5728;&#x4E3B;&#x6D41;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#xFF0C;&#x516C;&#x53F8;&#x4F1A;&#x7ED9;&#x65B0;&#x5165;&#x804C;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x914D;&#x5907;&#x65B0;&#x6B3E;&#x8BBE;&#x5907;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x5B57;&#x8282;&#x8DF3;&#x52A8;&#xFF0C;&#x5BF9;&#x4E8E;&#x5927;&#x90E8;&#x5206;&#x6280;&#x672F;&#x540C;&#x5B66;&#x6765;&#x8BF4;&#xFF0C;&#x516C;&#x53F8;&#x4F1A;&#x914D;&#x7F6E;&#x65B0;&#x6B3E;&#x7684;macbook pro&#xFF0C;&#x539F;&#x56E0;&#x4E3B;&#x8981;&#x662F;&#x7CFB;&#x7EDF;&#x7A33;&#x5B9A;&#x4EE5;&#x53CA;&#x7F16;&#x7A0B;&#x73AF;&#x5883;&#x5BB9;&#x6613;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x4E2A;&#x7535;&#x8111;&#x57FA;&#x672C;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x516C;&#x53F8;&#x53D1;&#x7ED9;&#x4F60;&#x7684;&#xFF0C;&#x81EA;&#x5DF1;&#x60F3;&#x600E;&#x4E48;&#x73A9;&#x90FD;&#x53EF;&#x4EE5;&#x3002;&#x4E09;&#x5E74;&#x671F;&#x6EE1;&#x8FD8;&#x53EF;&#x4EE5;&#x518D;&#x6362;&#x65B0;&#x7684;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x516C;&#x53F8;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x914D;&#x5907;&#x989D;&#x5916;&#x5916;&#x63A5;&#x7684;&#x663E;&#x793A;&#x5668;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x591A;&#x4E2A;&#x5C4F;&#x5E55;&#x529E;&#x516C;&#xFF0C;&#x63D0;&#x5347;&#x5DE5;&#x4F5C;&#x548C;&#x4EE3;&#x7801;&#x5F00;&#x53D1;&#x7684;&#x6548;&#x7387;&#x3002;</p>
<p><strong>&#x4E8C;&#x3001;&#x9910;&#x996E;&#x3002;</strong>&#x5927;&#x90E8;&#x5206;&#x4E3B;&#x6D41;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x98DF;&#x5802;&#xFF0C;&#x5458;&#x5DE5;&#x7684;&#x4E09;&#x9910;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x89E3;&#x51B3;&#x3002;&#x4F19;&#x98DF;&#x7684;&#x8D28;&#x91CF;&#x90FD;&#x662F;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x5B57;&#x8282;&#x8DF3;&#x52A8;&#x7684;&#x9910;&#x6807;&#x636E;&#x8BF4;&#x662F;100/&#x5929;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x90A3;&#x4E9B;&#x6CA1;&#x6709;&#x98DF;&#x5802;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x516C;&#x53F8;&#x4E5F;&#x4F1A;&#x63D0;&#x4F9B;&#x9910;&#x8865;&#xFF0C;&#x7ED9;&#x5458;&#x5DE5;&#x5728;&#x5916;&#x5C31;&#x9910;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x8865;&#x8D34;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x8FD8;&#x6709;&#x514D;&#x8D39;&#x53D1;&#x653E;&#x7684;&#x96F6;&#x98DF;&#x3001;&#x4E0B;&#x5348;&#x8336;&#x3001;&#x5496;&#x5561;&#x7B49;&#x7B49;&#xFF0C;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5403;&#x9971;&#x559D;&#x8DB3;&#xFF0C;&#x70ED;&#x91CF;&#x62C9;&#x6EE1;&#x3002;&#x7ECF;&#x5E38;&#x53EF;&#x4EE5;&#x5728;&#x7535;&#x68AF;&#x91CC;&#x7B49;&#x7B49;&#x4E00;&#x4E9B;&#x516C;&#x5171;&#x573A;&#x5408;&#x542C;&#x5230;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x5B8C;&#x5168;&#x4E0D;&#x8BA4;&#x8BC6;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x8BF4;&#x9053;&#x81EA;&#x5DF1;&#x53C8;&#x80D6;&#x4E86;&#x4E94;&#x65A4;&#x3002;&#x4E8E;&#x662F;&#x51CF;&#x80A5;&#x6210;&#x4E3A;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x7684;&#x5E38;&#x9A7B;&#x76EE;&#x6807;&#x3002;</p>
<p><strong>&#x4E09;&#x3001;&#x5176;&#x4ED6;&#x798F;&#x5229;&#x3002;</strong>&#x5E38;&#x89C1;&#x6709;&#xFF0C;&#x514D;&#x8D39;&#x7684;&#x5065;&#x8EAB;&#x623F;&#xFF0C;&#x6EE1;&#x8DB3;&#x5BF9;&#x5065;&#x8EAB;&#x7684;&#x65E5;&#x5E38;&#x9700;&#x6C42;&#xFF1B;&#x5C31;&#x8FD1;&#x79DF;&#x623F;&#x8865;&#x8D34;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x79DF;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#x79BB;&#x516C;&#x53F8;&#x5F88;&#x8FD1;&#xFF0C;&#x53EF;&#x80FD;&#x6BCF;&#x4E2A;&#x6708;&#x8981;&#x7ED9;&#x4F60;1500&#x5143;&#x7684;&#x8865;&#x52A9;&#xFF1B;&#x65E5;&#x5E38;&#x4E5F;&#x53D1;&#x4E00;&#x4E9B;&#x6587;&#x5316;&#x886B;&#x6216;&#x8005;&#x73A9;&#x5076;&#x4EE5;&#x53CA;&#x751F;&#x6D3B;&#x7528;&#x54C1;&#xFF1B;&#x665A;&#x4E0A;&#x52A0;&#x73ED;&#x56DE;&#x5BB6;&#x6253;&#x8F66;&#x53EF;&#x4EE5;&#x516C;&#x53F8;&#x62A5;&#x9500;&#xFF1B;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x4E3E;&#x884C;&#x7684;&#x4E00;&#x4E9B;&#x6587;&#x4F53;&#x6D3B;&#x52A8;&#xFF0C;&#x6BD4;&#x5982;&#x7FBD;&#x6BDB;&#x7403;&#x8D5B;&#x7B49;&#x7B49;&#xFF1B;&#x8FD8;&#x6709;&#x65E5;&#x5E38;&#x516C;&#x53F8;&#x5E2E;&#x5FD9;&#x7EC4;&#x7EC7;&#x7684;&#x4E00;&#x4E9B;&#x65E5;&#x5E38;&#x5FC5;&#x9700;&#x7684;&#x798F;&#x5229;&#xFF0C;&#x6BD4;&#x5982;&#x4F8B;&#x884C;&#x7684;&#x4F53;&#x68C0;&#xFF0C;&#x5546;&#x4E1A;&#x4FDD;&#x9669;&#x7B49;&#x7B49;&#xFF0C;&#x5E26;&#x85AA;&#x7684;&#x5E74;&#x5047;&#x548C;&#x75C5;&#x5047;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#x57FA;&#x672C;&#x4E0A;&#x516C;&#x53F8;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x5BF9;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F60;&#x7684;&#x8863;&#x98DF;&#x4F4F;&#x884C;&#x90FD;&#x591A;&#x591A;&#x5C11;&#x5C11;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x89E3;&#x51B3;&#x3002;<strong>&#x516C;&#x53F8;&#x5BF9;&#x4F60;&#x7684;&#x9884;&#x671F;&#x53EA;&#x6709;&#x4E00;&#x4EF6;&#x4E8B;&#xFF1A;&#x4F60;&#x80FD;&#x5B89;&#x5B89;&#x5FC3;&#x5FC3;&#x7684;&#x628A;&#x672C;&#x804C;&#x5DE5;&#x4F5C;&#x505A;&#x597D;&#x3002;</strong></p>
<p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x4E9B;&#x798F;&#x5229;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x8BA9;&#x516C;&#x53F8;&#x91CC;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x7684;&#x540C;&#x5B66;&#x611F;&#x53D7;&#x5230;&#xFF1A;&#x516C;&#x53F8;&#x786E;&#x5B9E;&#x662F;&#x5728;&#x4E3A;&#x4F60;&#x7740;&#x60F3;&#xFF0C;&#x751F;&#x6D3B;&#x5728;&#x5176;&#x4E2D;&#x53EF;&#x4EE5;&#x611F;&#x53D7;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x5E78;&#x798F;&#x611F;&#x3002;&#x540C;&#x65F6;&#x8FD9;&#x4E9B;&#x5BA3;&#x4F20;&#x901A;&#x5E38;&#x4F1A;&#x8BA9;&#x5BB6;&#x91CC;&#x7684;&#x8001;&#x4EBA;&#x957F;&#x8F88;&#x611F;&#x5230;&#x975E;&#x5E38;&#x7684;&#x5F00;&#x5FC3;&#xFF1A;&#x4ED6;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x5F88;&#x62C5;&#x5FC3;&#x8863;&#x98DF;&#x4F4F;&#x884C;&#x7684;&#x95EE;&#x9898;&#x3002;<strong>&#x4F46;&#x6211;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#x89C2;&#x611F;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x4F60;&#x9009;&#x62E9;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x7684;&#x52A0;&#x5206;&#x9879;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x7406;&#x7531;&#xFF1A;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#xFF0C;&#x505A;&#x51FA;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E8B;&#x60C5;&#x624D;&#x662F;&#x66F4;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x7684;&#x3002;</strong></p>
<h2 id="&#x65E5;&#x5E38;&#x8282;&#x594F;"><a name="&#x65E5;&#x5E38;&#x8282;&#x594F;" class="anchor-navigation-ex-anchor" href="#&#x65E5;&#x5E38;&#x8282;&#x594F;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x65E5;&#x5E38;&#x8282;&#x594F;</h2>
<p>&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x73B0;&#x5728;&#x6210;&#x4E3A;&#x201C;&#x52A0;&#x73ED;&#x201D;&#x594B;&#x6597;&#x7684;&#x4EE3;&#x540D;&#x8BCD;&#xFF0C;&#x5927;&#x5BB6;&#x88AB;996 007&#x5404;&#x79CD;&#x4EE3;&#x53F7;&#x641E;&#x5F97;&#x6655;&#x5934;&#x8F6C;&#x5411;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x62C5;&#x5FC3;&#x5BB3;&#x6015;&#x7684;&#x7684;&#x5FC3;&#x6001;&#x3002;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x65E5;&#x5E38;&#x7684;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x65E5;&#x5E38;&#x8282;&#x594F;&#x662F;&#x600E;&#x4E48;&#x6837;&#x7684;&#x5462;&#xFF1F;&#x6211;&#x4EE5;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x7ECF;&#x5386;&#x6765;&#x7B80;&#x5355;&#x804A;&#x804A;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BB2;&#x6E05;&#x695A;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;&#x8282;&#x594F;&#xFF0C;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#x662F;&#x8BB2;&#x6E05;&#x695A;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x5728;&#x5E72;&#x4EC0;&#x4E48;&#x3002;&#x8282;&#x594F;&#x5C31;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x5B89;&#x6392;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x53BB;&#x505A;&#x8FD9;&#x4E9B;&#x65E5;&#x5E38;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x8FD9;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<ol>
<li>&#x6A21;&#x578B;&#x76F8;&#x5173;&#x7684;&#x8FED;&#x4EE3;&#xFF1A;&#x8FD9;&#x4E2A;&#x65E2;&#x5305;&#x62EC;&#x6A21;&#x578B;&#x7ED3;&#x6784;&#x7684;&#x8FED;&#x4EE3;&#xFF0C;&#x4E5F;&#x5305;&#x62EC;&#x7279;&#x5F81;&#x7684;&#x8FED;&#x4EE3;&#x3002;&#x8FD9;&#x4E2A;&#x53EF;&#x80FD;&#x662F;&#x5927;&#x90E8;&#x5206;&#x540C;&#x5B66;&#x5BF9;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x8BA4;&#x77E5;&#xFF1A;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x81EA;&#x7136;&#x90FD;&#x662F;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x7684;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x53EF;&#x80FD;&#x6A21;&#x578B;&#x7ED3;&#x6784;&#x5B9E;&#x9645;&#x4E0A;&#x8FED;&#x4EE3;&#x7684;&#x5E76;&#x4E0D;&#x591A;&#x3002;&#x66F4;&#x591A;&#x7684;&#x6A21;&#x578B;&#x5DE5;&#x4F5C;&#x53D1;&#x751F;&#x5728;&#xFF0C;&#x65B0;&#x7684;&#x573A;&#x666F;&#x9700;&#x8981;&#x6A21;&#x578B;(&#x6BD4;&#x5982;&#x4E0A;&#x4E86;&#x65B0;&#x7684;app&#x6216;&#x8005;&#x652F;&#x6301;&#x65B0;&#x7684;&#x6D3B;&#x52A8;)&#xFF0C;&#x6216;&#x8005;&#x65B0;&#x7684;&#x7528;&#x6237;&#x884C;&#x4E3A;(&#x6BD4;&#x5982;&#x70B9;&#x8D5E;&#x3001;&#x8BC4;&#x8BBA;)&#x9700;&#x8981;&#x6A21;&#x578B;&#x6765;&#x9884;&#x4F30;&#xFF0C;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x6A21;&#x578B;&#x7279;&#x5F81;&#x52A0;&#x5165;&#x5230;&#x6A21;&#x578B;&#x91CC;&#x9762;&#x7B49;&#x7B49;&#x3002;</li>
<li>&#x63A8;&#x8350;&#x7B56;&#x7565;&#x7684;&#x8FED;&#x4EE3;&#xFF1A;&#x56E0;&#x4E3A;&#x63A8;&#x8350;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x7B97;&#x662F;&#x534A;&#x4E2A;&#x5185;&#x5BB9;&#x751F;&#x6001;&#x76F8;&#x5173;&#x7684;&#x4EA7;&#x54C1;&#xFF1B;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x6839;&#x636E;&#x4EA7;&#x54C1;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x505A;&#x4E00;&#x4E9B;&#x63A8;&#x8350;&#x7B56;&#x7565;&#x7684;&#x8FED;&#x4EE3;&#x3002;&#x5178;&#x578B;&#x7684;&#x8FED;&#x4EE3;&#x573A;&#x666F;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x5BF9;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x505A;&#x4EFB;&#x4F55;&#x5E72;&#x9884;&#x7684;&#x8BDD;&#xFF0C;&#x5927;&#x6982;&#x7387;&#x63A8;&#x8350;&#x51FA;&#x6765;&#x7684;&#x7ED3;&#x679C;&#x90FD;&#x4F1A;&#x662F;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x504F;&#x4F4E;&#x4FD7;&#x7684;&#x4E1C;&#x897F;(&#x8FD9;&#x662F;&#x4EBA;&#x7C7B;&#x7684;&#x672C;&#x6027;)&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x505A;&#x4E00;&#x4E9B;&#x5E72;&#x9884;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E72;&#x9884;&#x901A;&#x5E38;&#x4F1A;&#x4EE5;&#x635F;&#x5931;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x7684;&#x6548;&#x679C;&#x6765;&#x6362;&#x53D6;&#xFF1A;&#x56E0;&#x4E3A;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x80FD;&#x63A8;&#x70B9;&#x51FB;&#x7387;&#x6700;&#x9AD8;&#x7684;&#x5019;&#x9009;&#xFF0C;&#x53EA;&#x80FD;&#x63A8;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#x7684;&#x5019;&#x9009;&#x3002;</li>
<li>ab&#x5B9E;&#x9A8C;&#x3002;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#xFF0C;&#x5927;&#x5BB6;&#x5BF9;&#x5728;&#x7EBF;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x6000;&#x6709;&#x656C;&#x754F;&#x4E4B;&#x5FC3;&#x7684;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x7EBF;&#x4E0A;&#x6240;&#x6709;&#x7684;&#x53D8;&#x66F4;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x505A;ab&#x5B9E;&#x9A8C;&#xFF0C;&#x5728;&#x53D6;&#x5F97;&#x660E;&#x786E;&#x7684;&#x6548;&#x679C;&#x548C;&#x7ED3;&#x8BBA;&#x4E4B;&#x540E;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x4E0A;&#x7EBF;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6D89;&#x53CA;ab&#x7B56;&#x7565;&#x7684;&#x4EE3;&#x7801;&#x5F00;&#x53D1;&#xFF0C;&#x4EE5;&#x53CA;&#x7B56;&#x7565;&#x7684;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x901A;&#x5E38;&#x6D89;&#x53CA;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5206;&#x6790;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x7EDF;&#x8BA1;&#x4E2D;&#x7684;&#x5047;&#x8BBE;&#x68C0;&#x9A8C;&#x3002;</li>
</ol>
<p>&#x6574;&#x4F53;&#x4E0A;&#xFF0C;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x7684;&#x6C1B;&#x56F4;&#x662F;&#x6709;&#x6BD4;&#x8F83;&#x5F3A;&#x7684;&#x7A7A;&#x95F4;&#x548C;&#x81EA;&#x4E3B;&#x6743;&#xFF0C;&#x6709;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x60F3;&#x6CD5;&#x7684;&#x673A;&#x4F1A;&#x548C;&#x7A7A;&#x95F4;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x4F60;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x7BC7;&#x597D;&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x89C9;&#x5F97;&#x53EF;&#x80FD;&#x5BF9;&#x5F53;&#x524D;&#x7684;&#x573A;&#x666F;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#xFF1B;&#x6BD4;&#x5982;&#x4F60;&#x89C9;&#x5F97;&#x5F53;&#x524D;&#x7684;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#x76EE;&#x524D;&#x8FD8;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5230;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x8DDF;&#x4EA7;&#x54C1;&#x548C;&#x8FD0;&#x8425;&#x53BB;&#x804A;&#xFF0C;&#x83B7;&#x53D6;&#x76F8;&#x5E94;&#x7684;&#x652F;&#x6301;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x975E;&#x5E38;&#x5F00;&#x653E;&#x7684;&#x3002;</p>
<p>&#x65E5;&#x5E38;&#x7684;&#x5DE5;&#x4F5C;&#x8282;&#x594F;&#x4E5F;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x6BD4;&#x8F83;&#x8F7B;&#x677E;&#xFF0C;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x523B;&#x677F;&#xFF0C;&#x4F53;&#x73B0;&#x5728;&#xFF1A;</p>
<ul>
<li>&#x6BCF;&#x5929;&#x5341;&#x70B9;&#x4E0A;&#x73ED;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x5927;&#x90E8;&#x5206;&#x540C;&#x5B66;&#x90FD;&#x662F;&#x5341;&#x70B9;&#x534A;&#x5DE6;&#x53F3;&#x624D;&#x5230;</li>
<li>&#x665A;&#x4E0A;&#x4E00;&#x822C;&#x610F;&#x4E49;&#x4E0A;&#x662F;&#x4E03;&#x70B9;&#x4E0B;&#x73ED;&#xFF0C;&#x4F46;&#x5927;&#x90E8;&#x5206;&#x540C;&#x5B66;&#x662F;&#x4E5D;&#x5341;&#x70B9;&#x5DE6;&#x53F3;&#x79BB;&#x5F00;</li>
<li>&#x5982;&#x679C;&#x5076;&#x5C14;&#x6709;&#x4E8B;&#xFF0C;&#x8981;&#x63D0;&#x524D;&#x8D70;&#xFF0C;&#x4E00;&#x822C;&#x5728;&#x7FA4;&#x91CC;&#x8BF4;&#x4E00;&#x58F0;&#x5C31;&#x884C;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x4EC0;&#x4E48;</li>
</ul>
<p>&#x6574;&#x4F53;&#x4E0A;&#xFF0C;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x65E5;&#x5E38;&#x7684;&#x5DE5;&#x4F5C;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x89C4;&#x5F8B;&#x7684;&#xFF0C;&#x6211;&#x5E38;&#x5E38;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x548C;&#x8BFB;&#x4E66;&#x7684;&#x65F6;&#x5019;&#x5728;&#x8BFB;&#x4E66;&#x9986;&#x5176;&#x5B9E;&#x6CA1;&#x5565;&#x672C;&#x8D28;&#x533A;&#x522B;&#x3002;&#x53EF;&#x80FD;&#x5076;&#x5C14;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x7279;&#x522B;&#x7D27;&#x6025;&#x7684;&#x9879;&#x76EE;&#x9700;&#x8981;&#x8D76;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x52A0;&#x73ED;&#x5230;&#x5341;&#x4E00;&#x4E8C;&#x70B9;&#x3002;&#x4F46;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x7684;&#x3002;</p>
<p>&#x516C;&#x53F8;&#x5BF9;&#x4F60;&#x7684;&#x8981;&#x6C42;&#x5C31;&#x662F;&#xFF0C;&#x80FD;&#x5E72;&#x5B8C;&#x6D3B;&#x5C31;&#x884C;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x4F60;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x5B89;&#x6392;&#x3002;&#x5E72;&#x5B8C;&#x6D3B;&#x7684;&#x8868;&#x73B0;&#x5C31;&#x662F;&#xFF0C;&#x6BCF;&#x5468;&#x4F1A;&#x5B9A;&#x671F;&#x6709;&#x4E00;&#x4E2A;&#x5468;&#x4F1A;&#xFF0C;&#x5927;&#x5BB6;&#x4F1A;&#x8BB2;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x8FD9;&#x4E00;&#x5468;&#x90FD;&#x5E72;&#x4E86;&#x4E00;&#x4E9B;&#x5565;&#xFF0C;&#x4F60;&#x53EA;&#x8981;&#x80FD;&#x5728;&#x8FD9;&#x4E2A;&#x4F1A;&#x4E0A;&#x80FD;&#x8BB2;&#x51FA;&#x6709;&#x5DE5;&#x4F5C;&#x91CF;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5C31;&#x662F;&#x8FBE;&#x6807;&#x7684;&#x3002;</p>
<p>&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x770B;&#x7684;&#x300A;&#x5948;&#x98DE;&#x6587;&#x5316;&#x624B;&#x518C;&#x300B;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x4E00;&#x70B9;&#x5370;&#x8C61;&#x5F88;&#x6DF1;&#x523B;&#xFF1A;&#x73B0;&#x5728;&#x5927;&#x516C;&#x53F8;&#x60F3;&#x62DB;&#x8058;&#x7684;&#x5458;&#x5DE5;&#xFF0C;&#x90FD;&#x662F;&#x6210;&#x5E74;&#x4EBA;&#x3002;&#x600E;&#x4E48;&#x5B9A;&#x4E49;&#x6210;&#x5E74;&#x4EBA;&#x5462;&#xFF1F;&#x53EF;&#x80FD;&#x6BCF;&#x5BB6;&#x516C;&#x53F8;&#x5B9A;&#x4E49;&#x90FD;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#xFF0C;<strong>&#x4F46;&#x662F;&#x57FA;&#x7840;&#x7684;&#x5C31;&#x662F;&#xFF1A;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x50CF;&#x5C0F;&#x5B69;&#x5B50;&#x4E00;&#x6837;&#x65F6;&#x65F6;&#x76D1;&#x7763;&#x7740;&#x4F60;&#xFF0C;&#x8BA9;&#x4F60;&#x6253;&#x5361;&#x5B9A;&#x4E49;&#x91CF;&#x8868;&#xFF0C;&#x800C;&#x662F;&#x76F8;&#x4FE1;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x57FA;&#x672C;&#x7684;&#x8BC9;&#x6C42;&#x5F97;&#x5230;&#x6EE1;&#x8DB3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x505A;&#x6301;&#x7EED;&#x7A33;&#x5B9A;&#x7684;&#x8F93;&#x51FA;&#x3002;</strong>&#x8FD9;&#x4E00;&#x70B9;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x5C31;&#x4F53;&#x73B0;&#x7684;&#x975E;&#x5E38;&#x6DCB;&#x6F13;&#x5C3D;&#x81F4;&#x3002;</p>
<h2 id="&#x65B0;&#x4EBA;&#x4F53;&#x9A8C;"><a name="&#x65B0;&#x4EBA;&#x4F53;&#x9A8C;" class="anchor-navigation-ex-anchor" href="#&#x65B0;&#x4EBA;&#x4F53;&#x9A8C;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x65B0;&#x4EBA;&#x4F53;&#x9A8C;</h2>
<p>&#x4E0A;&#x9762;&#x804A;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x7684;&#x65E5;&#x5E38;&#x548C;&#x5DE5;&#x4F5C;&#x8282;&#x594F;&#xFF0C;&#x5927;&#x5BB6;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x5176;&#x5B9E;&#x6574;&#x4F53;&#x7684;&#x6C1B;&#x56F4;&#x8FD8;&#x662F;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x5BBD;&#x677E;&#xFF0C;&#x4E14;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x81EA;&#x4E3B;&#x6743;&#x7684;&#x3002;&#x90A3;&#x4E48;&#x65B0;&#x4EBA;&#x5165;&#x804C;&#x7684;&#x65F6;&#x5019;&#x611F;&#x89C9;&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF1F;</p>
<p>&#x5766;&#x7387;&#x7684;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x4EBA;&#x60F3;&#x8981;&#x52A0;&#x5165;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x95E8;&#x69DB;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x95E8;&#x69DB;&#x4E3B;&#x8981;&#x8868;&#x73B0;&#x4E3A;&#x4EE3;&#x7801;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x5DE5;&#x7A0B;&#x5B9E;&#x73B0;&#x74F6;&#x9888;&#x3002;&#x6211;&#x4EEC;&#x5206;&#x5F00;&#x6765;&#x8BF4;&#x3002;</p>
<p><strong>&#x4EE3;&#x7801;&#x7684;&#x96BE;&#x5EA6;&#x3002;</strong>&#x5728;&#x804A;&#x4EE3;&#x7801;&#x96BE;&#x5EA6;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x8BB2;&#x7684;&#x4E0D;&#x662F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x57FA;&#x7840;&#x8BED;&#x6CD5;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x800C;&#x662F;&#x968F;&#x7740;&#x4EE3;&#x7801;&#x91CF;&#x7684;&#x63D0;&#x5347;&#x5E26;&#x6765;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x589E;&#x52A0;&#x3002;&#x8FD9;&#x5F88;&#x5BB9;&#x6613;&#x4F1A;&#x8BA9;&#x6CA1;&#x6709;&#x5927;&#x578B;&#x4EE3;&#x7801;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x5B66;&#x6478;&#x4E0D;&#x7740;&#x5934;&#x8111;&#x3002;&#x987B;&#x77E5;&#xFF0C;&#x51E0;&#x767E;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x51E0;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x96BE;&#x5EA6;&#x7CFB;&#x6570;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5927;&#x578B;&#x9879;&#x76EE;&#x7684;&#x7EC4;&#x7EC7;&#x80CC;&#x540E;&#x901A;&#x5E38;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x7684;&#x57FA;&#x672C;&#x601D;&#x8DEF;(&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x5927;&#x91CF;&#x7684;&#x4E1A;&#x52A1;&#x80CC;&#x666F;)&#x548C;&#x4EE3;&#x7801;&#x7EC4;&#x7EC7;&#x7684;&#x4E00;&#x4E9B;&#x89C4;&#x8303;&#x548C;&#x65B9;&#x5F0F;(&#x6BD4;&#x5982;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;)&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x54EA;&#x4E00;&#x79CD;&#xFF0C;&#x90FD;&#x610F;&#x5473;&#x7740;&#x5927;&#x91CF;&#x7684;&#x540D;&#x8BCD;&#x5806;&#x780C;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x8981;&#x63A5;&#x89E6;&#x5230;&#x5927;&#x91CF;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E00;&#x822C;&#x9700;&#x8981;&#x65F6;&#x95F4;&#xFF0C;&#x5F88;&#x96BE;&#x5FEB;&#x901F;&#x6D88;&#x5316;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x65B0;&#x4EBA;&#x52A0;&#x5165;&#x6211;&#x4EEC;&#x7EC4;&#xFF0C;&#x901A;&#x5E38;&#x7B2C;&#x4E00;&#x4E2A;&#x6708;&#x5F88;&#x96BE;&#x6709;&#x6548;&#x7684;&#x4EA7;&#x51FA;&#x3002;</p>
<p><strong>&#x5DE5;&#x7A0B;&#x5B9E;&#x73B0;&#x74F6;&#x9888;&#x3002;</strong>&#x5F53;&#x6211;&#x4EEC;&#x79BB;&#x7EBF;&#x641E;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x641E;&#x7684;&#x975E;&#x5E38;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x641E;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x968F;&#x4FBF;&#x5199;&#x4E00;&#x4E9B;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x5728;&#x7EBF;&#x90E8;&#x7F72;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80CC;&#x540E;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x67B6;&#x6784;&#x5176;&#x5B9E;&#x662F;&#x9762;&#x4E34;&#x7740;&#x5F88;&#x591A;&#x7EA6;&#x675F;&#x3002;&#x8FD9;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x6211;&#x4EEC;&#x5728;&#x79BB;&#x7EBF;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x7528;pandas&#x968F;&#x4FBF;&#x641E;&#x4E00;&#x641E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5728;&#x5728;&#x7EBF;&#x73AF;&#x5883;&#x4E0B;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x9065;&#x4E0D;&#x53EF;&#x53CA;&#xFF0C;&#x9700;&#x8981;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x5DE5;&#x7A0B;&#x5F00;&#x53D1;&#x3002;&#x6BD4;&#x5982;&#x600E;&#x6837;&#x79D1;&#x5B66;&#x7684;&#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x5B9E;&#x76F8;&#x5BF9;&#x5C31;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x5DE5;&#x7A0B;&#x5F00;&#x53D1;&#x3002;</p>
<p><strong>&#x4E0D;&#x8FC7;&#x8FD9;&#x79CD;&#x5BA2;&#x89C2;&#x7684;&#x96BE;&#x5EA6;&#x5176;&#x5B9E;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x95E8;&#x69DB;&#x3002;&#x56E0;&#x4E3A;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4F60;&#x6765;&#x8BF4;&#x96BE;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5BF9;&#x5176;&#x4ED6;&#x4EBA;&#x4E5F;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x96BE;&#x5EA6;&#x3002;&#x800C;&#x95E8;&#x69DB;&#x901A;&#x5E38;&#x4E5F;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4F60;&#x4E00;&#x65E6;&#x8DE8;&#x8D8A;&#x8FC7;&#x53BB;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x62E6;&#x4E0B;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x3002;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x4E0D;&#x8981;&#x56E0;&#x4E3A;&#x96BE;&#x800C;&#x5374;&#x6B65;&#x3002;</strong></p>
<p><strong>&#x6211;&#x53CD;&#x800C;&#x7531;&#x8877;&#x7684;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#xFF0C;&#x5728;&#x9762;&#x4E34;&#x4EBA;&#x751F;&#x7684;&#x9009;&#x62E9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5404;&#x65B9;&#x9762;&#x90FD;&#x5176;&#x4ED6;&#x504F;&#x597D;&#x90FD;&#x4E00;&#x81F4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x9009;&#x62E9;&#x90A3;&#x4E9B;&#x96BE;&#x4E00;&#x70B9;&#x7684;&#x9053;&#x8DEF;&#x3002;&#x8FC8;&#x8FC7;&#x773C;&#x524D;&#x7684;&#x96BE;&#x5173;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x4E00;&#x7247;&#x901A;&#x9014;&#x3002;</strong></p>
<p>&#x5177;&#x4F53;&#x7684;&#x65B0;&#x4EBA;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x9002;&#x5E94;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x804C;&#x573A;&#xFF0C;&#x6211;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x5176;&#x5B9E;&#x8BB2;&#x4E86;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x4EE5;&#x53C2;&#x8003;</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> &#x4F5C;&#x8005;: <a href="https://dongfengchi.github.io/algo_engineer_zero_to_one" target="_blank">&#x5CF0;&#x6C60;</a>&#xFF0C;&#x4E00;&#x4E2A;&#x7231;&#x8BFB;&#x4E66;&#x7684;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08; </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> &#x6700;&#x8FD1;&#x66F4;&#x65B0;&#xFF1A; 2021-03-09 06:44:53 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="position_description.html" class="navigation navigation-prev " aria-label="Previous page: 1-2 互联网中的主要岗位都是在干些啥？">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2-the_way_grown_up.html" class="navigation navigation-next " aria-label="Next page: 1-4 晋升路径&回报">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1-3 工作体验","level":"2.3","depth":1,"next":{"title":"1-4 晋升路径&回报","level":"2.4","depth":1,"path":"chap01/2-the_way_grown_up.md","ref":"./chap01/2-the_way_grown_up.md","articles":[]},"previous":{"title":"1-2 互联网中的主要岗位都是在干些啥？","level":"2.2","depth":1,"path":"chap01/position_description.md","ref":"./chap01/position_description.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","-sharing","github-buttons","editlink","ga","-highlight","prism","bibtex-indexed-cite","anchor-navigation-ex","page-footer-ex","splitter","todo","copy-code-button","expandable-chapters-small","donate","katex","statistics"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"ignore":["mermaid","eval-js"],"css":["prismjs/themes/prism-solarizedlight.css"]},"statistics":{"bd_url":"https://hm.baidu.com/hm.js","cnzz_url":"https://s95.cnzz.com/z_stat.php","google_url":"https://www.googletagmanager.com/gtag/js","cnzz_id":1279720611},"editlink":{"label":"Edit","multilingual":false,"base":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"},"todo":{},"page-footer-ex":{"copyright":"作者: [峰池](https://dongfengchi.github.io/algo_engineer_zero_to_one)，一个爱读书的算法工程师","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"最近更新："},"splitter":{},"search-pro":{"cutWordLib":"nodejieba","defineWord":["Gitbook Use"]},"donate":{"alipay":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat.jpg","alipayText":"微信打赏","button":"赏","title":"","wechat":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat_mp.jpg","wechatText":"关注公众号：峰池"},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":false},"bibtex-indexed-cite":{"path":"/"},"github-buttons":{"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]},"expandable-chapters-small":{},"links":{"sidebar":{"Home":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"}},"copy-code-button":{},"ga":{"configuration":"auto","token":"G-0FKP0E9H88"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"峰池","pdf":{"pageNumbers":true,"fontSize":14,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":30,"left":30,"top":32,"bottom":32}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"bibCount":0,"variables":{},"title":"算法工程师从零到一","bib":[],"gitbook":"*"},"file":{"path":"chap01/3-work_experience.md","mtime":"2021-03-09T06:44:53.212Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-09T06:45:42.115Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-statistics/statistics.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

