
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1-5 其他问题：城市、户口&实习 · 算法工程师从零到一</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="峰池">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-bibtex-indexed-cite/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../chap02/1-preparing.html" />
    
    
    <link rel="prev" href="2-the_way_grown_up.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    算法工程师从零到一
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">01 行业背景</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="1-internet_industry_trend.html">
            
                <a href="1-internet_industry_trend.html">
            
                    
                    1-1 互联网整体发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="position_description.html">
            
                <a href="position_description.html">
            
                    
                    1-2 互联网中的主要岗位都是在干些啥？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="3-work_experience.html">
            
                <a href="3-work_experience.html">
            
                    
                    1-3 工作体验
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="2-the_way_grown_up.html">
            
                <a href="2-the_way_grown_up.html">
            
                    
                    1-4 晋升路径&回报
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.5" data-path="4-other_questions.html">
            
                <a href="4-other_questions.html">
            
                    
                    1-5 其他问题：城市、户口&实习
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">02 找工作</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../chap02/1-preparing.html">
            
                <a href="../chap02/1-preparing.html">
            
                    
                    2-1 求职准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../chap02/2-process.html">
            
                <a href="../chap02/2-process.html">
            
                    
                    2-2 整体流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../chap02/3-resume.html">
            
                <a href="../chap02/3-resume.html">
            
                    
                    2-3 简历制作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="../chap02/4-interview.html">
            
                <a href="../chap02/4-interview.html">
            
                    
                    2-4 面试准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="../chap02/5-choice.html">
            
                <a href="../chap02/5-choice.html">
            
                    
                    2-5 Offer选择
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">03 日常工作</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../chap03/1-basics.html">
            
                <a href="../chap03/1-basics.html">
            
                    
                    3-1 工程基础：线上系统，代码先行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../chap03/2-sort.html">
            
                <a href="../chap03/2-sort.html">
            
                    
                    3-2 排序模块：推荐系统的目标是什么？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="../chap03/3-recall.html">
            
                <a href="../chap03/3-recall.html">
            
                    
                    3-3 召回模块：海量候选的快速匹配
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="../chap03/4-instance.html">
            
                <a href="../chap03/4-instance.html">
            
                    
                    3-4 样本拼接&模型训练
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">04 新人进阶</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../chap04/write_to_new_engineer.html">
            
                <a href="../chap04/write_to_new_engineer.html">
            
                    
                    4-1 写给新人算法工程师
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="../chap04/2-how_to_make_money.html">
            
                <a href="../chap04/2-how_to_make_money.html">
            
                    
                    4-2 商业模式：互联网如何赚钱
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">05 推荐资料</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../chap05/1-book_recommend.html">
            
                <a href="../chap05/1-book_recommend.html">
            
                    
                    5-1 推荐资料
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1-5 其他问题：城市、户口&实习</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#1-5-&#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF1A;&#x57CE;&#x5E02;&#x3001;&#x6237;&#x53E3;&#x5B9E;&#x4E60;"><b></b>1-5 &#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF1A;&#x57CE;&#x5E02;&#x3001;&#x6237;&#x53E3;&amp;&#x5B9E;&#x4E60;</a></li><ul><li><span class="title-icon "></span><a href="#&#x57CE;&#x5E02;&#x9009;&#x62E9;"><b></b>&#x57CE;&#x5E02;&#x9009;&#x62E9;</a></li><li><span class="title-icon "></span><a href="#&#x6237;&#x53E3;"><b></b>&#x6237;&#x53E3;</a></li><li><span class="title-icon "></span><a href="#&#x5B9E;&#x4E60;&#x9009;&#x62E9;"><b></b>&#x5B9E;&#x4E60;&#x9009;&#x62E9;</a></li></ul></ul></div><a href="#1-5-&#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF1A;&#x57CE;&#x5E02;&#x3001;&#x6237;&#x53E3;&#x5B9E;&#x4E60;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="1-5-&#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF1A;&#x57CE;&#x5E02;&#x3001;&#x6237;&#x53E3;&#x5B9E;&#x4E60;"><a name="1-5-&#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF1A;&#x57CE;&#x5E02;&#x3001;&#x6237;&#x53E3;&#x5B9E;&#x4E60;" class="anchor-navigation-ex-anchor" href="#1-5-&#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF1A;&#x57CE;&#x5E02;&#x3001;&#x6237;&#x53E3;&#x5B9E;&#x4E60;"><i class="fa fa-link" aria-hidden="true"></i></a>1-5 &#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF1A;&#x57CE;&#x5E02;&#x3001;&#x6237;&#x53E3;&amp;&#x5B9E;&#x4E60;</h1>
<p>&#x6211;&#x8FD9;&#x91CC;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E9B;&#x540C;&#x5B66;&#x4EEC;&#x65E5;&#x5E38;&#x4F1A;&#x5411;&#x6211;&#x63D0;&#x95EE;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x57CE;&#x5E02;&#x9009;&#x62E9;"><a name="&#x57CE;&#x5E02;&#x9009;&#x62E9;" class="anchor-navigation-ex-anchor" href="#&#x57CE;&#x5E02;&#x9009;&#x62E9;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x57CE;&#x5E02;&#x9009;&#x62E9;</h2>
<p>&#x60F3;&#x4ECE;&#x4E8B;&#x4E92;&#x8054;&#x7F51;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x7684;&#x57CE;&#x5E02;&#x662F;&#x6BD4;&#x8F83;&#x5C11;&#x7684;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x53EA;&#x6709;&#x4E00;&#x4E9B;&#x5927;&#x578B;&#x57CE;&#x5E02;&#xFF0C;&#x6BD4;&#x5982;&#x5317;&#x4EAC;&#x3001;&#x6DF1;&#x5733;&#x3001;&#x676D;&#x5DDE;&#x3001;&#x4E0A;&#x6D77;&#x8FD9;&#x51E0;&#x4E2A;&#x5730;&#x65B9;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x4E8C;&#x7EBF;&#x57CE;&#x5E02;&#xFF0C;&#x6216;&#x8005;&#x6CA1;&#x6709;&#x4E92;&#x8054;&#x7F51;&#x57FA;&#x7840;&#x7684;&#x57CE;&#x5E02;&#x4E2D;&#xFF0C;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x4EBA;&#x624D;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x5F88;&#x96BE;&#x53D1;&#x5C55;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x800C;&#x5728;&#x5927;&#x57CE;&#x5E02;&#x4E2D;&#x505A;&#x9009;&#x62E9;&#xFF0C;&#x4E0D;&#x5982;&#x8BF4;&#x662F;&#x5728;&#x4F17;&#x591A;&#x5927;&#x578B;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x4E2D;&#x505A;&#x9009;&#x62E9;&#x3002;&#x56E0;&#x4E3A;&#x9664;&#x4E86;&#x5317;&#x4EAC;&#x5F53;&#x524D;&#x53EB;&#x5F97;&#x51FA;&#x540D;&#x5B57;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x591A;&#x4E00;&#x70B9;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x6BD4;&#x5982;&#x63D0;&#x8D77;&#x6DF1;&#x5733;&#x5C31;&#x79BB;&#x4E0D;&#x4E86;&#x817E;&#x8BAF;&#xFF1B;&#x63D0;&#x8D77;&#x676D;&#x5DDE;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x548C;&#x963F;&#x91CC;&#x3001;&#x7F51;&#x6613;&#x6709;&#x5173;&#xFF1B;&#x800C;&#x63D0;&#x8D77;&#x4E0A;&#x6D77;&#x76EE;&#x524D;&#x6BD4;&#x8F83;&#x54CD;&#x4EAE;&#x7684;&#x6709;&#x62FC;&#x591A;&#x591A;&#x3001;B&#x7AD9;&#x3002;&#x867D;&#x7136;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x6BD4;&#x5982;&#x50CF;&#x5B57;&#x8282;&#x8DF3;&#x52A8;&#x5168;&#x4E2D;&#x56FD;&#x6709;&#x5F88;&#x591A;&#x7814;&#x53D1;&#x4E2D;&#x5FC3;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x80FD;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x5F53;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x548C;&#x90E8;&#x95E8;&#x786E;&#x5B9A;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x57FA;&#x672C;&#x4E5F;&#x5C31;&#x786E;&#x5B9A;&#x4E86;&#x5DE5;&#x4F5C;&#x5730;&#x70B9;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x5F53;&#x9009;&#x62E9;&#x786E;&#x5B9A;&#x4E86;&#x516C;&#x53F8;&#x4E4B;&#x540E;&#xFF0C;&#x5DE5;&#x4F5C;&#x5730;&#x70B9;&#x548C;&#x57CE;&#x5E02;&#x5C31;&#x786E;&#x5B9A;&#x4E86;&#x4E0B;&#x6765;&#x3002;</p>
<p>&#x800C;&#x9009;&#x62E9;&#x516C;&#x53F8;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x884C;&#x4E1A;&#x3001;&#x8D5B;&#x9053;&#x4EE5;&#x53CA;&#x4F01;&#x4E1A;&#x6587;&#x5316;&#x76F8;&#x5173;&#x7684;&#x7EFC;&#x5408;&#x6027;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x90FD;&#x80FD;&#x6709;&#x6240;&#x8033;&#x95FB;&#xFF0C;&#x5C31;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x5355;&#x72EC;&#x804A;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x81EA;&#x5DF1;&#x9762;&#x4E34;&#x591A;&#x4E2A;&#x57CE;&#x5E02;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x4E48;&#x9009;&#x62E9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x4E00;&#x3001;&#x8003;&#x8651;&#x53E6;&#x4E00;&#x534A;&#x7684;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x548C;&#x57CE;&#x5E02;&#x9009;&#x62E9;&#xFF1B;&#x4E8C;&#x3001;&#x9009;&#x62E9;&#x6574;&#x4F53;&#x4E92;&#x8054;&#x7F51;&#x6C1B;&#x56F4;&#x66F4;&#x6D53;&#x539A;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x6BD4;&#x5982;&#x5317;&#x4EAC;&#xFF1B;&#x8FD9;&#x6837;&#x5C06;&#x6765;&#x60F3;&#x8DF3;&#x69FD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#x627E;&#x4E0B;&#x5BB6;&#x3002;&#x5DE5;&#x4F5C;&#x6210;&#x5BB6;&#x4E4B;&#x540E;&#x518D;&#x4E3E;&#x5BB6;&#x642C;&#x8FC1;&#xFF0C;&#x53EF;&#x80FD;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x51B3;&#x5B9A;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x9009;&#x62E9;&#x57CE;&#x5E02;&#x7684;&#x62C5;&#x5FE7;&#xFF0C;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x70B9;&#xFF0C;&#x4E00;&#x70B9;&#x662F;&#x623F;&#x4EF7;&#xFF0C;&#x4E00;&#x70B9;&#x662F;&#x6237;&#x53E3;&#x3002;</p>
<p>&#x9996;&#x5148;&#x804A;&#x804A;&#x623F;&#x4EF7;&#x3002;&#x5927;&#x5BB6;&#x5728;&#x9762;&#x4E34;&#x57CE;&#x5E02;&#x9009;&#x62E9;&#x9009;&#x62E9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x6240;&#x5728;&#x5730;&#x7684;&#x623F;&#x4EF7;&#x5413;&#x5230;&#xFF0C;&#x89C9;&#x5F97;&#x538B;&#x529B;&#x592A;&#x5927;&#x65E0;&#x529B;&#x507F;&#x8FD8;&#x3002;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x770B;&#x6CD5;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x80FD;&#x529B;&#x8DB3;&#x591F;&#x8FDB;&#x5165;&#x5934;&#x90E8;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#xFF0C;&#x90A3;&#x4E48;&#x623F;&#x4EF7;&#x5BF9;&#x4F60;&#x6765;&#x8BF4;&#x5E94;&#x8BE5;&#x95EE;&#x9898;&#x4E0D;&#x5927;&#x3002;&#x623F;&#x4EF7;&#x95EE;&#x9898;&#x53EA;&#x662F;&#x65F6;&#x95F4;&#x95EE;&#x9898;&#x3002;&#x800C;&#x4E14;&#x623F;&#x4EF7;&#x95EE;&#x9898;&#x5C5E;&#x4E8E;&#x539A;&#x79EF;&#x8584;&#x53D1;&#x6025;&#x4E0D;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x679C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x672A;&#x6765;&#x8FD8;&#x9700;&#x8981;&#x594B;&#x6597;&#x4E00;&#x628A;&#x640F;&#x4E00;&#x640F;&#xFF0C;&#x4E0D;&#x8981;&#x88AB;&#x8FD9;&#x79CD;&#x5341;&#x5E74;&#x4E4B;&#x540E;&#x7684;&#x95EE;&#x9898;&#x59A8;&#x788D;&#x4E86;&#x81EA;&#x5DF1;&#x5F53;&#x524D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4E0D;&#x8003;&#x8651;&#x6B7B;&#x4EA1;&#x4E4B;&#x540E;&#x7684;&#x4E8B;&#x60C5;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5176;&#x6B21;&#x662F;&#x6237;&#x53E3;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x540C;&#x5B66;&#x5BF9;&#x57CE;&#x5E02;&#x7684;&#x62C5;&#x5FE7;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5BF9;&#x4E8E;&#x6237;&#x53E3;&#x7684;&#x62C5;&#x5FE7;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x628A;&#x6237;&#x53E3;&#x5355;&#x72EC;&#x62C6;&#x51FA;&#x6765;&#x804A;&#x4E00;&#x804A;&#x3002;</p>
<h2 id="&#x6237;&#x53E3;"><a name="&#x6237;&#x53E3;" class="anchor-navigation-ex-anchor" href="#&#x6237;&#x53E3;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6237;&#x53E3;</h2>
<p>&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5C5E;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#xFF0C;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x76EE;&#x524D;&#x662F;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x62FF;&#x5230;&#x6237;&#x53E3;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x7EA0;&#x7ED3;&#x4E0D;&#x5DF2;&#x3002;&#x5728;&#x5317;&#x4EAC;&#x8FD9;&#x4E00;&#x70B9;&#x63A3;&#x8098;&#x66F4;&#x751A;&#xFF0C;&#x56E0;&#x4E3A;&#x6DF1;&#x5733;&#x548C;&#x4E0A;&#x6D77;&#x5F53;&#x524D;&#x7684;&#x6237;&#x53E3;&#x653F;&#x7B56;&#x8FD8;&#x53EF;&#x4EE5;&#x9760;&#x79EF;&#x5206;&#xFF0C;&#x4F46;&#x662F;&#x5317;&#x4EAC;&#x57FA;&#x672C;&#x53EA;&#x6709;&#x6BD5;&#x4E1A;&#x8FD9;&#x4E00;&#x6B21;&#x6237;&#x53E3;&#x83B7;&#x5F97;&#x673A;&#x4F1A;&#x3002;&#x6709;&#x4E00;&#x4E9B;&#x540C;&#x5B66;&#x4E3A;&#x6B64;&#x6DF1;&#x6DF1;&#x82E6;&#x607C;&#x3002;</p>
<p>&#x6237;&#x53E3;&#x6574;&#x4F53;&#x7684;&#x5927;&#x539F;&#x5219;&#x662F;&#xFF0C;&#x80FD;&#x62FF;&#x5C3D;&#x91CF;&#x62FF;&#xFF0C;&#x4F46;&#x8981;&#x6CE8;&#x610F;&#x63A7;&#x5236;&#x635F;&#x5931;&#x3002;&#x6709;&#x51E0;&#x4E2A;&#x9014;&#x5F84;&#xFF1A;</p>
<p><strong>&#x4E00;&#x3001;&#x7A33;&#x5065;&#x578B;&#x3002;</strong>&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x5728;&#x6BD5;&#x4E1A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x7A33;&#x5B9A;&#x7684;&#x7537;&#x5973;&#x670B;&#x53CB;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5206;&#x5DE5;&#xFF0C;&#x4E00;&#x4EBA;&#x53BB;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x80AF;&#x5B9A;&#x6709;&#x6237;&#x53E3;&#x7684;&#x5730;&#x65B9;&#x6BD4;&#x5982;&#x5927;&#x591A;&#x6570;&#x7684;&#x94F6;&#x884C;&#x548C;&#x4E8B;&#x4E1A;&#x5355;&#x4F4D;&#xFF0C;&#x4E00;&#x4EBA;&#x8D70;&#x4E92;&#x8054;&#x7F51;(&#x5DE5;&#x8D44;&#x9AD8;)&#x3002;&#x8FD9;&#x6837;&#x5927;&#x5BB6;&#x6574;&#x4F53;&#x6536;&#x5165;&#x548C;&#x6237;&#x53E3;&#x90FD;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4FDD;&#x969C;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x5206;&#x5DE5;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x5728;&#x4E0D;&#x786E;&#x5B9A;&#x5C06;&#x6765;&#x8981;&#x53BB;&#x54EA;&#x5EA7;&#x57CE;&#x5E02;&#x53D1;&#x5C55;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x4E00;&#x4EBA;&#x62FF;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#x7684;&#x6237;&#x53E3;&#xFF0C;&#x6BD4;&#x5982;&#x5317;&#x4EAC;&#x3001;&#x6DF1;&#x5733;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x628A;&#x672A;&#x6765;&#x7684;&#x9009;&#x62E9;&#x6743;&#x90A3;&#x5728;&#x81EA;&#x5DF1;&#x624B;&#x4E2D;&#x3002;</p>
<p><strong>&#x4E8C;&#x3001;&#x6BD5;&#x4E1A;&#x4E00;&#x5E74;&#x5148;&#x62FF;&#x6237;&#x53E3;&#xFF0C;&#x7136;&#x540E;&#x8DF3;&#x69FD;&#x3002;</strong>&#x6BD4;&#x5982;&#x5148;&#x53BB;&#x67D0;&#x4E00;&#x4E2A;&#x7814;&#x7A76;&#x6240;&#x3001;&#x6216;&#x8005;&#x5C0F;&#x516C;&#x53F8;&#x62FF;&#x5230;&#x6237;&#x53E3;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x652F;&#x4ED8;xx&#x4E07;&#x7684;&#x8FDD;&#x7EA6;&#x91D1;&#x8DF3;&#x69FD;&#x3002;&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x6211;&#x4E2A;&#x4EBA;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x5EFA;&#x8BAE;&#x3002;&#x6709;&#x51E0;&#x70B9;&#x539F;&#x56E0;&#xFF0C;&#x4E00;&#x3001;&#x65F6;&#x95F4;&#x9884;&#x671F;&#x3002;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x53E3;&#x5934;&#x4E0A;&#x627F;&#x8BFA;&#x662F;&#x4E00;&#x5E74;&#x540E;&#x5E2E;&#x5FD9;&#x843D;&#x6237;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x843D;&#x6237;&#x7684;&#x6D41;&#x7A0B;&#x6574;&#x4F53;&#x6BD4;&#x8F83;&#x5197;&#x957F;&#xFF0C;&#x7B49;&#x771F;&#x6B63;&#x6237;&#x53E3;&#x5230;&#x624B;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x8981;&#x63A5;&#x8FD1;&#x4E24;&#x5E74;&#x4E86;&#x3002;&#x4E8C;&#x3001;&#x6210;&#x957F;&#x901F;&#x7387;&#x53D7;&#x635F;&#x3002;&#x6BD5;&#x4E1A;&#x524D;&#x51E0;&#x5E74;&#x662F;&#x4E2A;&#x4EBA;&#x6210;&#x957F;&#x6700;&#x5FEB;&#xFF0C;&#x57F9;&#x517B;&#x5DE5;&#x4F5C;&#x4E60;&#x60EF;&#x6700;&#x5173;&#x952E;&#x7684;&#x51E0;&#x5E74;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x6709;&#x6237;&#x53E3;&#x6307;&#x6807;&#x7684;&#x7814;&#x7A76;&#x6240;&#x6216;&#x8005;&#x56FD;&#x4F01;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x6574;&#x4F53;&#x7684;&#x5DE5;&#x4F5C;&#x6C1B;&#x56F4;&#x548C;&#x4EBA;&#x5458;&#x8D28;&#x91CF;&#x662F;&#x4E0D;&#x5982;&#x4E00;&#x7EBF;&#x4E92;&#x8054;&#x7F51;&#x5927;&#x5382;&#x7684;&#x3002;&#x4FD7;&#x8BDD;&#x8BF4;&#xFF0C;&#x7531;&#x4FED;&#x5165;&#x5962;&#x6613;&#xFF0C;&#x7531;&#x5962;&#x8FD4;&#x7B80;&#x96BE;&#xFF0C;&#x4F60;&#x90A3;&#x91CC;&#x57F9;&#x517B;&#x7684;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x4E60;&#x60EF;&#x548C;&#x4E00;&#x4E9B;&#x5BF9;&#x4E16;&#x754C;&#x7684;&#x89C2;&#x70B9;&#x6001;&#x5EA6;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x9AD8;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#x4E27;&#x5931;&#x7ADE;&#x4E89;&#x529B;&#x3002;</p>
<p><strong>&#x4E09;&#x3001;&#x4E92;&#x8054;&#x7F51;&#x81EA;&#x8EAB;&#x6709;&#x6237;&#x53E3;&#x3002;</strong>&#x8FD9;&#x662F;&#x5927;&#x90E8;&#x5206;&#x4E92;&#x8054;&#x7F51;&#x4EBA;&#x68A6;&#x5BD0;&#x4EE5;&#x6C42;&#x7684;&#x3002;&#x4F46;&#x5927;&#x591A;&#x6570;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x7684;&#x5957;&#x8DEF;&#x90FD;&#x662F;&#xFF1A;&#x5728;&#x62DB;&#x8058;&#x65F6;&#x5019;&#x4E0D;&#x627F;&#x8BFA;&#xFF0C;&#x53EA;&#x662F;&#x8BF4;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x7ED9;&#x4F60;&#x4E00;&#x70B9;&#x5E0C;&#x671B;&#xFF0C;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x662F;&#x4F60;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x4E0D;&#x662F;&#x4F60;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x628A;&#x4EBA;&#x540A;&#x4F4F;&#x7684;&#x611F;&#x89C9;&#x662F;&#x5F88;&#x4E0D;&#x597D;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x901A;&#x5E38;&#x88AB;&#x540A;&#x4F4F;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x4E5F;&#x5F88;&#x5927;&#x53EF;&#x80FD;&#x62FF;&#x4E0D;&#x5230;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x5FD7;&#x5728;&#x5FC5;&#x5F97;&#x7684;&#x540C;&#x5B66;&#x6765;&#x8BF4;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x662F;&#x7AF9;&#x7BEE;&#x6253;&#x6C34;&#x4E00;&#x573A;&#x7A7A;&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x7684;&#x6237;&#x53E3;&#x591A;&#x591A;&#x5C11;&#x5C11;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x60E9;&#x7F5A;&#x673A;&#x5236;&#xFF1A;&#x6BD4;&#x5982;3&#x5E74;&#x79BB;&#x804C;12&#x4E07;&#x8FD9;&#x79CD;&#x3002;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x4F60;&#x62FF;&#x5230;&#x6237;&#x53E3;&#x4E4B;&#x540E;3&#x5E74;&#x5185;&#x79BB;&#x804C;&#xFF0C;&#x90FD;&#x8981;&#x8D54;&#x507F;&#x516C;&#x53F8;&#x4E00;&#x7B14;&#x6237;&#x53E3;&#x7684;&#x8865;&#x507F;&#x91D1;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x516C;&#x53F8;&#x4E3A;&#x4E86;&#x62F4;&#x4F4F;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x4F18;&#x79C0;&#x4EBA;&#x624D;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x3002;&#x6240;&#x4EE5;&#x6237;&#x53E3;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x5BF9;&#x90A3;&#x4E9B;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x624D;&#x624D;&#x4F1A;&#x7ED9;&#x3002;</p>
<p>&#x6211;&#x8FD9;&#x91CC;&#x804A;&#x51E0;&#x4E2A;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x5728;&#x6BD5;&#x4E1A;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x62FF;&#x5230;&#x6237;&#x53E3;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x70B9;&#x3002;&#x5927;&#x5BB6;&#x8981;&#x660E;&#x767D;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6237;&#x53E3;&#x662F;&#x516C;&#x53F8;&#x5956;&#x52B1;&#x7ED9;&#x90A3;&#x4E9B;&#x540C;&#x9F84;&#x4EBA;&#x4E2D;&#x8DB3;&#x591F;&#x4F18;&#x79C0;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x5C3D;&#x91CF;&#x52AA;&#x529B;&#x6210;&#x4E3A;&#x540C;&#x4E00;&#x7EA7;&#x4E2D;&#x90A3;&#x4E9B;&#x4F18;&#x79C0;&#x7684;&#x540C;&#x5B66;&#x3002;</p>
<ol>
<li>&#x6709;&#x5206;&#x91CF;&#x7684;&#x8BBA;&#x6587;&#x3002;&#x8FD9;&#x4E2A;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#xFF0C;&#x4F53;&#x73B0;&#x4F60;&#x5728;&#x5B66;&#x6821;&#x671F;&#x95F4;&#x80FD;&#x529B;&#x7684;&#x65F6;&#x5019;&#x5230;&#x4E86;&#x3002;&#x4E14;&#x8FD9;&#x4E2A;&#x8BBA;&#x6587;&#x6700;&#x597D;&#x548C;&#x5C97;&#x4F4D;&#x9700;&#x8981;&#x7684;&#x8BBA;&#x6587;&#x5339;&#x914D;&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x662F;&#x7814;&#x7A76;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x7684;&#xFF0C;&#x53D1;&#x4E86;&#x9876;&#x520A;&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BBA;&#x6587;&#x5BF9;&#x4E8E;&#x505A;&#x63A8;&#x8350;&#x6765;&#x8BF4;&#x5206;&#x91CF;&#x5C31;&#x5F88;&#x91CD;&#xFF0C;&#x5BF9;&#x4E8E;&#x505A;CV&#x7684;&#x53EF;&#x80FD;&#x5C31;&#x5E2E;&#x52A9;&#x4E0D;&#x5927;&#x3002;</li>
<li>&#x5B9E;&#x4E60;&#x3002;&#x5C24;&#x5176;&#x662F;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x5B9E;&#x4E60;&#xFF0C;&#x5BF9;&#x62FF;&#x6237;&#x53E3;&#x662F;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002;&#x6211;&#x60F3;&#x63D0;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x603B;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x7406;&#x7531;&#x4E0D;&#x613F;&#x610F;&#x63D0;&#x65E9;&#x53BB;&#x5B9E;&#x4E60;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x7406;&#x7531;&#x662F;&#x8BBA;&#x6587;&#x4EE5;&#x53CA;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x51C6;&#x5907;&#x597D;&#x3002;&#x8FD9;&#x662F;&#x4E2A;&#x4EBA;&#x7684;&#x9009;&#x62E9;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#x63D0;&#x65E9;&#x5B9E;&#x4E60;&#x7684;&#x6F5C;&#x5728;&#x6536;&#x76CA;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x80FD;&#x770B;&#x5F97;&#x5230;&#x7684;&#x6536;&#x76CA;&#x6709;&#x4E24;&#x70B9;&#xFF1A;<strong>&#x4E00;&#x3001;&#x63D0;&#x65E9;&#x79EF;&#x7D2F;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#xFF0C;&#x5BF9;&#x5C3D;&#x65E9;&#x664B;&#x5347;&#x662F;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x800C;&#x8FD9;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x52A0;&#x85AA;(&#x8F83;&#x5927;&#x5E45;&#x5EA6;)&#xFF1B;&#x4E8C;&#x3001;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x5728;&#x5B9E;&#x4E60;&#x671F;&#x95F4;&#x6709;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#xFF0C;&#x5F97;&#x5230;&#x5927;&#x5BB6;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x90A3;&#x4E48;&#x6237;&#x53E3;&#x4F1A;&#x662F;&#x5F88;&#x5927;&#x6982;&#x7387;&#x7684;&#x3002;</strong>&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x7684;offer&#x4E2D;&#x662F;&#x53EF;&#x80FD;&#x6709;&#x6237;&#x53E3;&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x53EF;&#x80FD;&#x6027;&#x771F;&#x6B63;&#x843D;&#x5230;&#x4F60;&#x5934;&#x4E0A;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x5927;&#x3002;&#x6211;&#x8EAB;&#x8FB9;&#x5C31;&#x6709;&#x4E24;&#x4E2A;&#x540C;&#x5B66;&#xFF0C;&#x62FF;&#x7740;&#x5B57;&#x8282;&#x666E;&#x901A;&#x7684;&#x7B97;&#x6CD5;offer&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x5927;&#x5BB6;&#x5BF9;&#x4ED6;&#x4EEC;&#x5B9E;&#x4E60;&#x671F;&#x95F4;&#x5DE5;&#x4F5C;&#x80FD;&#x529B;&#x7684;&#x80AF;&#x5B9A;&#xFF0C;&#x5728;&#x975E;&#x9884;&#x671F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x62FF;&#x5230;&#x4E86;&#x6237;&#x53E3;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x5B9E;&#x4E60;&#xFF0C;&#x5982;&#x679C;&#x6700;&#x7EC8;&#x7559;&#x7528;&#xFF0C;&#x5927;&#x6982;&#x7387;&#x662F;&#x6709;&#x6237;&#x53E3;&#x7684;(&#x5B9E;&#x4E60;&#x65F6;&#x95F4;&#x957F;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x548C;&#x8001;&#x677F;&#x804A;&#x7684;)&#x3002;</li>
<li>&#x5F02;&#x5730;&#x6237;&#x53E3;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x5728;&#x5F02;&#x5730;&#x6709;&#x529E;&#x516C;&#x573A;&#x6240;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x6BD4;&#x5982;&#x5B57;&#x8282;&#x3001;&#x817E;&#x8BAF;&#x3001;&#x963F;&#x91CC;&#xFF0C;&#x8FD9;&#x4E9B;&#x516C;&#x53F8;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x53EF;&#x80FD;&#x6709;&#x5F02;&#x5730;&#x6237;&#x53E3;&#x80FD;&#x529B;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x4F60;&#x4EBA;&#x5728;&#x5317;&#x4EAC;&#x4E0A;&#x73ED;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x516C;&#x53F8;&#x5E2E;&#x52A9;&#x4F60;&#x5728;&#x6DF1;&#x5733;&#x843D;&#x6237;&#x3002;&#x4F46;&#x662F;&#x5177;&#x4F53;&#x516C;&#x53F8;&#x7684;&#x653F;&#x7B56;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x662F;&#x534A;&#x4FDD;&#x5BC6;&#x72B6;&#x6001;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x8981;&#x591A;&#x548C;HR&#x6C9F;&#x901A;&#xFF0C;&#x63A2;&#x63A2;&#x653F;&#x7B56;&#x548C;&#x53E3;&#x98CE;&#x3002;</li>
</ol>
<h2 id="&#x5B9E;&#x4E60;&#x9009;&#x62E9;"><a name="&#x5B9E;&#x4E60;&#x9009;&#x62E9;" class="anchor-navigation-ex-anchor" href="#&#x5B9E;&#x4E60;&#x9009;&#x62E9;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5B9E;&#x4E60;&#x9009;&#x62E9;</h2>
<p>&#x5982;&#x679C;&#x53EA;&#x6709;&#x4E00;&#x6B21;&#x5B9E;&#x4E60;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5C3D;&#x91CF;&#x9009;&#x62E9;&#x5927;&#x5382;&#xFF0C;&#x5927;&#x5382;&#x662F;&#x5B9E;&#x4E60;&#x7684;&#x786C;&#x901A;&#x8D27;&#x3002;&#x5C31;&#x5982;&#x540C;&#x5728;&#x5B66;&#x751F;&#x65F6;&#x4EE3;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x52A0;&#x8BA4;&#x53EF;&#x5317;&#x5927;&#x6E05;&#x534E;&#x7684;&#x5B66;&#x751F;&#x4E00;&#x6837;&#xFF1B;&#x5728;&#x5DE5;&#x4F5C;&#x65F6;&#x4EE3;&#xFF0C;&#x5927;&#x5BB6;&#x66F4;&#x52A0;&#x8BA4;&#x53EF;&#x7684;&#x662F;&#x5728;&#x5927;&#x5382;&#x7684;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x548C;&#x7ECF;&#x5386;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5F00;&#x59CB;&#x89C4;&#x5212;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x65E9;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x673A;&#x4F1A;&#x591A;&#x4EFD;&#x5B9E;&#x4E60;&#x3002;&#x90A3;&#x6211;&#x4E5F;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x591A;&#x770B;&#x770B;&#xFF0C;&#x611F;&#x53D7;&#x4E00;&#x4E0B;&#x4E0D;&#x540C;&#x516C;&#x53F8;&#x7684;&#x4E0D;&#x540C;&#x5C97;&#x4F4D;&#x7684;&#x5DE5;&#x4F5C;&#x6C1B;&#x56F4;&#xFF0C;&#x9009;&#x62E9;&#x4E00;&#x4EFD;&#x81EA;&#x5DF1;&#x66F4;&#x52A0;&#x559C;&#x6B22;&#x7684;&#x884C;&#x4E1A;&#x548C;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x3002;&#x6BD5;&#x7ADF;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x518D;&#x591A;&#x4EBA;&#x7684;&#x7ECF;&#x9A8C;&#x8D34;&#x90FD;&#x662F;&#x90FD;&#x662F;&#x8033;&#x542C;&#x4E3A;&#x865A;&#x773C;&#x89C1;&#x4E3A;&#x5B9E;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6211;&#x4E0D;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x4E3A;&#x4E86;&#x5237;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5F3A;&#x884C;&#x8BF4;&#x6BD4;&#x5982;&#x6BCF;&#x8FC7;&#x4E09;&#x56DB;&#x4E2A;&#x6708;&#x5C31;&#x6362;&#x4E00;&#x4EFD;&#x5B9E;&#x4E60;&#xFF0C;&#x5982;&#x679C;&#x4E0A;&#x4E00;&#x4EFD;&#x5B9E;&#x4E60;&#x4E0D;&#x60F3;&#x505A;&#x4E86;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x552F;&#x4E00;&#x7684;&#x5408;&#x9002;&#x7684;&#x66F4;&#x6362;&#x5B9E;&#x4E60;&#x7684;&#x7406;&#x7531;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x4E0D;&#x60F3;&#x505A;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4E0D;&#x9002;&#x5E94;&#x73B0;&#x5728;&#x7684;&#x5DE5;&#x4F5C;&#x8282;&#x594F;&#x3001;&#x4E0D;&#x559C;&#x6B22;&#x73B0;&#x5728;&#x7684;&#x7EC4;&#x3001;&#x6216;&#x8005;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5728;&#x5F53;&#x524D;&#x7684;&#x5B9E;&#x4E60;&#x5C97;&#x4F4D;&#x4E0A;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x989D;&#x5916;&#x7684;&#x5B66;&#x4E60;&#x7684;&#x7A7A;&#x95F4;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5B9E;&#x4E60;&#x6240;&#x5728;&#x7684;&#x7EC4;&#x4E0D;&#x9519;&#xFF0C;&#x6C1B;&#x56F4;&#x548C;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x4E00;&#x76F4;&#x5B9E;&#x4E60;&#x7684;&#x3002;&#x4E00;&#x76F4;&#x5B9E;&#x4E60;&#x6709;&#x8BF8;&#x591A;&#x597D;&#x5904;&#xFF0C;&#x6BD4;&#x5982;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x6F5C;&#x5728;&#x6237;&#x53E3;&#x7B49;&#x7B49;&#xFF0C;&#x6211;&#x4E0A;&#x6587;&#x4E5F;&#x5DF2;&#x7ECF;&#x5217;&#x4E3E;&#x8FC7;&#x4E86;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x5FC3;&#x6001;&#x8981;&#x8C03;&#x6574;&#x597D;&#xFF0C;&#x4E0D;&#x8981;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#x4EC5;&#x4EC5;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x4E60;&#x751F;&#xFF0C;&#x5C31;&#x5BF9;&#x81EA;&#x5DF1;&#x653E;&#x4F4E;&#x8981;&#x6C42;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x505A;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x8981;&#x7528;&#x4E00;&#x4E2A;&#x6B63;&#x5F0F;&#x5458;&#x5DE5;&#x7684;&#x5FC3;&#x6001;&#x6765;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#xFF0C;&#x79EF;&#x6781;&#x53C2;&#x4E0E;&#x7EC4;&#x5185;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x9879;&#x3002;&#x6BD4;&#x5982;&#x53C2;&#x52A0;&#x7EC4;&#x4F1A;&#x4E86;&#x89E3;&#x5176;&#x4ED6;&#x540C;&#x5B66;&#x5728;&#x5E72;&#x561B;&#xFF0C;&#x4EE5;&#x53CA;&#x601D;&#x8003;&#x4E1A;&#x52A1;&#x73B0;&#x5728;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x51FA;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x5BF9;&#x5F53;&#x524D;&#x95EE;&#x9898;&#x7684;&#x770B;&#x6CD5;&#x7B49;&#x7B49;&#x3002;</p>
<p><strong>&#x6CA1;&#x6709;&#x4EBA;&#x613F;&#x610F;&#x5E26;&#x4E00;&#x4E2A;&#x5BF9;&#x81EA;&#x5DF1;&#x8981;&#x6C42;&#x653E;&#x4F4E;&#x7684;&#x201C;&#x5B9E;&#x4E60;&#x751F;&#x201D;&#xFF0C;&#x5927;&#x5BB6;&#x613F;&#x610F;&#x6307;&#x5BFC;&#x7684;&#x662F;&#x90A3;&#x4E9B;&#x7ECF;&#x9A8C;&#x6B20;&#x7F3A;&#x7684;&#x201C;&#x6210;&#x5E74;&#x4EBA;&#x201D;&#x3002;</strong></p>
<hr>
<p><strong>&#x6700;&#x540E;&#x6765;&#x4E00;&#x5219;&#x62DB;&#x8058;&#x5E7F;&#x544A;&#xFF0C;&#x6211;&#x6240;&#x5728;&#x7684;&#x56E2;&#x961F;&#x5E38;&#x5E74;&#x62DB;&#x6536;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x6821;&#x62DB;&#x793E;&#x62DB;&#x5B9E;&#x4E60;&#x5747;&#x53EF;&#x3002;&#x6211;&#x4EEC;&#x662F;&#x5B57;&#x8282;&#x8DF3;&#x52A8;GIP&#x63A8;&#x8350;&#x7B97;&#x6CD5;&#xFF0C;&#x5305;&#x62EC;&#x4ECA;&#x65E5;&#x5934;&#x6761;&#x3001;&#x897F;&#x74DC;&#x89C6;&#x9891;&#x3001;&#x756A;&#x8304;&#x5C0F;&#x8BF4;&#x7B49;&#x5176;&#x4ED6;App&#x7684;&#x63A8;&#x8350;&#x7B97;&#x6CD5;&#x5DE5;&#x4F5C;&#x3002;&#x6B22;&#x8FCE;&#x540C;&#x5B66;&#x4EEC;&#x76F4;&#x63A5;&#x52A0;&#x6211;&#x79C1;&#x4EBA;&#x5FAE;&#x4FE1;fengchi_dong&#x8FDB;&#x884C;&#x5185;&#x63A8;&#x3002;&#x60F3;&#x4E86;&#x89E3;&#x4E5F;&#x884C;&#xFF0C;&#x5305;&#x884C;&#x4E1A;&#x80CC;&#x666F;&#x4ECB;&#x7ECD;&#xFF0C;&#x7B80;&#x5386;&#x8F85;&#x5BFC;&#xFF0C;&#x610F;&#x5FD7;&#x4E0D;&#x575A;&#x5B9A;&#x704C;&#x9E21;&#x6C64;&#xFF0C;&#x9762;&#x8BD5;&#x51C6;&#x5907;&#x65B9;&#x6848;&#x5236;&#x5B9A;&#x7B49;&#x7B49;&#x4E00;&#x6761;&#x9F99;&#x670D;&#x52A1;&#x3002;&#x6CA1;&#x6709;&#x505A;&#x4E0D;&#x5230;&#xFF0C;&#x53EA;&#x6709;&#x60F3;&#x4E0D;&#x5230;&#xFF01;</strong></p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> &#x4F5C;&#x8005;: <a href="https://dongfengchi.github.io/algo_engineer_zero_to_one" target="_blank">&#x5CF0;&#x6C60;</a>&#xFF0C;&#x4E00;&#x4E2A;&#x7231;&#x8BFB;&#x4E66;&#x7684;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08; </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> &#x6700;&#x8FD1;&#x66F4;&#x65B0;&#xFF1A; 2021-03-09 06:44:53 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2-the_way_grown_up.html" class="navigation navigation-prev " aria-label="Previous page: 1-4 晋升路径&回报">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../chap02/1-preparing.html" class="navigation navigation-next " aria-label="Next page: 2-1 求职准备">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1-5 其他问题：城市、户口&实习","level":"2.5","depth":1,"next":{"title":"2-1 求职准备","level":"3.1","depth":1,"path":"chap02/1-preparing.md","ref":"./chap02/1-preparing.md","articles":[]},"previous":{"title":"1-4 晋升路径&回报","level":"2.4","depth":1,"path":"chap01/2-the_way_grown_up.md","ref":"./chap01/2-the_way_grown_up.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","-sharing","github-buttons","editlink","ga","-highlight","prism","bibtex-indexed-cite","anchor-navigation-ex","page-footer-ex","splitter","todo","copy-code-button","expandable-chapters-small","donate","katex","statistics"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"ignore":["mermaid","eval-js"],"css":["prismjs/themes/prism-solarizedlight.css"]},"statistics":{"bd_url":"https://hm.baidu.com/hm.js","cnzz_url":"https://s95.cnzz.com/z_stat.php","google_url":"https://www.googletagmanager.com/gtag/js","cnzz_id":1279720611},"editlink":{"label":"Edit","multilingual":false,"base":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"},"todo":{},"page-footer-ex":{"copyright":"作者: [峰池](https://dongfengchi.github.io/algo_engineer_zero_to_one)，一个爱读书的算法工程师","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"最近更新："},"splitter":{},"search-pro":{"cutWordLib":"nodejieba","defineWord":["Gitbook Use"]},"donate":{"alipay":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat.jpg","alipayText":"微信打赏","button":"赏","title":"","wechat":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat_mp.jpg","wechatText":"关注公众号：峰池"},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":false},"bibtex-indexed-cite":{"path":"/"},"github-buttons":{"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]},"expandable-chapters-small":{},"links":{"sidebar":{"Home":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"}},"copy-code-button":{},"ga":{"configuration":"auto","token":"G-0FKP0E9H88"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"峰池","pdf":{"pageNumbers":true,"fontSize":14,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":30,"left":30,"top":32,"bottom":32}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"bibCount":0,"variables":{},"title":"算法工程师从零到一","bib":[],"gitbook":"*"},"file":{"path":"chap01/4-other_questions.md","mtime":"2021-03-09T06:44:53.212Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-09T06:45:42.115Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-statistics/statistics.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

