
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2-1 求职准备 · 算法工程师从零到一</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="峰池">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-bibtex-indexed-cite/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2-process.html" />
    
    
    <link rel="prev" href="../chap01/4-other_questions.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    算法工程师从零到一
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">01 行业背景</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../chap01/1-internet_industry_trend.html">
            
                <a href="../chap01/1-internet_industry_trend.html">
            
                    
                    1-1 互联网整体发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../chap01/position_description.html">
            
                <a href="../chap01/position_description.html">
            
                    
                    1-2 互联网中的主要岗位都是在干些啥？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../chap01/3-work_experience.html">
            
                <a href="../chap01/3-work_experience.html">
            
                    
                    1-3 工作体验
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../chap01/2-the_way_grown_up.html">
            
                <a href="../chap01/2-the_way_grown_up.html">
            
                    
                    1-4 晋升路径&回报
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="../chap01/4-other_questions.html">
            
                <a href="../chap01/4-other_questions.html">
            
                    
                    1-5 其他问题：城市、户口&实习
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">02 找工作</li>
        
        
    
        <li class="chapter active" data-level="3.1" data-path="1-preparing.html">
            
                <a href="1-preparing.html">
            
                    
                    2-1 求职准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="2-process.html">
            
                <a href="2-process.html">
            
                    
                    2-2 整体流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="3-resume.html">
            
                <a href="3-resume.html">
            
                    
                    2-3 简历制作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="4-interview.html">
            
                <a href="4-interview.html">
            
                    
                    2-4 面试准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="5-choice.html">
            
                <a href="5-choice.html">
            
                    
                    2-5 Offer选择
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">03 日常工作</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../chap03/1-basics.html">
            
                <a href="../chap03/1-basics.html">
            
                    
                    3-1 工程基础：线上系统，代码先行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../chap03/2-sort.html">
            
                <a href="../chap03/2-sort.html">
            
                    
                    3-2 排序模块：推荐系统的目标是什么？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="../chap03/3-recall.html">
            
                <a href="../chap03/3-recall.html">
            
                    
                    3-3 召回模块：海量候选的快速匹配
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="../chap03/4-instance.html">
            
                <a href="../chap03/4-instance.html">
            
                    
                    3-4 样本拼接&模型训练
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">04 新人进阶</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../chap04/write_to_new_engineer.html">
            
                <a href="../chap04/write_to_new_engineer.html">
            
                    
                    4-1 写给新人算法工程师
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="../chap04/2-how_to_make_money.html">
            
                <a href="../chap04/2-how_to_make_money.html">
            
                    
                    4-2 商业模式：互联网如何赚钱
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">05 推荐资料</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../chap05/1-book_recommend.html">
            
                <a href="../chap05/1-book_recommend.html">
            
                    
                    5-1 推荐资料
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2-1 求职准备</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#2-1-&#x6C42;&#x804C;&#x51C6;&#x5907;"><b></b>2-1 &#x6C42;&#x804C;&#x51C6;&#x5907;</a></li><ul><li><span class="title-icon "></span><a href="#&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;"><b></b>&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;</a></li><li><span class="title-icon "></span><a href="#&#x6446;&#x6B63;&#x5FC3;&#x6001;"><b></b>&#x6446;&#x6B63;&#x5FC3;&#x6001;</a></li><li><span class="title-icon "></span><a href="#&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;"><b></b>&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;</a></li></ul></ul></div><a href="#2-1-&#x6C42;&#x804C;&#x51C6;&#x5907;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="2-1-&#x6C42;&#x804C;&#x51C6;&#x5907;"><a name="2-1-&#x6C42;&#x804C;&#x51C6;&#x5907;" class="anchor-navigation-ex-anchor" href="#2-1-&#x6C42;&#x804C;&#x51C6;&#x5907;"><i class="fa fa-link" aria-hidden="true"></i></a>2-1 &#x6C42;&#x804C;&#x51C6;&#x5907;</h1>
<p>&#x518D;&#x5F00;&#x59CB;&#x627E;&#x5DE5;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x804A;&#x804A;&#x6C42;&#x804C;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x3002;&#x6C42;&#x804C;&#x51C6;&#x5907;&#xFF0C;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x8BF8;&#x5982;&#x6C42;&#x804C;&#x4FE1;&#x606F;&#xFF0C;&#x62DB;&#x8058;&#x6D41;&#x7A0B;&#x7B49;&#x7B49;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4F46;&#x5728;&#x8FD9;&#x8BF8;&#x591A;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x4E4B;&#x4E2D;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x4E00;&#x70B9;&#x662F;&#x60F3;&#x6CD5;&#x548C;&#x5FC3;&#x6001;&#x7684;&#x8F6C;&#x53D8;&#x3002;&#x53EA;&#x6709;&#x5FC3;&#x6001;&#x4E0A;&#x505A;&#x597D;&#x51C6;&#x5907;&#x4E86;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x6240;&#x6709;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x624D;&#x662F;&#x624E;&#x5B9E;&#x800C;&#x6709;&#x6548;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x70B9;&#x5C24;&#x5176;&#x91CD;&#x8981;&#x3002;&#x6211;&#x89C1;&#x8FC7;&#x592A;&#x591A;&#x7684;&#x201C;&#x597D;&#x5B66;&#x751F;&#x201D;&#xFF0C;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x5F88;&#x5F3A;&#xFF0C;&#x806A;&#x660E;&#x7A0B;&#x5EA6;&#x4E5F;&#x591F;&#xFF0C;&#x81EA;&#x8EAB;&#x4E5F;&#x5F88;&#x4F18;&#x79C0;&#x3002;&#x4F46;&#x56E0;&#x4E3A;&#x60F3;&#x6CD5;&#x548C;&#x5FC3;&#x6001;&#x4E0A;&#x76F8;&#x5BF9;&#x201C;&#x4FDD;&#x5B88;&#x201D;&#xFF0C;&#x4E0D;&#x591F;&#x201C;&#x5F00;&#x653E;&#x201D;&#xFF0C;&#x81EA;&#x5DF1;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x8DEF;&#x8D70;&#x7A84;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x5206;&#x4E09;&#x4E2A;&#x70B9;&#x6765;&#x804A;&#xFF1A;</p>
<ol>
<li>&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;</li>
<li>&#x5F00;&#x653E;&#x5FC3;&#x6001;</li>
<li>&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;</li>
</ol>
<h2 id="&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;"><a name="&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;" class="anchor-navigation-ex-anchor" href="#&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;</h2>
<p>&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x5F88;&#x559C;&#x6B22;&#x8FD9;&#x53E5;&#x8BDD;&#x3002;&#x8FD9;&#x53E5;&#x8BDD;&#x662F;&#x6211;&#x5165;&#x804C;&#x5B57;&#x8282;&#x4E4B;&#x540E;&#xFF0C;&#x5185;&#x90E8;&#x4E00;&#x4E2A;&#x5F88;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x6280;&#x672F;&#x8D1F;&#x8D23;&#x4EBA;&#x7ED9;&#x6211;&#x4EEC;&#x505A;&#x5206;&#x4EAB;&#x7684;&#x65F6;&#x5019;&#x63D0;&#x5230;&#x7684;&#x3002;&#x73B0;&#x5728;&#x4E5F;&#x60F3;&#x628A;&#x8FD9;&#x53E5;&#x8BDD;&#x8F6C;&#x9001;&#x7ED9;&#x5927;&#x5BB6;&#x3002;</p>
<p>&#x8FD9;&#x53E5;&#x8BDD;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x5462;&#xFF1F;</p>
<p>&#x53EF;&#x80FD;&#x5728;&#x5B66;&#x6821;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x4E86;&#x5728;&#x8001;&#x5E08;&#x6216;&#x8005;&#x5B66;&#x6821;&#x7ED9;&#x5B9A;&#x7684;&#x8D5B;&#x9053;&#x91CC;&#x9762;&#x52AA;&#x529B;&#xFF1A;&#x6709;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x6210;&#x7EE9;&#xFF0C;&#x5728;&#x5B66;&#x751F;&#x7EC4;&#x7EC7;&#x91CC;&#x9762;&#x62C5;&#x4EFB;&#x5173;&#x952E;&#x89D2;&#x8272;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x793E;&#x4F1A;&#x5B9E;&#x8DF5;&#x3002;&#x5728;&#x5B66;&#x6821;&#x91CC;&#x9762;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x5956;&#x5B66;&#x91D1;&#x7684;&#x52A0;&#x5206;&#x9879;&#x3002;&#x4F46;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x8D5B;&#x9053;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x4E0B;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x9700;&#x8981;&#x7684;&#x3002;</p>
<p>&#x6211;&#x77E5;&#x9053;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x56E0;&#x4E3A;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x60F3;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x4E92;&#x8054;&#x7F51;&#x4E2D;&#x7684;&#x4E00;&#x5458;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x9762;&#x4E34;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#xFF1A;&#x8FD9;&#x4E2A;&#x5C97;&#x4F4D;&#x7684;&#x5F88;&#x591A;&#x8981;&#x6C42;&#xFF0C;&#x5728;&#x5B66;&#x6821;&#x91CC;&#x9762;&#x5E76;&#x6CA1;&#x6709;&#x5B66;&#x5230;&#x3002;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;&#x60F3;&#x505A;&#x7B97;&#x6CD5;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x7B97;&#x6CD5;&#x5C97;&#x8981;&#x6C42;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5E76;&#x6CA1;&#x6709;&#x4E0A;&#x8FC7;&#x4EE3;&#x7801;&#x76F8;&#x5173;&#x7684;&#x8BFE;&#x7A0B;&#x3002;&#x4E8E;&#x662F;&#x81EA;&#x5DF1;&#x5C31;&#x8499;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x600E;&#x4E48;&#x505A;&#x3002;&#x751A;&#x81F3;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x540C;&#x5B66;&#xFF0C;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5F88;&#x9177;&#xFF0C;&#x5C31;&#x60F3;&#x53C2;&#x4E0E;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x4E86;&#x89E3;&#x641C;&#x7D22;&#x8FC7;&#x3002;</p>
<p><strong>&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x6B8B;&#x9177;&#x7684;&#x4E8B;&#x5B9E;&#x60F3;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#x7684;&#x662F;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x56E0;&#x4E3A;&#x4FE1;&#x606F;&#x6280;&#x80FD;&#x8FED;&#x4EE3;&#x7684;&#x901F;&#x5EA6;&#x8FC7;&#x5FEB;&#xFF0C;&#x5BFC;&#x81F4;&#x5177;&#x4F53;&#x7684;&#x5E94;&#x7528;&#x6240;&#x9700;&#x8981;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x4E0E;&#x5B9E;&#x9645;&#x5B66;&#x6821;&#x91CC;&#x9762;&#x6559;&#x6388;&#x7684;&#x77E5;&#x8BC6;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;&#xFF0C;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x6269;&#x5927;&#x7684;&#x3002;</strong>&#x90A3;&#x4E2D;&#x95F4;&#x7684;&#x8FD9;&#x4E2A;gap&#x8981;&#x600E;&#x4E48;&#x5F25;&#x8865;&#x5462;&#xFF1F;&#x4EC5;&#x4EC5;&#x9760;&#x81EA;&#x5DF1;&#x5728;&#x5B66;&#x6821;&#x7684;&#x90A3;&#x4E9B;&#x201C;&#x5E94;&#x5F97;&#x201D;&#x7684;&#x77E5;&#x8BC6;&#x662F;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x662F;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x65AD;&#x7684;&#x63A2;&#x7D22;&#x548C;&#x52AA;&#x529B;&#x7684;&#x3002;&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8DEF;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x8D70;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x60F3;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#xFF0C;&#x90A3;&#x5C31;&#x53BB;&#x770B;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x76F8;&#x5173;&#x7684;&#x7ECF;&#x5178;&#x6559;&#x6750;&#xFF1B;&#x5982;&#x679C;&#x770B;&#x4E66;&#x89C9;&#x5F97;&#x7D2F;&#x4E86;&#xFF0C;&#x5C31;&#x5728;&#x7F51;&#x4E0A;&#x641C;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x5B9E;&#x64CD;&#x7684;&#x811A;&#x672C;&#xFF1B;&#x518D;&#x4E0D;&#x6D4E;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x53BB;&#x6253;&#x7ADE;&#x8D5B;&#xFF0C;&#x901B;github&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x6211;&#x53EA;&#x80FD;&#x544A;&#x8BC9;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x6709;&#x4EBA;&#x62CD;&#x80F8;&#x812F;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4F60;&#x505A;&#x4E86;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5408;&#x683C;&#x7684;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;</p>
<p><strong>&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#xFF0C;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x7684;&#x9053;&#x8DEF;&#x786E;&#x5B9E;&#x662F;&#x5145;&#x6EE1;&#x4E86;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x505A;&#x4E86;&#x8FD9;&#x4EF6;&#x4E8B;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x56DE;&#x62A5;&#x3002;</strong>&#x6BD4;&#x5982;&#x81EA;&#x5DF1;&#x5B66;&#x4E86;python&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x771F;&#x7684;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x4E60;&#xFF1B;&#x6BD4;&#x5982;&#x81EA;&#x5DF1;&#x770B;&#x5B8C;&#x4E86;&#x300A;&#x7EDF;&#x8BA1;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x300B;&#x662F;&#x4E0D;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x80FD;&#x529B;&#x5C31;&#x80FD;&#x70C2;&#x719F;&#x4E8E;&#x5FC3;&#xFF1B;&#x6BD4;&#x5982;&#x81EA;&#x5DF1;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x7684;&#x4E00;&#x4EFD;&#x5B9E;&#x4E60;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x771F;&#x6B63;&#x8BA9;&#x81EA;&#x5DF1;&#x5B66;&#x4E60;&#x63D0;&#x9AD8;&#x7684;&#x5730;&#x65B9;&#x3002;<strong>&#x6CA1;&#x6709;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x4EBA;&#x7ED9;&#x4F60;&#x8FD9;&#x6837;&#x7684;&#x627F;&#x8BFA;&#x3002;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x5927;&#x5BB6;&#x9760;&#x81EA;&#x5DF1;&#x53BB;&#x8D9F;&#x51FA;&#x90A3;&#x6761;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x9053;&#x8DEF;&#x3002;</strong></p>
<p>&#x53EF;&#x80FD;&#x5927;&#x5BB6;&#x5728;&#x5B66;&#x6821;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#xFF1A;&#x505A;&#x4E86;&#x67D0;&#x4EF6;&#x4E8B;&#x60C5;&#x5C31;&#x53EF;&#x4EE5;&#x6709;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6BD4;&#x5982;&#x4ED8;&#x51FA;&#x4E86;&#x52AA;&#x529B;&#x4E0A;&#x8BFE;&#x5B66;&#x4E60;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x597D;&#x7684;&#x6210;&#x7EE9;&#x3002;&#x4F46;&#x662F;&#x672A;&#x6765;&#x8D70;&#x51FA;&#x6821;&#x56ED;&#xFF0C;&#x4F60;&#x4F1A;&#x6108;&#x52A0;&#x53D1;&#x73B0;&#xFF0C;&#x6709;&#x592A;&#x591A;&#x592A;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x52AA;&#x529B;&#x53EA;&#x662F;&#x5176;&#x4E2D;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x73AF;&#x3002;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x65B9;&#x5411;&#x5C31;&#x627E;&#x9519;&#x4E86;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x52AA;&#x529B;&#x4E5F;&#x53EA;&#x80FD;&#x662F;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x80FD;&#x53D6;&#x5F97;&#x6548;&#x679C;&#x7684;&#x7ED3;&#x679C;&#x3002;<strong>&#x77E5;&#x96BE;&#x884C;&#x6613;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#x3002;</strong></p>
<p><strong>&#x4E4B;&#x524D;&#x6709;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x95EE;&#x6211;&#x8BF4;&#xFF1A;&#x5CF0;&#x6C60;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x544A;&#x8BC9;&#x6211;&#x5177;&#x4F53;&#x6211;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x63D0;&#x9AD8;&#x6211;&#x7684;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#xFF1F;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x662F;&#x4E00;&#x6761;&#x53EF;&#x4EE5;&#x7167;&#x7740;&#x505A;&#x5C31;&#x80FD;&#x5B9E;&#x73B0;&#x7684;&#x8DEF;&#x5F84;&#x3002;&#x4F46;&#x62B1;&#x6B49;&#x6211;&#x771F;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x662F;&#x4F60;&#x5E94;&#x8BE5;&#x81EA;&#x5DF1;&#x53BB;&#x9009;&#x62E9;&#x4E00;&#x6761;&#x6700;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x9053;&#x8DEF;&#x3002;&#x5982;&#x679C;&#x4E16;&#x4E0A;&#x771F;&#x7684;&#x6709;&#x6377;&#x5F84;&#xFF0C;&#x90A3;&#x4E48;&#x8D70;&#x7684;&#x4EBA;&#x4E00;&#x5B9A;&#x4F1A;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x6761;&#x8DEF;&#x4E5F;&#x5C31;&#x4F1A;&#x6162;&#x6162;&#x53D8;&#x5F97;&#x4EBA;&#x6EE1;&#x4E3A;&#x60A3;&#xFF0C;&#x800C;&#x4E0D;&#x518D;&#x6210;&#x4E3A;&#x6377;&#x5F84;&#x3002;</strong></p>
<p>&#x6211;&#x53EA;&#x80FD;&#x5728;&#x4E00;&#x4E9B;&#x65B9;&#x5411;&#x6027;&#x7684;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x7ED9;&#x5927;&#x5BB6;&#x4E00;&#x4E9B;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x505A;&#x4E00;&#x4E9B;&#x53C2;&#x8003;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x73B0;&#x5728;&#x8FD9;&#x672C;&#x5C0F;&#x518C;&#x5B50;&#xFF0C;&#x6700;&#x52AA;&#x529B;&#x60F3;&#x8981;&#x8FBE;&#x5230;&#x7684;&#x6837;&#x5B50;&#x3002;</p>
<p><strong>&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x9009;&#x62E9;&#x597D;&#x81EA;&#x5DF1;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x3002;</strong>&#x53EF;&#x80FD;&#x521A;&#x5F00;&#x59CB;&#x771F;&#x7684;&#x5F88;&#x4E0D;&#x9002;&#x5E94;&#xFF0C;&#x56E0;&#x4E3A;&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x597D;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x4F3C;&#x4E4E;&#x90FD;&#x662F;&#x987A;&#x6C34;&#x63A8;&#x821F;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x9009;&#x62E9;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8D70;&#x5411;&#x804C;&#x573A;&#x5E94;&#x8BE5;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x9762;&#x4E34;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x9009;&#x62E9;&#xFF0C;&#x80AF;&#x5B9A;&#x6709;&#x4E0D;&#x9002;&#x5E94;&#x4E0E;&#x4E0D;&#x5B89;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x80FD;&#x505A;&#x7684;&#xFF0C;&#x4E5F;&#x53EA;&#x80FD;&#x662F;&#x52AA;&#x529B;&#x9009;&#x62E9;&#x4E00;&#x6761;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x7136;&#x540E;&#x52A0;&#x6CB9;&#x3002;&#x52A0;&#x6CB9;&#xFF01;</p>
<h2 id="&#x6446;&#x6B63;&#x5FC3;&#x6001;"><a name="&#x6446;&#x6B63;&#x5FC3;&#x6001;" class="anchor-navigation-ex-anchor" href="#&#x6446;&#x6B63;&#x5FC3;&#x6001;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6446;&#x6B63;&#x5FC3;&#x6001;</h2>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6211;&#x7ECF;&#x5E38;&#x88AB;&#x95EE;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x5CF0;&#x6C60;&#xFF0C;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x770B;&#x770B;&#x6211;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x770B;&#x770B;&#x6211;&#x9002;&#x5408;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#xFF1F;</p>
<p>&#x8FD9;&#x4E9B;&#x540C;&#x5B66;&#x6709;&#x65F6;&#x5019;&#x771F;&#x7684;&#x975E;&#x5E38;&#x4F18;&#x79C0;&#xFF0C;&#x4ED6;&#x4EEC;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x4EC0;&#x4E48;&#x90FD;&#x53EF;&#x4EE5;&#x505A;&#xFF0C;&#x53EA;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x505A;&#x54EA;&#x4E2A;&#x65B9;&#x5411;&#x800C;&#x5DF2;&#x3002;</p>
<p><strong>&#x4F46;&#x662F;&#x6B63;&#x5982;&#x6211;&#x4E0A;&#x9762;&#x4E00;&#x70B9;&#x8BF4;&#x7684;&#xFF0C;&#x6210;&#x957F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x662F;&#xFF0C;&#x6446;&#x6B63;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x60F3;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x5230;&#x5E95;&#x60F3;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x3002;&#x76F8;&#x5E94;&#x7684;&#xFF0C;&#x95EE;&#x9898;&#x5C31;&#x5E94;&#x8BE5;&#x53D8;&#x6210;&#xFF0C;&#x6211;&#x60F3;&#x505A;xxx&#xFF0C;&#x4F60;&#x770B;&#x770B;&#x80FD;&#x4E0D;&#x80FD;&#x5E2E;&#x5E2E;&#x6211;&#xFF1F;</strong></p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x8981;&#x660E;&#x767D;&#x8BC4;&#x4EF7;&#x4F53;&#x7CFB;&#x7684;&#x6539;&#x53D8;&#x3002;&#x5728;&#x5B66;&#x6821;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x540C;&#x5B66;&#x4E4B;&#x95F4;&#x7684;&#x8BC4;&#x4EF7;&#x4F53;&#x7CFB;&#x5927;&#x591A;&#x90FD;&#x662F;&#x4F60;&#x5F53;&#x4E86;&#x4EC0;&#x4E48;&#x73ED;&#x7EA7;&#x5E72;&#x90E8;&#xFF0C;&#x4F60;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x793E;&#x4F1A;&#x5B9E;&#x8DF5;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x6C42;&#x804C;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x4E60;&#x60EF;&#x4EE5;&#x6C42;&#x804C;&#x8005;&#x7684;&#x8BC4;&#x4EF7;&#x4F53;&#x7CFB;&#x6765;&#x5BA1;&#x89C6;&#x81EA;&#x5DF1;&#x3002;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5BF9;&#x4EBA;&#x7684;&#x8981;&#x6C42;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#x8981;&#x8FC7;&#x786C;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5373;&#x4F7F;&#x4F60;&#x5728;&#x539F;&#x6709;&#x8BC4;&#x4EF7;&#x4F53;&#x7CFB;&#x91CC;&#x9762;&#x90A3;&#x4E9B;&#x52A0;&#x5206;&#x9879;&#x6BD4;&#x5982;&#x73ED;&#x7EA7;&#x5E72;&#x90E8;&#x793E;&#x4F1A;&#x5B9E;&#x8DF5;&#xFF0C;&#x53EF;&#x80FD;&#x90FD;&#x4F1A;&#x6210;&#x4E3A;&#x6CA1;&#x6709;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p><strong>&#x6362;&#x4F4D;&#x601D;&#x8003;&#xFF0C;&#x4ECE;&#x6C42;&#x804C;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x67D0;&#x4E00;&#x4E2A;&#x5C97;&#x4F4D;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#x624D;&#xFF0C;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x5C1D;&#x8BD5;&#x53BB;&#x5339;&#x914D;&#x5B83;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x6446;&#x6B63;&#x5FC3;&#x6001;&#x3002;</strong></p>
<h2 id="&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;"><a name="&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;" class="anchor-navigation-ex-anchor" href="#&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;</h2>
<p>&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x9001;&#x7ED9;&#x5927;&#x5BB6;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x662F;&#x975E;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x73ED;&#x51FA;&#x8EAB;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x5C31;&#x505A;&#x4E0D;&#x4E86;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;
&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x662F;&#x4E00;&#x540D;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5C31;&#x53EA;&#x80FD;&#x5728;&#x6280;&#x672F;&#x7684;&#x9886;&#x57DF;&#x6DF1;&#x6316;&#x3002;
&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x9650;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x505A;&#x4E0D;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x4EFB;&#x4F55;&#x6280;&#x80FD;&#x7406;&#x8BBA;&#x4E0A;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x540E;&#x5929;&#x4E60;&#x5F97;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x60F3;&#xFF0C;&#x4F60;&#x613F;&#x610F;&#x6295;&#x5165;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x3002;</p>
<p>&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x4E8C;&#x5341;&#x591A;&#x5C81;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x662F;&#x81EA;&#x5DF1;&#x4E0D;&#x80FD;&#x505A;&#x7684;&#x3002;&#x53EA;&#x662F;&#x5927;&#x5BB6;&#x56E0;&#x4E3A;&#x73AF;&#x5883;&#x6216;&#x8005;&#x5386;&#x53F2;&#x9009;&#x62E9;&#x7B49;&#x7B49;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6CA1;&#x6709;&#x5F80;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x6CA1;&#x6709;&#x6295;&#x5165;&#x76F8;&#x5E94;&#x7684;&#x65F6;&#x95F4;&#x7CBE;&#x529B;&#x3002;</p>
<p>&#x4FDD;&#x6301;&#x7740;&#x5BF9;&#x751F;&#x6D3B;&#x7684;&#x597D;&#x5947;&#x5FC3;&#xFF0C;&#x63A2;&#x7D22;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x81EA;&#x5DF1;&#x672A;&#x66FE;&#x63A2;&#x7D22;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x53BB;&#x4EB2;&#x81EA;&#x53C2;&#x4E0E;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x7684;&#x4F1F;&#x5927;&#x53D8;&#x9769;&#xFF0C;&#x521B;&#x9020;&#x5386;&#x53F2;&#x7ED9;&#x540E;&#x4EBA;&#x770B;&#x770B;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x4E0D;&#x662F;&#x66F4;&#x597D;&#x5417;&#xFF1F;</p>
<hr>
<p>&#x672C;&#x7BC7;&#x5176;&#x5B9E;&#x7565;&#x663E;&#x9E21;&#x6C64;&#xFF0C;&#x4F46;&#x662F;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x8DDF;&#x5B66;&#x5F1F;&#x5B66;&#x59B9;&#x4EEC;&#x4EA4;&#x6D41;&#x4E4B;&#x540E;&#x7684;&#x5185;&#x5FC3;&#x771F;&#x5B9E;&#x611F;&#x60F3;&#x3002;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x662F;&#x5185;&#x5FC3;&#x6709;&#x60F3;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x53BB;&#x505A;&#xFF0C;&#x80FD;&#x529B;&#x76F8;&#x5E94;&#x7684;&#x53CD;&#x800C;&#x53D8;&#x6210;&#x5F88;&#x6B21;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x5E0C;&#x671B;&#x8FD9;&#x7BC7;&#x9E21;&#x6C64;&#x80FD;&#x591F;&#x7ED9;&#x5185;&#x5FC3;&#x6709;&#x8FD9;&#x4E2A;&#x7591;&#x95EE;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x4E00;&#x70B9;&#x5185;&#x5FC3;&#x4E0A;&#x7684;&#x652F;&#x6301;&#x5427;~&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x8D9F;&#x5751;&#x8FC7;&#x6765;&#x7684;&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x5927;&#x5BB6;&#x90FD;&#x4F1A;&#x89C9;&#x5F97;&#x56F0;&#x96BE;&#xFF0C;&#x8D8A;&#x8FC7;&#x5B83;&#x4E86;&#x4E4B;&#x540E;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7529;&#x5F00;&#x90A3;&#x4E9B;&#x88AB;&#x8FD9;&#x4E2A;&#x56F0;&#x96BE;&#x5413;&#x5012;&#x7684;&#x4EBA;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5927;&#x5BB6;&#x52A0;&#x6CB9;~</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> &#x4F5C;&#x8005;: <a href="https://dongfengchi.github.io/algo_engineer_zero_to_one" target="_blank">&#x5CF0;&#x6C60;</a>&#xFF0C;&#x4E00;&#x4E2A;&#x7231;&#x8BFB;&#x4E66;&#x7684;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08; </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> &#x6700;&#x8FD1;&#x66F4;&#x65B0;&#xFF1A; 2021-03-09 06:44:53 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../chap01/4-other_questions.html" class="navigation navigation-prev " aria-label="Previous page: 1-5 其他问题：城市、户口&实习">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2-process.html" class="navigation navigation-next " aria-label="Next page: 2-2 整体流程">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2-1 求职准备","level":"3.1","depth":1,"next":{"title":"2-2 整体流程","level":"3.2","depth":1,"path":"chap02/2-process.md","ref":"./chap02/2-process.md","articles":[]},"previous":{"title":"1-5 其他问题：城市、户口&实习","level":"2.5","depth":1,"path":"chap01/4-other_questions.md","ref":"./chap01/4-other_questions.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","-sharing","github-buttons","editlink","ga","-highlight","prism","bibtex-indexed-cite","anchor-navigation-ex","page-footer-ex","splitter","todo","copy-code-button","expandable-chapters-small","donate","katex","statistics"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"ignore":["mermaid","eval-js"],"css":["prismjs/themes/prism-solarizedlight.css"]},"statistics":{"bd_url":"https://hm.baidu.com/hm.js","cnzz_url":"https://s95.cnzz.com/z_stat.php","google_url":"https://www.googletagmanager.com/gtag/js","cnzz_id":1279720611},"editlink":{"label":"Edit","multilingual":false,"base":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"},"todo":{},"page-footer-ex":{"copyright":"作者: [峰池](https://dongfengchi.github.io/algo_engineer_zero_to_one)，一个爱读书的算法工程师","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"最近更新："},"splitter":{},"search-pro":{"cutWordLib":"nodejieba","defineWord":["Gitbook Use"]},"donate":{"alipay":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat.jpg","alipayText":"微信打赏","button":"赏","title":"","wechat":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat_mp.jpg","wechatText":"关注公众号：峰池"},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":false},"bibtex-indexed-cite":{"path":"/"},"github-buttons":{"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]},"expandable-chapters-small":{},"links":{"sidebar":{"Home":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"}},"copy-code-button":{},"ga":{"configuration":"auto","token":"G-0FKP0E9H88"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"峰池","pdf":{"pageNumbers":true,"fontSize":14,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":30,"left":30,"top":32,"bottom":32}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"bibCount":0,"variables":{},"title":"算法工程师从零到一","bib":[],"gitbook":"*"},"file":{"path":"chap02/1-preparing.md","mtime":"2021-03-09T06:44:53.212Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-09T06:45:42.115Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-statistics/statistics.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

