
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2-2 整体流程 · 算法工程师从零到一</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="峰池">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-bibtex-indexed-cite/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="3-resume.html" />
    
    
    <link rel="prev" href="1-preparing.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    算法工程师从零到一
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">01 行业背景</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../chap01/1-internet_industry_trend.html">
            
                <a href="../chap01/1-internet_industry_trend.html">
            
                    
                    1-1 互联网整体发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../chap01/position_description.html">
            
                <a href="../chap01/position_description.html">
            
                    
                    1-2 互联网中的主要岗位都是在干些啥？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../chap01/3-work_experience.html">
            
                <a href="../chap01/3-work_experience.html">
            
                    
                    1-3 工作体验
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../chap01/2-the_way_grown_up.html">
            
                <a href="../chap01/2-the_way_grown_up.html">
            
                    
                    1-4 晋升路径&回报
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="../chap01/4-other_questions.html">
            
                <a href="../chap01/4-other_questions.html">
            
                    
                    1-5 其他问题：城市、户口&实习
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">02 找工作</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="1-preparing.html">
            
                <a href="1-preparing.html">
            
                    
                    2-1 求职准备
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.2" data-path="2-process.html">
            
                <a href="2-process.html">
            
                    
                    2-2 整体流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="3-resume.html">
            
                <a href="3-resume.html">
            
                    
                    2-3 简历制作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="4-interview.html">
            
                <a href="4-interview.html">
            
                    
                    2-4 面试准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="5-choice.html">
            
                <a href="5-choice.html">
            
                    
                    2-5 Offer选择
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">03 日常工作</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../chap03/1-basics.html">
            
                <a href="../chap03/1-basics.html">
            
                    
                    3-1 工程基础：线上系统，代码先行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../chap03/2-sort.html">
            
                <a href="../chap03/2-sort.html">
            
                    
                    3-2 排序模块：推荐系统的目标是什么？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="../chap03/3-recall.html">
            
                <a href="../chap03/3-recall.html">
            
                    
                    3-3 召回模块：海量候选的快速匹配
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="../chap03/4-instance.html">
            
                <a href="../chap03/4-instance.html">
            
                    
                    3-4 样本拼接&模型训练
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">04 新人进阶</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../chap04/write_to_new_engineer.html">
            
                <a href="../chap04/write_to_new_engineer.html">
            
                    
                    4-1 写给新人算法工程师
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="../chap04/2-how_to_make_money.html">
            
                <a href="../chap04/2-how_to_make_money.html">
            
                    
                    4-2 商业模式：互联网如何赚钱
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">05 推荐资料</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../chap05/1-book_recommend.html">
            
                <a href="../chap05/1-book_recommend.html">
            
                    
                    5-1 推荐资料
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2-2 整体流程</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#2-2-&#x6574;&#x4F53;&#x6D41;&#x7A0B;"><b></b>2-2 &#x6574;&#x4F53;&#x6D41;&#x7A0B;</a></li><ul><li><span class="title-icon "></span><a href="#&#x6821;&#x56ED;&#x62DB;&#x8058;"><b></b>&#x6821;&#x56ED;&#x62DB;&#x8058;</a></li><ul><li><span class="title-icon "></span><a href="#&#x7B14;&#x8BD5;"><b></b>&#x7B14;&#x8BD5;</a></li><li><span class="title-icon "></span><a href="#&#x9762;&#x8BD5;"><b></b>&#x9762;&#x8BD5;</a></li></ul><li><span class="title-icon "></span><a href="#&#x5185;&#x63A8;"><b></b>&#x5185;&#x63A8;</a></li><li><span class="title-icon "></span><a href="#&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x4E0E;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;"><b></b>&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x4E0E;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;</a></li></ul></ul></div><a href="#2-2-&#x6574;&#x4F53;&#x6D41;&#x7A0B;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="2-2-&#x6574;&#x4F53;&#x6D41;&#x7A0B;"><a name="2-2-&#x6574;&#x4F53;&#x6D41;&#x7A0B;" class="anchor-navigation-ex-anchor" href="#2-2-&#x6574;&#x4F53;&#x6D41;&#x7A0B;"><i class="fa fa-link" aria-hidden="true"></i></a>2-2 &#x6574;&#x4F53;&#x6D41;&#x7A0B;</h1>
<p>&#x4E92;&#x8054;&#x7F51;&#x62DB;&#x8058;&#x5927;&#x7684;&#x6D41;&#x7A0B;&#x5206;&#x6210;&#x4E24;&#x79CD;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6821;&#x56ED;&#x62DB;&#x8058;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x76F4;&#x63A5;&#x5230;&#x7EC4;&#x7684;&#x62DB;&#x8058;&#x3002;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6821;&#x56ED;&#x62DB;&#x8058;&#x662F;&#x5168;&#x516C;&#x53F8;&#x8D70;&#x7EDF;&#x4E00;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x9762;&#x5411;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6821;&#x62DB;&#x751F;&#xFF0C;&#x8FDB;&#x884C;&#x5927;&#x89C4;&#x6A21;&#x9762;&#x8BD5;&#xFF0C;&#x53C2;&#x52A0;&#x6821;&#x56ED;&#x9762;&#x8BD5;&#x4E4B;&#x524D;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5C06;&#x6765;&#x4F1A;&#x5230;&#x54EA;&#x4E2A;&#x5C97;&#x4F4D;&#x4E0A;&#x53BB;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x76F4;&#x63A5;&#x5230;&#x5B9A;&#x5411;&#x5230;&#x5C97;&#x4F4D;&#x7684;&#x62DB;&#x8058;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x5E94;&#x8058;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x6210;&#x4E3A;&#x8FD9;&#x4E2A;&#x5C97;&#x4F4D;&#x8FD9;&#x4E2A;&#x7EC4;&#x7684;&#x4E00;&#x5458;&#x3002;&#x5404;&#x79CD;&#x5185;&#x63A8;&#xFF0C;&#x5B9E;&#x4E60;&#x90FD;&#x662F;&#x8D70;&#x7684;&#x8FD9;&#x6761;&#x8DEF;&#x5B50;&#x3002;&#x4E24;&#x6761;&#x8DEF;&#x5F84;&#x4E00;&#x822C;&#x4E92;&#x76F8;&#x4E0D;&#x51B2;&#x7A81;&#xFF0C;&#x5927;&#x5BB6;&#x662F;&#x53EF;&#x4EE5;&#x4E24;&#x79CD;&#x90FD;&#x53C2;&#x4E0E;&#x7684;&#x3002;</p>
<p>&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#xFF0C;&#x6821;&#x56ED;&#x62DB;&#x8058;&#x7684;&#x6D41;&#x7A0B;&#x66F4;&#x957F;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x7B14;&#x8BD5;&#x9762;&#x8BD5;&#x90FD;&#x6709;&#xFF0C;&#x4E2D;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;(&#x7B49;&#x5F85;&#x65F6;&#x95F4;)&#x4E5F;&#x4F1A;&#x66F4;&#x957F;&#x3002;&#x5B9A;&#x5411;&#x5230;&#x5C97;&#x7684;&#x62DB;&#x8058;&#x4E00;&#x822C;&#x53EA;&#x6709;&#x9762;&#x8BD5;&#xFF0C;&#x7B49;&#x5F85;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x4F1A;&#x66F4;&#x77ED;&#x4E00;&#x70B9;&#x3002;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x76F8;&#x5BF9;&#x7B14;&#x8BD5;&#x6765;&#x8BF4;&#xFF0C;&#x9762;&#x8BD5;&#x5176;&#x5B9E;&#x662F;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x66F4;&#x5E94;&#x8BE5;&#x597D;&#x597D;&#x51C6;&#x5907;&#x7684;&#x4E00;&#x4E2A;&#x73AF;&#x8282;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x4EE5;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6821;&#x62DB;&#x4E32;&#x4E00;&#x4E0B;&#x6574;&#x4F53;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x804A;&#x804A;&#x5B9A;&#x5411;&#x5230;&#x5C97;&#x7684;&#x9762;&#x8BD5;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x8BF4;&#x7684;&#x5185;&#x63A8;&#x3002;</p>
<h2 id="&#x6821;&#x56ED;&#x62DB;&#x8058;"><a name="&#x6821;&#x56ED;&#x62DB;&#x8058;" class="anchor-navigation-ex-anchor" href="#&#x6821;&#x56ED;&#x62DB;&#x8058;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6821;&#x56ED;&#x62DB;&#x8058;</h2>
<p>&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5927;&#x89C4;&#x6A21;&#x6821;&#x62DB;&#x5206;&#x4E3A;&#x6309;&#x65F6;&#x95F4;&#x65E9;&#x665A;&#x6392;&#x5E8F;&#x5206;&#x4E3A;&#x79CB;&#x62DB;&#x548C;&#x6625;&#x62DB;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x6A2A;&#x8DE8;&#x6574;&#x4E2A;&#x6BD5;&#x4E1A;&#x5B63;&#x5EA6;&#x4E00;&#x6574;&#x5E74;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x6309;&#x7167;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x5148;&#x540E;&#x6765;&#x8BE6;&#x8BF4;&#x3002;</p>
<p>&#x76F8;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x884C;&#x4E1A;&#x800C;&#x8A00;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x79CB;&#x62DB;&#x5F00;&#x59CB;&#x7684;&#x5F88;&#x65E9;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x5DE8;&#x5934;&#x5927;&#x516C;&#x53F8;&#x5728;&#x4E03;&#x516B;&#x6708;&#x4EFD;&#x5C31;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4E86;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6821;&#x62DB;&#x5BA3;&#x4F20;(&#x4E8B;&#x5B9E;&#x4E0A;&#x53EF;&#x80FD;&#x4E09;&#x6708;&#x4EFD;&#x5C31;&#x5F00;&#x59CB;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#xFF0C;&#x6211;&#x540E;&#x6587;&#x4F1A;&#x63D0;&#x5230;)&#x3002;&#x4F5C;&#x4E3A;&#x5BF9;&#x6BD4;&#xFF0C;&#x5404;&#x5927;&#x94F6;&#x884C;&#x5728;10&#x6708;&#x4E2D;&#x65EC;&#x624D;&#x4F1A;&#x653E;&#x51FA;&#x5F53;&#x5E74;&#x7684;&#x62DB;&#x8058;&#x5C97;&#x4F4D;&#x548C;&#x6307;&#x6807;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x5F00;&#x59CB;&#x5BA3;&#x4F20;&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x5BA3;&#x4F20;&#x4E2D;&#x7684;&#x65B9;&#x5F0F;&#x6295;&#x9012;&#x7B80;&#x5386;&#x4E86;&#x3002;</p>
<p>&#x6295;&#x9012;&#x7B80;&#x5386;&#x6709;&#x51E0;&#x4E2A;&#x5E73;&#x53F0;&#xFF0C;&#x6BD4;&#x5982;51job&#xFF0C;&#x5927;&#x8857;&#x7F51;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x5E73;&#x53F0;&#x7684;&#x597D;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x4F60;&#x5728;&#x8FD9;&#x4E9B;&#x5E73;&#x53F0;&#x4E0A;&#x7F16;&#x8F91;&#x597D;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7B80;&#x5386;&#x4FE1;&#x606F;&#x4E4B;&#x540E;&#xFF0C;&#x76F4;&#x63A5;&#x70B9;&#x516C;&#x53F8;&#x6295;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x5373;<strong>&#x4E00;&#x4EFD;&#x7B80;&#x5386;&#xFF0C;&#x591A;&#x6B21;&#x6295;&#x9012;</strong>&#x3002;&#x4F46;&#x662F;&#x66F4;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5927;&#x4E00;&#x70B9;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#xFF0C;&#x516C;&#x53F8;&#x90FD;&#x4F1A;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#xFF0C;&#x8BA9;&#x4F60;&#x81EA;&#x5DF1;&#x91CD;&#x65B0;&#x518D;&#x586B;&#x5199;&#x4E00;&#x4EFD;&#x7B80;&#x5386;&#xFF0C;&#x5373;<strong>&#x4E00;&#x4EFD;&#x7B80;&#x5386;&#xFF0C;&#x4E00;&#x6B21;&#x6295;&#x9012;</strong>&#x3002;&#x597D;&#x5728;&#x6280;&#x672F;&#x7C7B;&#x7684;&#x5C97;&#x4F4D;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x6CA1;&#x6709;&#x8BF8;&#x5982;&#x201C;&#x4F60;&#x505A;&#x8FC7;&#x6700;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x201C;&#x4F60;&#x6700;&#x5927;&#x7684;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;&#x5404;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x54F2;&#x5B66;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x662F;&#x5F88;&#x52B3;&#x795E;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x9047;&#x5230;&#x6BD4;&#x8F83;&#x5751;&#x7239;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x81EA;&#x5DF1;&#x586B;&#x4E86;&#x534A;&#x5929;&#x7F51;&#x9875;&#x5F39;&#x51FA;&#x4FDD;&#x5B58;&#x5931;&#x8D25;&#x8BF7;&#x91CD;&#x8BD5;&#xFF0C;&#x90A3;&#x662F;&#x771F;&#x7684;&#x60F3;&#x62CD;&#x684C;&#x5B50;&#x7684;&#x3002;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x5728;&#x8FDB;&#x884C;&#x8FD9;&#x4E00;&#x6B65;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x627E;&#x4E00;&#x4E2A;txt&#x6216;&#x8005;word&#x6587;&#x4EF6;&#xFF0C;&#x65E0;&#x683C;&#x5F0F;&#x7684;&#x4FDD;&#x5B58;&#x7B80;&#x5386;&#x9879;&#x76EE;&#xFF0C;&#x65B9;&#x4FBF;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x3002;&#x5982;&#x679C;&#x4F60;&#x73B0;&#x5728;&#x4E0D;&#x61C2;&#x6211;&#x5728;&#x8BF4;&#x4EC0;&#x4E48;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x4F60;&#x4F1A;&#x61C2;&#x7684;&#x3002;</p>
<p>&#x5728;&#x7B80;&#x5386;&#x6295;&#x9012;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x8FC7;&#x4E00;&#x6B21;&#x7B80;&#x5355;&#x7684;&#x7B80;&#x5386;&#x521D;&#x7B5B;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x8981;&#x5F00;&#x59CB;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x7B14;&#x8BD5;&#x4E86;&#x3002;</p>
<h3 id="&#x7B14;&#x8BD5;"><a name="&#x7B14;&#x8BD5;" class="anchor-navigation-ex-anchor" href="#&#x7B14;&#x8BD5;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7B14;&#x8BD5;</h3>
<p>&#x7B14;&#x8BD5;&#x4E00;&#x822C;&#x51FA;&#x73B0;&#x5728;&#x5927;&#x89C4;&#x6A21;&#x62DB;&#x8058;&#x6D3B;&#x52A8;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x6821;&#x62DB;(&#x5305;&#x62EC;&#x79CB;&#x62DB;&#x548C;&#x5373;&#x5C06;&#x5F00;&#x59CB;&#x7684;&#x6625;&#x62DB;)&#x548C;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x62DB;&#x8058;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x5FEB;&#x901F;&#x7684;&#x7B5B;&#x9009;&#x4E00;&#x90E8;&#x5206;&#x5019;&#x9009;&#x4EBA;&#x3002;&#x65B9;&#x5F0F;&#x662F;&#x5728;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#x4E00;&#x5929;&#x5DE6;&#x53F3;&#x4E22;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x7EBF;&#x4E0A;&#x7684;&#x7F51;&#x5740;&#xFF0C;&#x4F60;&#x5728;&#x6307;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x7F51;&#x5740;&#xFF0C;&#x8F93;&#x5165;&#x81EA;&#x5DF1;&#x7684;ID&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x53C2;&#x52A0;&#x5728;&#x7EBF;&#x7B54;&#x9898;&#x4E86;&#x3002;&#x7EBF;&#x4E0B;&#x7684;&#x7B14;&#x8BD5;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5F88;&#x5C11;&#x4E86;&#x3002;&#x8F83;&#x5C11;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x4F1A;&#x6709;&#x6027;&#x683C;&#x6D4B;&#x8BD5;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x5BA2;&#x89C2;&#x6D4B;&#x8BD5;&#x4E3A;&#x4E3B;&#x3002;</p>
<p>&#x5728;&#x7EBF;&#x7B54;&#x9898;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x4E24;&#x5C0F;&#x65F6;&#xFF0C;&#x9898;&#x578B;&#x4E3B;&#x8981;&#x662F;&#x9009;&#x62E9;&#x9898;&#x548C;&#x7F16;&#x7A0B;&#x9898;&#x3002;&#x9009;&#x62E9;&#x9898;&#x6D77;&#x7EB3;&#x767E;&#x5DDD;&#xFF0C;&#x4ECE;&#x6392;&#x5217;&#x7EC4;&#x5408;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5230;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x667A;&#x529B;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x4ED6;&#x5728;&#x8003;&#x5565;&#x7684;&#x95EE;&#x9898;&#x3002;&#x603B;&#x4E4B;&#x5C3D;&#x81EA;&#x5DF1;&#x6240;&#x80FD;&#x4F5C;&#x7B54;&#xFF0C;&#x80FD;&#x8499;&#x5C31;&#x8499;&#x3002;&#x8003;&#x6838;&#x7684;&#x91CD;&#x5FC3;&#x662F;&#x5728;&#x7F16;&#x7A0B;&#x9898;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#x7684;&#x5728;&#x7EBF;&#x7B54;&#x9898;&#x4F1A;&#x6709;&#x4E09;&#x9053;&#x5DE6;&#x53F3;&#x7684;&#x7F16;&#x7A0B;&#x9898;&#x3002;&#x901A;&#x5E38;&#x662F;&#x4F60;&#x6839;&#x636E;&#x9898;&#x76EE;&#x8981;&#x6C42;&#x5199;&#x4E00;&#x6BB5;&#x7A0B;&#x5E8F;&#x540E;&#x63D0;&#x4EA4;&#xFF0C;&#x540E;&#x53F0;&#x4F1A;&#x6709;&#x51E0;&#x4E2A;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF0C;&#x770B;&#x6307;&#x5B9A;&#x7684;&#x8F93;&#x5165;&#x4F1A;&#x4E0D;&#x4F1A;&#x5728;&#x4F60;&#x8FD9;&#x91CC;&#x8DD1;&#x51FA;&#x7B26;&#x5408;&#x9898;&#x76EE;&#x8981;&#x6C42;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x6839;&#x636E;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x7684;&#x6BD4;&#x4F8B;&#x6765;&#x8BA1;&#x5206;&#x3002;&#x65F6;&#x95F4;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x7D27;&#x5F20;&#x5982;&#x679C;&#x4E0D;&#x719F;&#x6089;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#xFF0C;&#x63A8;&#x8350;&#x5927;&#x5BB6;&#x63D0;&#x524D;&#x719F;&#x6089;&#x8003;&#x8BD5;&#x5E73;&#x53F0;&#xFF0C;&#x63A8;&#x8350;&#x725B;&#x5BA2;&#x7F51;&#xFF0C;&#x5176;&#x4ED6;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#x3002;&#x5927;&#x5BB6;&#x8FD9;&#x4E00;&#x5757;&#x9700;&#x8981;&#x597D;&#x597D;&#x5237;&#x9898;&#x51C6;&#x5907;&#xFF0C;&#x4F60;&#x518D;&#x4F18;&#x79C0;&#x8FC7;&#x4E0D;&#x4E86;&#x7B14;&#x8BD5;&#x90A3;&#x662F;&#x5168;&#x767D;&#x642D;&#x3002;</p>
<p>&#x7B14;&#x8BD5;&#x901A;&#x8FC7;&#x4E4B;&#x540E;&#xFF0C;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5C31;&#x4F1A;&#x6536;&#x5230;&#x9762;&#x8BD5;&#x901A;&#x77E5;&#x3002;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x662F;&#x7B2C;&#x4E8C;&#x5929;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x6708;&#x3002;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x6CA1;&#x6709;&#x901A;&#x8FC7;&#x7B14;&#x8BD5;&#xFF0C;&#x516C;&#x53F8;&#x4E5F;&#x4E0D;&#x4F1A;&#x7ED9;&#x4F60;&#x901A;&#x77E5;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5728;&#x7B49;&#x5F85;&#x7684;&#x9762;&#x8BD5;&#x901A;&#x77E5;&#x53EF;&#x80FD;&#x771F;&#x7684;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x3002;&#x6240;&#x4EE5;&#x81EA;&#x5DF1;&#x5FC3;&#x91CC;&#x8981;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7B14;&#x8BD5;&#x6210;&#x7EE9;&#x6709;&#x5BA2;&#x89C2;&#x5408;&#x7406;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x5305;&#x62EC;&#x9762;&#x8BD5;&#xFF0C;&#x4E5F;&#x5F88;&#x5C11;&#x6709;&#x516C;&#x53F8;&#x6B63;&#x5F0F;&#x53D1;&#x62D2;&#x4FE1;&#x7684;&#x3002;&#x5982;&#x679C;&#x7B14;&#x8BD5;&#x6216;&#x9762;&#x8BD5;&#x4E0D;&#x7406;&#x60F3;&#xFF0C;&#x53CA;&#x65F6;&#x8C03;&#x6574;&#x5FC3;&#x6001;&#xFF0C;&#x518D;&#x6295;&#x4E00;&#x4E2A;&#x3002;<strong>&#x591A;&#x8BF4;&#x4E00;&#x53E5;&#xFF0C;&#x7B14;&#x8BD5;&#x662F;&#x4E0D;&#x8BB2;&#x60C5;&#x9762;&#x7684;&#xFF0C;&#x80FD;&#x8FC7;&#x5C31;&#x662F;&#x8FC7;&#xFF0C;&#x8FC7;&#x4E0D;&#x4E86;&#x53EF;&#x80FD;&#x5C31;&#x76F4;&#x63A5;&#x88AB;&#x5237;&#x4E86;&#x3002;&#x8003;&#x9898;&#x4EE5;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x7684;&#x4EBA;&#x8BA4;&#x4E3A;&#x7684;&#x201C;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x201D;&#x4E3A;&#x4E3B;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x96BE;&#x5EA6;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x7B14;&#x8BD5;&#x5927;&#x5BB6;&#x4E00;&#x5B9A;&#x8BA4;&#x771F;&#x51C6;&#x5907;&#x3002;</strong></p>
<p><strong>&#x4E0D;&#x8FC7;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#x4E00;&#x4E2A;&#x597D;&#x6D88;&#x606F;&#xFF1A;&#x5982;&#x679C;&#x6709;&#x5E08;&#x5144;&#x5E08;&#x59D0;&#x7684;&#x5185;&#x63A8;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x662F;&#x53EF;&#x4EE5;&#x7ED5;&#x8FC7;&#x7B14;&#x8BD5;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x7701;&#x5F88;&#x591A;&#x5FC3;&#x529B;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x4E00;&#x5B9A;&#x8981;&#x591A;&#x79CD;&#x9014;&#x5F84;&#x6253;&#x542C;&#x5185;&#x63A8;&#x7684;&#x6D88;&#x606F;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x5927;&#x5BB6;&#x60F3;&#x6765;&#x5B57;&#x8282;&#x8DF3;&#x52A8;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x627E;&#x6211;&#xFF0C;&#x5FAE;&#x4FE1;&#x5CF0;&#x6C60;(fengchi_dong)&#x8FDB;&#x884C;&#x5185;&#x63A8;&#xFF0C;&#x5404;&#x79CD;&#x804C;&#x4F4D;&#x90FD;&#x53EF;&#x4EE5;&#x3002;</strong></p>
<h3 id="&#x9762;&#x8BD5;"><a name="&#x9762;&#x8BD5;" class="anchor-navigation-ex-anchor" href="#&#x9762;&#x8BD5;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x9762;&#x8BD5;</h3>
<p><strong>&#x9762;&#x8BD5;&#x624D;&#x662F;&#x6B63;&#x5F0F;&#x7684;&#x8003;&#x6838;&#x3002;</strong>&#x6821;&#x62DB;&#x7684;&#x9762;&#x8BD5;&#x901A;&#x5E38;&#x6709;&#x4E09;&#x9762;&#xFF0C;&#x65E5;&#x5E38;&#x7684;&#x5B9E;&#x4E60;&#x4E00;&#x822C;&#x662F;&#x4E24;&#x9762;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E5F;&#x89C6;&#x60C5;&#x51B5;&#x800C;&#x5B9A;&#x3002;</p>
<p>&#x9762;&#x8BD5;&#x5C31;&#x662F;&#x8003;&#x8BD5;&#xFF0C;&#x8003;&#x6838;&#x7684;&#x65B9;&#x5F0F;&#x4E3B;&#x8981;&#x662F;&#x4EE3;&#x7801;&#x9898;&#xFF0C;&#x8F85;&#x4EE5;&#x4E00;&#x4E9B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8003;&#x6838;&#x8303;&#x56F4;&#x5728;&#x9762;&#x8BD5;&#x51C6;&#x5907;&#x4E00;&#x8282;&#x6709;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#xFF0C;&#x6B64;&#x5904;&#x4E0D;&#x518D;&#x8D58;&#x8A00;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x9898;&#x7684;&#x8003;&#x6838;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x5BF9;&#x4ECE;&#x672A;&#x53C2;&#x52A0;&#x8FC7;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x6BD4;&#x8F83;&#x7279;&#x522B;&#xFF1A;&#x9762;&#x8BD5;&#x5B98;&#x4F1A;&#x7ED9;&#x4F60;&#x4E00;&#x5F20;&#x767D;&#x7EB8;&#xFF0C;&#x544A;&#x8BC9;&#x4F60;&#x4E00;&#x9053;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x5199;&#x4E00;&#x4E0B;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x3002;&#x9700;&#x8981;&#x4F60;&#x5728;&#x767D;&#x7EB8;&#x4E0A;&#x628A;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x6700;&#x719F;&#x6089;&#x7684;&#x4EE3;&#x7801;&#x8BED;&#x8A00;&#x6765;&#x5199;&#x8FD9;&#x9053;&#x9898;&#x3002;<strong>&#x5BF9;&#x4E8E;&#x6CA1;&#x6709;&#x7EC3;&#x8FC7;&#x767D;&#x7EB8;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x81EA;&#x5DF1;&#x7EC3;&#x4E00;&#x4E0B;&#xFF0C;&#x767D;&#x7EB8;&#x5199;&#x4EE3;&#x7801;&#x548C;&#x5728;&#x6709;&#x8272;&#x5F69;&#x9AD8;&#x4EAE;&#x548C;&#x4EE3;&#x7801;&#x8865;&#x5168;&#x7684;IDE&#x4E2D;&#x5199;&#x662F;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#x7684;&#x3002;</strong>&#x767D;&#x7EB8;&#x5199;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x4F1A;&#x9488;&#x5BF9;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x63D0;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x770B;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x5BF9;&#x4E00;&#x4E9B;&#x8FB9;&#x754C;&#x7528;&#x4F8B;&#x80FD;&#x5426;&#x901A;&#x8FC7;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x628A;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4EA4;&#x7ED9;&#x9762;&#x8BD5;&#x5B98;&#x4E4B;&#x524D;&#xFF0C;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x5148;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x4EE3;&#x7801;&#x7684;&#x8FB9;&#x754C;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x4EE3;&#x7801;&#x9898;&#x7684;&#x8003;&#x6838;&#xFF0C;&#x76F4;&#x63A5;&#x51B3;&#x5B9A;&#x4E86;&#x4F60;&#x8FD9;&#x6B21;&#x9762;&#x8BD5;&#x7684;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x3002;&#x5927;&#x5BB6;&#x4E00;&#x5B9A;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x4EE5;&#x53CA;&#x591A;&#x52A0;&#x7EC3;&#x4E60;&#x3002;</strong></p>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#x7684;&#x8003;&#x6838;&#x4E3B;&#x8981;&#x662F;&#x56F4;&#x7ED5;&#x4F60;&#x7684;&#x7B80;&#x5386;&#x5C55;&#x5F00;&#x7684;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x8BA9;&#x4F60;&#x8BE6;&#x8FF0;&#x7B80;&#x5386;&#x4E2D;&#x7684;&#x7B97;&#x6CD5;&#x76F8;&#x5173;&#x9879;&#x76EE;&#x3002;&#x4F60;&#x89E3;&#x51B3;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x6784;&#x9020;&#x7279;&#x5F81;&#xFF0C;&#x7528;&#x4E86;&#x4EC0;&#x4E48;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x540E;&#x6A21;&#x578B;&#x7684;&#x6548;&#x679C;&#x600E;&#x6837;&#x7B49;&#x7B49;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x9762;&#x8BD5;&#x5B98;&#x53EF;&#x80FD;&#x4F1A;&#x9488;&#x5BF9;&#x4F60;&#x7684;&#x56DE;&#x7B54;&#x9002;&#x5F53;&#x7684;&#x505A;&#x4E00;&#x4E9B;&#x62D3;&#x5C55;&#x3002;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x4E00;&#x5B9A;&#x8981;&#x5BF9;&#x7B80;&#x5386;&#x4E2D;&#x63D0;&#x53CA;&#x7684;&#x4E1C;&#x897F;&#x8DB3;&#x591F;&#x719F;&#x6089;&#x3002;</p>
<p>&#x8981;&#x5570;&#x55E6;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF1A;<strong>&#x5728;&#x9762;&#x8BD5;&#x4E4B;&#x524D;&#x9996;&#x5148;&#x6446;&#x6B63;&#x5FC3;&#x6001;&#x3002;&#x4E0D;&#x8981;&#x62B1;&#x6028;&#x8FD9;&#x4EF6;&#x4E8B;&#x4E3A;&#x4EC0;&#x4E48;&#x4EE3;&#x7801;&#x662F;&#x91CD;&#x8981;&#x7684;&#x3002;&#x8981;&#x77E5;&#x9053;&#x5373;&#x4FBF;&#x662F;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x8EAB;&#x4EFD;&#x8FDB;&#x53BB;&#xFF0C;&#x65E0;&#x8BBA;&#x6821;&#x62DB;&#x4E5F;&#x597D;&#x5B9E;&#x4E60;&#x4E5F;&#x7F62;&#xFF0C;&#x90FD;&#x662F;&#x8981;&#x4ECE;&#x6700;&#x57FA;&#x672C;&#x7684;&#x4EE3;&#x7801;&#x5F00;&#x59CB;&#x505A;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x524D;&#x4E24;&#x4E2A;&#x6708;&#x90FD;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x6478;&#x5F97;&#x5230;&#x6A21;&#x578B;&#x3002;</strong>&#x6240;&#x4EE5;&#x4F1A;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x4F1A;&#x5E72;&#x6D3B;&#x80AF;&#x5B9A;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x8003;&#x6838;&#x70B9;&#x3002;&#x4EE5;&#x53CA;&#x5728;&#x8C08;&#x8BDD;&#x65F6;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x62DB;&#x4F60;&#x8FDB;&#x6765;&#x662F;&#x4E3A;&#x4E86;&#x5E72;&#x6D3B;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x8BA9;&#x4F60;&#x6765;&#x6307;&#x5BFC;&#x4ED6;&#x4EEC;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x9762;&#x8BD5;&#x7684;&#x95EE;&#x9898;&#x56DE;&#x7B54;&#x4E0D;&#x8981;&#x592A;&#x610F;&#x8BC6;&#x6D41;&#xFF0C;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x3002;&#x77E5;&#x9053;&#x5F97;&#x591A;&#x662F;&#x597D;&#x4E8B;&#xFF0C;&#x4F46;&#x662F;&#x8FC7;&#x4E8E;&#x663E;&#x6446;&#x800C;&#x663E;&#x5F97;&#x4E0D;&#x592A;&#x8E0F;&#x5B9E;&#x90A3;&#x5C31;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x56DE;&#x4E8B;&#x4E86;&#x3002;&#x8868;&#x73B0;&#x4E3A;&#xFF0C;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x6E05;&#x6E05;&#x695A;&#x695A;&#xFF0C;&#x4E0D;&#x8981;&#x773C;&#x9AD8;&#x624B;&#x4F4E;&#xFF1B;&#x56DE;&#x7B54;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x6E05;&#x6670;&#x800C;&#x6709;&#x6761;&#x7406;&#x7684;&#x8BF4;&#x51FA;&#x81EA;&#x5DF1;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x4E0D;&#x8981;&#x523B;&#x610F;&#x5F80;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#x719F;&#x6089;&#x7684;&#x5730;&#x65B9;&#x5F15;&#x3002;</p>
<p><strong>&#x6B64;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x800C;&#x8A00;&#xFF0C;&#x5176;&#x57FA;&#x7840;&#x662F;&#x5148;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x6240;&#x4EE5;&#x9762;&#x8BD5;&#x57FA;&#x7840;&#x662F;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#xFF0C;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x5176;&#x5B9E;&#x662F;&#x52A0;&#x5206;&#x9879;&#x3002;</strong></p>
<hr>
<p>&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x90FD;&#x6BD4;&#x8F83;&#x4EBA;&#x6027;&#x5316;&#xFF0C;&#x591A;&#x8F6E;&#x9762;&#x8BD5;&#x4F1A;&#x6392;&#x5728;&#x540C;&#x4E00;&#x5929;&#x8FDB;&#x884C;&#x3002;&#x4E00;&#x822C;&#x6700;&#x540E;&#x9762;&#x90FD;&#x4F1A;&#x662F;HR&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x9762;&#x8BD5;&#x6CA1;&#x6709;&#x89C1;&#x5230;HR&#x5C31;&#x88AB;&#x9001;&#x8D70;&#x4E86;&#xFF0C;&#x90A3;&#x591A;&#x534A;&#x662F;&#x88AB;&#x6DD8;&#x6C70;&#x4E86;&#x3002;&#x53CA;&#x65F6;&#x603B;&#x7ED3;&#x8FD9;&#x6B21;&#x9762;&#x8BD5;&#x4E2D;&#x81EA;&#x5DF1;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x518D;&#x63A5;&#x518D;&#x5389;&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x7684;&#x5927;&#x89C4;&#x6A21;&#x7B14;&#x8BD5;&#x9762;&#x8BD5;&#x4E00;&#x822C;&#x4F1A;&#x5728;10&#x6708;&#x5E95;&#x7ED3;&#x675F;&#x3002;&#x4F5C;&#x4E3A;&#x5BF9;&#x6BD4;&#xFF0C;&#x94F6;&#x884C;&#x901A;&#x5E38;11&#x6708;&#x624D;&#x5F00;&#x59CB;&#x7B14;&#x8BD5;&#x3002;&#x5982;&#x679C;&#x9762;&#x8BD5;&#x901A;&#x8FC7;&#x88AB;&#x516C;&#x53F8;&#x5F55;&#x53D6;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x8DDD;&#x79BB;&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x4E00;&#x5468;&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F1A;&#x6709;HR&#x7535;&#x8BDD;&#x901A;&#x77E5;&#x5E76;&#x4E0E;&#x4F60;&#x5546;&#x8C08;offer&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x85AA;&#x8D44;&#x548C;&#x5165;&#x804C;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x540C;&#x610F;&#x63A5;offer&#x540E;&#x8FD8;&#x6709;&#x4E9B;&#x624B;&#x7EED;&#xFF0C;&#x6309;&#x7167;HR&#x6307;&#x793A;&#x7684;&#x6D41;&#x7A0B;&#x6765;&#x8D70;&#x5C31;&#x884C;&#x3002;&#x4ECE;&#x5341;&#x4E00;&#x6708;&#x5F00;&#x59CB;&#x4F1A;&#x9646;&#x9646;&#x7EED;&#x7EED;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x8865;&#x5F55;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x673A;&#x4F1A;&#x3002;&#x5982;&#x679C;&#x5728;&#x79CB;&#x5B63;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x5FC3;&#x4EEA;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x518D;&#x7B49;&#x7B49;&#x6625;&#x62DB;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x6625;&#x62DB;&#x4E00;&#x822C;2&#x6708;&#x4E2D;&#x65EC;&#x5F00;&#x59CB;&#x5BA3;&#x4F20;&#xFF0C;&#x4E09;&#x6708;&#x4EFD;&#x5F00;&#x59CB;&#x7B14;&#x8BD5;&#x9762;&#x8BD5;&#x3002;&#x6574;&#x4F53;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x5927;&#x7684;&#x7EDF;&#x4E00;&#x7684;&#x62DB;&#x8058;&#x6D41;&#x7A0B;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x3002;</p>
<h2 id="&#x5185;&#x63A8;"><a name="&#x5185;&#x63A8;" class="anchor-navigation-ex-anchor" href="#&#x5185;&#x63A8;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5185;&#x63A8;</h2>
<p>&#x5185;&#x63A8;&#x5728;&#x6574;&#x4F53;&#x4E92;&#x8054;&#x7F51;&#x62DB;&#x8058;&#x4E2D;&#x662F;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x73AF;&#x3002;&#x6211;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8D44;&#x6E90;&#x5185;&#x63A8;&#xFF0C;&#x5C3D;&#x91CF;&#x8D70;&#x5185;&#x63A8;&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x53EF;&#x4EE5;&#x627E;&#x6211;&#xFF0C;&#x52A0;&#x6211;&#x5FAE;&#x4FE1;&#xFF1A;&#x5CF0;&#x6C60;(fengchi_dong)&#x5C31;&#x884C;&#x3002;</p>
<p>&#x5185;&#x63A8;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x597D;&#x5904;&#xFF1A;</p>
<ul>
<li>&#x6574;&#x4E2A;&#x62DB;&#x8058;&#x8FDB;&#x5EA6;&#x6D41;&#x7A0B;&#x7684;&#x76D1;&#x63A7;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x62DB;&#x8058;&#x6D41;&#x7A0B;&#x4F1A;&#x88AB;&#x5361;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x6216;&#x8005;&#x53C2;&#x52A0;&#x5B8C;&#x4E86;&#x9762;&#x8BD5;&#x5F88;&#x4E45;&#x6CA1;&#x6709;&#x901A;&#x77E5;&#x7ED3;&#x679C;&#xFF0C;&#x4F5C;&#x4E3A;&#x53C2;&#x52A0;&#x62DB;&#x8058;&#x7684;&#x540C;&#x5B66;&#x81EA;&#x8EAB;&#x662F;&#x6CA1;&#x6CD5;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x627E;HR&#x95EE;&#x4E00;&#x822C;&#x56DE;&#x5E94;&#x4E5F;&#x4F1A;&#x6BD4;&#x8F83;&#x5B98;&#x65B9;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x662F;&#x5185;&#x63A8;&#x7684;&#x8BDD;&#xFF0C;&#x5185;&#x63A8;&#x7684;&#x540C;&#x5B66;&#x662F;&#x53EF;&#x4EE5;&#x5E2E;&#x5FD9;&#x8FFD;&#x8E2A;&#x5230;&#x5F53;&#x524D;&#x6D41;&#x7A0B;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x627E;&#x4EBA;&#x95EE;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x81EA;&#x5DF1;&#x5FC3;&#x91CC;&#x5C31;&#x4F1A;&#x66F4;&#x52A0;&#x8E0F;&#x5B9E;&#x4E00;&#x70B9;</li>
<li>&#x5185;&#x63A8;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x662F;&#x53EF;&#x4EE5;&#x8DF3;&#x8FC7;&#x7B14;&#x8BD5;&#xFF0C;&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x9762;&#x8BD5;&#x9636;&#x6BB5;&#x7684;&#x3002;</li>
</ul>
<p>&#x5C31;&#x9762;&#x8BD5;&#x96BE;&#x5EA6;&#x800C;&#x8A00;&#xFF0C;&#x5185;&#x63A8;&#x548C;&#x666E;&#x901A;&#x9762;&#x8BD5;&#x7684;&#x96BE;&#x5EA6;&#x5176;&#x5B9E;&#x5E76;&#x6CA1;&#x6709;&#x533A;&#x522B;&#x3002;</p>
<h2 id="&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x4E0E;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;"><a name="&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x4E0E;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;" class="anchor-navigation-ex-anchor" href="#&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x4E0E;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x4E0E;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;</h2>
<p>&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x4E00;&#x822C;&#x5F00;&#x59CB;&#x4E8E;&#x6BCF;&#x5E74;&#x7684;&#x4E09;&#x6708;&#x4EFD;&#xFF0C;&#x6CE8;&#x610F;&#x7559;&#x610F;&#x5404;&#x5927;&#x516C;&#x53F8;&#x7684;&#x62DB;&#x8058;&#x7F51;&#x7AD9;&#xFF0C;&#x4EE5;&#x53CA;&#x5404;&#x79CD;&#x5B66;&#x957F;&#x5B66;&#x59D0;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x540E;&#x4E00;&#x822C;&#x90FD;&#x6709;&#x79CB;&#x62DB;&#x76F4;&#x63A5;&#x7559;&#x7528;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x6BD4;&#x5982;&#x4E92;&#x8054;&#x7F51;&#x5DE8;&#x5934;&#xFF0C;&#x4E00;&#x822C;&#x8FDB;&#x53BB;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5927;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x7559;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x6280;&#x672F;&#x7C7B;&#x7684;&#x5C97;&#x4F4D;&#xFF0C;&#x5F80;&#x5F80;&#x719F;&#x6089;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x53EF;&#x80FD;&#x5C31;&#x8981;&#x82B1;&#x53BB;&#x4E00;&#x4E2A;&#x6708;&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x516C;&#x53F8;&#x4E5F;&#x4E0D;&#x4F1A;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x4E60;&#x751F;&#x79BB;&#x5F00;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x524D;&#x9762;&#x8BF4;&#x5DE8;&#x5934;&#x7684;&#x79CB;&#x62DB;&#x4E09;&#x6708;&#x4EFD;&#x5C31;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4E86;&#x3002;&#x4E14;&#x56E0;&#x4E3A;&#x6691;&#x671F;&#x7559;&#x7528;&#x7684;&#x6BD4;&#x4F8B;&#x9AD8;&#xFF0C;&#x79CB;&#x62DB;&#x65F6;&#x7684;&#x62DB;&#x4EBA;&#x6307;&#x6807;&#x4F1A;&#x5927;&#x6BD4;&#x4F8B;&#x7684;&#x88AB;&#x8FD9;&#x4E9B;&#x7559;&#x7528;&#x7684;&#x5B9E;&#x4E60;&#x751F;&#x5360;&#x636E;&#xFF0C;&#x5230;&#x65F6;&#x5019;&#x5728;&#x6821;&#x751F;&#x518D;&#x60F3;&#x901A;&#x8FC7;&#x79CB;&#x62DB;&#x8FDB;&#x53BB;&#x5C31;&#x96BE;&#x4E86;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x7684;&#x9762;&#x8BD5;&#x96BE;&#x5EA6;&#x662F;&#x4F4E;&#x4E8E;&#x79CB;&#x62DB;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x8FD9;&#x4E2A;&#x673A;&#x4F1A;&#x4E00;&#x5B9A;&#x8981;&#x628A;&#x63E1;&#x548C;&#x73CD;&#x60DC;&#x3002;&#x591A;&#x6CE8;&#x610F;&#x4FE1;&#x606F;&#x7684;&#x641C;&#x96C6;&#x3002;&#x591A;&#x8BF4;&#x4E00;&#x53E5;&#xFF0C;&#x6709;&#x7684;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x6BD4;&#x5982;&#x963F;&#x91CC;&#x817E;&#x8BAF;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x4E0D;&#x62DB;&#x8058;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;&#x751F;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x83B7;&#x5F97;&#x8FD9;&#x4E24;&#x4E2A;&#x516C;&#x53F8;&#x5B9E;&#x4E60;&#x7684;&#x552F;&#x4E00;&#x673A;&#x4F1A;&#xFF0C;&#x8981;&#x73CD;&#x60DC;&#x3002;</p>
<p>&#x591A;&#x8BF4;&#x4E00;&#x53E5;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x548C;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;&#x7684;&#x533A;&#x522B;&#x3002;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#xFF0C;&#x53EF;&#x80FD;&#x516C;&#x53F8;&#x8FD8;&#x4F1A;&#x505A;&#x4E00;&#x4E9B;&#x7CBE;&#x7EC6;&#x7684;&#x51C6;&#x5907;&#xFF0C;&#x6BD4;&#x5982;&#x5355;&#x72EC;&#x7ED9;&#x4ED6;&#x4EEC;&#x914D;&#x5907;mentor&#xFF0C;&#x4E13;&#x95E8;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x7684;&#x540C;&#x5B66;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x6307;&#x5BFC;&#x4ED6;&#x4EEC;&#x5B8C;&#x6210;&#x3002;&#x4F46;&#x73B0;&#x5728;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x201C;&#x54C1;&#x724C;&#x611F;&#x201D;&#x7684;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;&#x751F;&#x3002;<strong>&#x6240;&#x4EE5;&#x4F5C;&#x4E3A;&#x5728;&#x6821;&#x60F3;&#x5B9E;&#x4E60;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#xFF0C;&#x53EF;&#x4EE5;&#x6CA1;&#x5FC5;&#x8981;&#x4E13;&#x95E8;&#x4E3A;&#x4E86;&#x7B49;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x800C;&#x5B9E;&#x4E60;&#xFF0C;&#x65E9;&#x5B9E;&#x4E60;&#x65E9;&#x79EF;&#x7D2F;&#x7ECF;&#x9A8C;&#x3002;&#x6BD5;&#x7ADF;&#x771F;&#x6B63;&#x6765;&#x5B9E;&#x4E60;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x65E5;&#x5E38;&#x5B9E;&#x4E60;&#x548C;&#x6691;&#x671F;&#x5B9E;&#x4E60;&#x5176;&#x5B9E;&#x6CA1;&#x5565;&#x533A;&#x522B;&#x3002;</strong></p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> &#x4F5C;&#x8005;: <a href="https://dongfengchi.github.io/algo_engineer_zero_to_one" target="_blank">&#x5CF0;&#x6C60;</a>&#xFF0C;&#x4E00;&#x4E2A;&#x7231;&#x8BFB;&#x4E66;&#x7684;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08; </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> &#x6700;&#x8FD1;&#x66F4;&#x65B0;&#xFF1A; 2021-03-09 06:44:53 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1-preparing.html" class="navigation navigation-prev " aria-label="Previous page: 2-1 求职准备">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="3-resume.html" class="navigation navigation-next " aria-label="Next page: 2-3 简历制作">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2-2 整体流程","level":"3.2","depth":1,"next":{"title":"2-3 简历制作","level":"3.3","depth":1,"path":"chap02/3-resume.md","ref":"./chap02/3-resume.md","articles":[]},"previous":{"title":"2-1 求职准备","level":"3.1","depth":1,"path":"chap02/1-preparing.md","ref":"./chap02/1-preparing.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","-sharing","github-buttons","editlink","ga","-highlight","prism","bibtex-indexed-cite","anchor-navigation-ex","page-footer-ex","splitter","todo","copy-code-button","expandable-chapters-small","donate","katex","statistics"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"ignore":["mermaid","eval-js"],"css":["prismjs/themes/prism-solarizedlight.css"]},"statistics":{"bd_url":"https://hm.baidu.com/hm.js","cnzz_url":"https://s95.cnzz.com/z_stat.php","google_url":"https://www.googletagmanager.com/gtag/js","cnzz_id":1279720611},"editlink":{"label":"Edit","multilingual":false,"base":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"},"todo":{},"page-footer-ex":{"copyright":"作者: [峰池](https://dongfengchi.github.io/algo_engineer_zero_to_one)，一个爱读书的算法工程师","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"最近更新："},"splitter":{},"search-pro":{"cutWordLib":"nodejieba","defineWord":["Gitbook Use"]},"donate":{"alipay":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat.jpg","alipayText":"微信打赏","button":"赏","title":"","wechat":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat_mp.jpg","wechatText":"关注公众号：峰池"},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":false},"bibtex-indexed-cite":{"path":"/"},"github-buttons":{"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]},"expandable-chapters-small":{},"links":{"sidebar":{"Home":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"}},"copy-code-button":{},"ga":{"configuration":"auto","token":"G-0FKP0E9H88"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"峰池","pdf":{"pageNumbers":true,"fontSize":14,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":30,"left":30,"top":32,"bottom":32}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"bibCount":0,"variables":{},"title":"算法工程师从零到一","bib":[],"gitbook":"*"},"file":{"path":"chap02/2-process.md","mtime":"2021-03-09T06:44:53.212Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-09T06:45:42.115Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-statistics/statistics.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

