
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2-3 简历制作 · 算法工程师从零到一</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="峰池">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-bibtex-indexed-cite/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="4-interview.html" />
    
    
    <link rel="prev" href="2-process.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    算法工程师从零到一
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">01 行业背景</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../chap01/1-internet_industry_trend.html">
            
                <a href="../chap01/1-internet_industry_trend.html">
            
                    
                    1-1 互联网整体发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../chap01/position_description.html">
            
                <a href="../chap01/position_description.html">
            
                    
                    1-2 互联网中的主要岗位都是在干些啥？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../chap01/3-work_experience.html">
            
                <a href="../chap01/3-work_experience.html">
            
                    
                    1-3 工作体验
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../chap01/2-the_way_grown_up.html">
            
                <a href="../chap01/2-the_way_grown_up.html">
            
                    
                    1-4 晋升路径&回报
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="../chap01/4-other_questions.html">
            
                <a href="../chap01/4-other_questions.html">
            
                    
                    1-5 其他问题：城市、户口&实习
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">02 找工作</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="1-preparing.html">
            
                <a href="1-preparing.html">
            
                    
                    2-1 求职准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="2-process.html">
            
                <a href="2-process.html">
            
                    
                    2-2 整体流程
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.3" data-path="3-resume.html">
            
                <a href="3-resume.html">
            
                    
                    2-3 简历制作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="4-interview.html">
            
                <a href="4-interview.html">
            
                    
                    2-4 面试准备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="5-choice.html">
            
                <a href="5-choice.html">
            
                    
                    2-5 Offer选择
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">03 日常工作</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../chap03/1-basics.html">
            
                <a href="../chap03/1-basics.html">
            
                    
                    3-1 工程基础：线上系统，代码先行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../chap03/2-sort.html">
            
                <a href="../chap03/2-sort.html">
            
                    
                    3-2 排序模块：推荐系统的目标是什么？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="../chap03/3-recall.html">
            
                <a href="../chap03/3-recall.html">
            
                    
                    3-3 召回模块：海量候选的快速匹配
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="../chap03/4-instance.html">
            
                <a href="../chap03/4-instance.html">
            
                    
                    3-4 样本拼接&模型训练
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">04 新人进阶</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../chap04/write_to_new_engineer.html">
            
                <a href="../chap04/write_to_new_engineer.html">
            
                    
                    4-1 写给新人算法工程师
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="../chap04/2-how_to_make_money.html">
            
                <a href="../chap04/2-how_to_make_money.html">
            
                    
                    4-2 商业模式：互联网如何赚钱
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">05 推荐资料</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../chap05/1-book_recommend.html">
            
                <a href="../chap05/1-book_recommend.html">
            
                    
                    5-1 推荐资料
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2-3 简历制作</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#2-3-&#x7B80;&#x5386;&#x5236;&#x4F5C;"><b></b>2-3 &#x7B80;&#x5386;&#x5236;&#x4F5C;</a></li><ul><li><span class="title-icon "></span><a href="#&#x7B80;&#x5386;&#x7684;&#x76EE;&#x6807;"><b></b>&#x7B80;&#x5386;&#x7684;&#x76EE;&#x6807;</a></li><li><span class="title-icon "></span><a href="#&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x601D;&#x8DEF;"><b></b>&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x601D;&#x8DEF;</a></li></ul></ul></div><a href="#2-3-&#x7B80;&#x5386;&#x5236;&#x4F5C;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="2-3-&#x7B80;&#x5386;&#x5236;&#x4F5C;"><a name="2-3-&#x7B80;&#x5386;&#x5236;&#x4F5C;" class="anchor-navigation-ex-anchor" href="#2-3-&#x7B80;&#x5386;&#x5236;&#x4F5C;"><i class="fa fa-link" aria-hidden="true"></i></a>2-3 &#x7B80;&#x5386;&#x5236;&#x4F5C;</h1>
<p>&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x6765;&#x91CD;&#x65B0;&#x804A;&#x4E00;&#x4E0B;&#x7B80;&#x5386;&#x7684;&#x5236;&#x4F5C;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x5206;&#x6210;&#x4E00;&#x4E0B;&#x4E24;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x7B80;&#x5386;&#x7684;&#x76EE;&#x6807;</li>
<li>&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x601D;&#x8DEF;</li>
</ol>
<h2 id="&#x7B80;&#x5386;&#x7684;&#x76EE;&#x6807;"><a name="&#x7B80;&#x5386;&#x7684;&#x76EE;&#x6807;" class="anchor-navigation-ex-anchor" href="#&#x7B80;&#x5386;&#x7684;&#x76EE;&#x6807;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7B80;&#x5386;&#x7684;&#x76EE;&#x6807;</h2>
<p>&#x7B80;&#x5386;&#x7684;&#x76EE;&#x6807;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF1A;&#x9700;&#x8981;&#x8BA9;&#x5927;&#x5BB6;&#x901A;&#x8FC7;&#x770B;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x80FD;&#x4E86;&#x89E3;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x9002;&#x5408;&#x5F53;&#x524D;&#x7684;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#x8BF4;&#xFF0C;&#x7B80;&#x5386;&#x662F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x5B57;&#x7248;&#x672C;&#x7684;&#x81EA;&#x6211;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#xFF0C;&#x901A;&#x8FC7;&#x5185;&#x5BB9;&#x7684;&#x7F16;&#x6392;&#x548C;&#x5E03;&#x5C40;&#xFF0C;&#x5728;&#x89C4;&#x5B9A;&#x7684;&#x7BC7;&#x5E45;&#x91CC;&#x9762;&#xFF0C;&#x8FBE;&#x5230;&#x8BA9;&#x770B;&#x5230;&#x4F60;&#x8FD9;&#x4EFD;&#x7B80;&#x5386;&#x7684;&#x4EBA;&#xFF0C;&#x89C9;&#x5F97;&#x4F60;&#x975E;&#x5E38;&#x4F18;&#x79C0;&#xFF0C;&#x975E;&#x5E38;&#x9002;&#x5408;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x9762;&#x6709;&#x51E0;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x7BC7;&#x5E45;&#x3002;&#x7BC7;&#x5E45;&#x6700;&#x597D;&#x662F;&#x4E00;&#x9875;&#x7EB8;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7ECF;&#x5386;&#x975E;&#x5E38;&#x7684;&#x4F18;&#x79C0;&#xFF0C;&#x90A3;&#x4E5F;&#x8981;&#x5C3D;&#x91CF;&#x7CBE;&#x7B80;&#x548C;&#x7B5B;&#x9009;&#x5230;&#x4E00;&#x9875;&#x7EB8;&#x4EE5;&#x5185;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x4E0D;&#x662F;&#x628A;&#x4F60;&#x7684;&#x6240;&#x6709;&#x7684;&#x7ECF;&#x5386;&#x5168;&#x90E8;&#x7F57;&#x5217;&#x4E0A;&#x53BB;&#x5C31;&#x597D;&#xFF0C;&#x662F;&#x8981;&#x6839;&#x636E;&#x5C97;&#x4F4D;&#x505A;&#x7B5B;&#x9009;&#x548C;&#x4F18;&#x5148;&#x7EA7;&#x6392;&#x5217;&#x7684;&#x3002;&#x4E0B;&#x6587;&#x6211;&#x4EEC;&#x4F1A;&#x8BB2;&#x5177;&#x4F53;&#x7684;&#x601D;&#x8DEF;&#x3002;</li>
<li>&#x91CD;&#x70B9;&#x3002;&#x5728;&#x4E00;&#x9875;&#x7EB8;&#x7684;&#x7B80;&#x5386;&#x4E2D;&#xFF0C;&#x662F;&#x6709;&#x4E3B;&#x6B21;&#x5173;&#x7CFB;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x624B;&#x62FF;&#x4E00;&#x9875;A4&#x7EB8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x89C9;&#x5F97;&#x6700;&#x91CD;&#x70B9;&#x7684;&#x533A;&#x57DF;&#x5728;&#x54EA;&#x91CC;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x5B9A;&#x5728;&#x4E2D;&#x90E8;&#x9760;&#x4E0A;&#x7684;&#x5730;&#x65B9;&#xFF1F;&#x6240;&#x4EE5;&#x7B80;&#x5386;&#x7684;&#x4E2D;&#x4E0A;&#x90E8;&#x5206;&#x4E00;&#x5B9A;&#x8981;&#x653E;&#x81EA;&#x5DF1;&#x6700;&#x91CD;&#x70B9;&#x60F3;&#x653E;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x628A;&#x4F60;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x6700;&#x60CA;&#x8273;&#x7684;&#x4E1C;&#x897F;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#x3002;&#x7136;&#x540E;&#x518D;&#x5728;&#x4E0B;&#x9762;&#x987A;&#x6B21;&#x5806;&#x53E0;&#x90A3;&#x4E9B;&#x6B21;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#x3002;</li>
<li>&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x3002;&#x6709;&#x51E0;&#x4E2A;&#x6700;&#x57FA;&#x672C;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x4E00;&#x5B9A;&#x9700;&#x8981;&#x7684;&#xFF1A;&#x59D3;&#x540D;&#x3001;&#x6BD5;&#x4E1A;&#x65F6;&#x95F4;&#x3001;&#x5B66;&#x6821;&#x3001;&#x4E13;&#x4E1A;&#x3001;&#x8054;&#x7CFB;&#x65B9;&#x5F0F;&#x3002;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x4E4B;&#x5916;&#xFF0C;&#x7167;&#x7247;&#x3001;&#x6C11;&#x65CF;&#x3001;&#x4E3B;&#x4FEE;&#x8BFE;&#x7A0B;&#x548C;&#x6210;&#x7EE9;&#x8FD9;&#x79CD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4F60;&#x6C42;&#x804C;&#x9762;&#x8BD5;&#x7684;&#x5C97;&#x4F4D;&#x914C;&#x60C5;&#x6DFB;&#x52A0;&#x3002;&#x600E;&#x4E48;&#x914C;&#x60C5;&#x5462;&#xFF0C;&#x5C31;&#x51FA;&#x60F3;&#x60F3;&#x5982;&#x679C;&#x4F60;&#x771F;&#x7684;&#x9762;&#x8BD5;&#x8FD9;&#x4E2A;&#x5C97;&#x4F4D;&#xFF0C;&#x4F60;&#x60F3;&#x60F3;&#x4F60;&#x4F1A;&#x4E0D;&#x4F1A;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x7136;&#x540E;&#x7701;&#x51FA;&#x6765;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x591A;&#x653E;&#x91CD;&#x70B9;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x5728;&#x4F60;&#x7684;&#x7B80;&#x5386;&#x91CC;&#x9762;&#x9884;&#x8BBE;&#x95EE;&#x9898;&#x3002;&#x81EA;&#x5DF1;&#x7684;&#x5C0F;&#x7B97;&#x76D8;&#x662F;&#xFF1A;&#x6211;&#x8FD9;&#x91CC;&#x85CF;&#x4E00;&#x4E2A;&#x6897;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x5728;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x5C31;&#x8FD9;&#x4E2A;&#x6897;&#x63D0;&#x95EE;&#xFF0C;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x5C31;&#x53EF;&#x4EE5;&#x6D41;&#x7545;&#x4F5C;&#x7B54;&#x3002;&#x4E0D;&#x8981;&#x6253;&#x8FD9;&#x79CD;&#x5C0F;&#x806A;&#x660E;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x522B;&#x4EBA;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x4E0A;&#x4E0B;&#x6587;&#x624D;&#x80FD;&#x77E5;&#x9053;&#xFF0C;&#x90A3;&#x5C31;&#x8BF4;&#x6E05;&#x695A;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x7B80;&#x660E;&#x6E05;&#x6670;&#x7684;&#x8BF4;&#x6E05;&#x695A;&#xFF0C;&#x5426;&#x5219;&#x522B;&#x4EBA;&#x4F1A;&#x89C9;&#x5F97;&#x4F60;&#x8868;&#x8FBE;&#x6709;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x7B80;&#x5386;&#x680F;&#x76EE;&#x5185;&#x7684;&#x65F6;&#x95F4;&#x5E8F;&#x662F;&#x5012;&#x5E8F;&#xFF0C;&#x5373;&#x6700;&#x8FD1;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x5728;&#x6700;&#x4E0A;&#x9762;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7EA6;&#x5B9A;&#x4FD7;&#x6210;&#x7684;&#x89C4;&#x5B9A;&#x3002;</li>
</ol>
<h2 id="&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x601D;&#x8DEF;"><a name="&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x601D;&#x8DEF;" class="anchor-navigation-ex-anchor" href="#&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x601D;&#x8DEF;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x601D;&#x8DEF;</h2>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x6765;&#x91CD;&#x70B9;&#x804A;&#x804A;&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#x51B3;&#x5B9A;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x586B;&#x5145;&#x7B80;&#x5386;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4EE5;&#x53CA;&#x600E;&#x4E48;&#x5B9A;&#x4E0D;&#x540C;&#x9879;&#x76EE;&#x4E4B;&#x95F4;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;</p>
<p><strong>&#x8981;&#x58F0;&#x660E;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF1A;&#x7B80;&#x5386;&#x4E0D;&#x662F;&#x7ECF;&#x5386;&#x7684;&#x5806;&#x79EF;&#xFF0C;&#x662F;&#x9700;&#x8981;&#x5F00;&#x52A8;&#x8111;&#x7B4B;&#x7684;&#x56DE;&#x987E;&#x4E2A;&#x4EBA;&#x5386;&#x53F2;&#x603B;&#x7ED3;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x3002;&#x5927;&#x5BB6;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x4E00;&#x6B21;&#x6210;&#x578B;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x8981;&#x7ECF;&#x8FC7;&#x4E0D;&#x65AD;&#x4FEE;&#x6539;&#x6253;&#x78E8;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7B80;&#x5386;&#x7684;&#x5236;&#x4F5C;&#x7684;&#x9884;&#x671F;&#x65F6;&#x957F;&#xFF0C;&#x53EF;&#x80FD;&#x6BD4;&#x4F60;&#x9884;&#x60F3;&#x7684;&#x5806;&#x6EE1;&#x4E00;&#x9875;A4&#x7EB8;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x8981;&#x66F4;&#x957F;&#x4E00;&#x70B9;&#x3002;&#x4E0D;&#x8981;&#x60F3;&#x7740;&#x8349;&#x8349;&#x4E86;&#x4E8B;&#xFF0C;&#x662F;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x8BA4;&#x771F;&#x5BF9;&#x5F85;&#x7684;&#x3002;</strong></p>
<p><strong>&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x6574;&#x4F53;&#x601D;&#x8DEF;&#x662F;&#xFF1A;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x5C97;&#x4F4D;&#x7684;&#x9700;&#x6C42;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x7136;&#x540E;&#x5728;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x7684;&#x6307;&#x5F15;&#x4E0B;&#xFF0C;&#x586B;&#x5145;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#x3002;&#x4E0E;&#x76EE;&#x6807;&#x6709;&#x5173;&#x7684;&#xFF0C;&#x5C31;&#x591A;&#x5199;&#xFF0C;&#x8D8A;&#x76F8;&#x5173;&#x8D8A;&#x91CD;&#x70B9;&#xFF0C;&#x8D8A;&#x91CD;&#x70B9;&#x8D8A;&#x653E;&#x524D;&#x9762;&#xFF1B;&#x4E0E;&#x76EE;&#x6807;&#x65E0;&#x5173;&#x7684;&#xFF0C;&#x5C31;&#x5C11;&#x5199;&#x6216;&#x8005;&#x4E0D;&#x5199;&#x3002;</strong>&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5224;&#x65AD;&#x548C;&#x53D6;&#x820D;&#x3002;</p>
<p>&#x7136;&#x540E;&#x6BCF;&#x4E00;&#x6BB5;&#x7ECF;&#x5386;&#xFF0C;&#x8981;&#x5C55;&#x5F00;&#x5199;&#x7684;&#x8BE6;&#x7EC6;&#x4E00;&#x70B9;&#x3002;<strong>&#x5C55;&#x5F00;&#x8981;&#x6C42;&#x76F4;&#x51FB;&#x4F60;&#x505A;&#x7684;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x7528;&#x51C6;&#x786E;&#x4E14;&#x4E0D;&#x62D6;&#x6C93;&#x7684;&#x8BED;&#x8A00;&#x63CF;&#x8FF0;&#x6E05;&#x695A;&#x4F60;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x539F;&#x59D4;&#x4EE5;&#x53CA;&#x5176;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x70B9;&#xFF0C;&#x7528;&#x4EE5;&#x8BC1;&#x660E;&#x4F60;&#x5BF9;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x5230;&#x5E95;&#x4E86;&#x89E3;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#x3002;</strong>&#x8FD9;&#x65F6;&#x5019;&#x662F;&#x8981;&#x89C1;&#x81EA;&#x5DF1;&#x529F;&#x5E95;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x628A;&#x6545;&#x4E8B;&#x8BF4;&#x6E05;&#x695A;&#xFF0C;&#x8BB2;&#x5706;&#x4E86;&#xFF0C;&#x4E0D;&#x8981;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x51E0;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x4F18;&#x5316;&#x70B9;&#xFF1A;</p>
<p>&#x4E00;&#x3001;&#x5E94;&#x8058;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x9700;&#x6C42;&#x662F;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x80FD;&#x529B;&#x3002;&#x5982;&#x679C;&#x5199;&#x4E86;&#x5F88;&#x591A;&#x5B66;&#x751F;&#x6D3B;&#x52A8;&#xFF0C;&#x793E;&#x4F1A;&#x5B9E;&#x8DF5;&#xFF0C;&#x793E;&#x4F1A;&#x8C03;&#x7814;&#xFF0C;&#x8FD9;&#x5C5E;&#x4E8E;&#x65E0;&#x5173;&#x7684;&#xFF1B;&#x5982;&#x679C;&#x5199;&#x4E86;&#x5E02;&#x573A;&#x90E8;&#x7684;&#x5B9E;&#x4E60;&#x751F;&#xFF0C;&#x8FD9;&#x5C5E;&#x4E8E;&#x65E0;&#x5173;&#x7684;&#xFF1B;&#x5982;&#x679C;&#x5199;&#x4E86;&#x6570;&#x636E;&#x5206;&#x6790;&#x5B9E;&#x4E60;&#x751F;&#xFF0C;&#x56E0;&#x4E3A;&#x5206;&#x6790;&#x5E08;&#x5F3A;&#x8C03;&#x7684;&#x80FD;&#x529B;&#x662F;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x6280;&#x80FD;&#x9879;&#x5176;&#x5B9E;&#x4E0E;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x6280;&#x80FD;&#x6709;&#x504F;&#xFF0C;&#x8FD9;&#x5C5E;&#x4E8E;&#x5F31;&#x76F8;&#x5173;&#x7684;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x53EA;&#x5199;&#x4E86;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x522B;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x5728;&#x5E72;&#x5565;&#x3002;&#x6BD4;&#x5982;&#x7B80;&#x5355;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x6211;&#x7528;pandas&#x5206;&#x6790;&#x4E86;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#x5462;&#xFF1F;&#x4E00;&#x5B9A;&#x8981;&#x5199;&#x6E05;&#x695A;&#x5199;&#x660E;&#x767D;&#x3002;&#x9879;&#x76EE;&#x80CC;&#x666F;&#xFF0C;&#x9879;&#x76EE;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x7528;&#x4E86;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x6548;&#x679C;&#x600E;&#x4E48;&#x6837;&#x3002;&#x8FD9;&#x4E00;&#x4E32;&#x95EE;&#x9898;&#x90FD;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5728;&#x7B80;&#x5386;&#x4E2D;&#x770B;&#x5230;&#x7B54;&#x6848;&#x3002;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x68C0;&#x9A8C;&#x4E00;&#x4E0B;&#xFF1A;&#x7ED9;&#x5468;&#x56F4;&#x7684;&#x540C;&#x5B66;&#x8BB2;&#x4E00;&#x4E0B;&#xFF0C;&#x770B;&#x4ED6;&#x4EEC;&#x662F;&#x4E0D;&#x662F;&#x80FD;&#x660E;&#x767D;&#x4F60;&#x7684;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x4EA7;&#x51FA;&#x3002;</p>
<p>&#x4E09;&#x3001;&#x60F3;&#x660E;&#x767D;&#x5C97;&#x4F4D;&#x7684;&#x9700;&#x6C42;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x5C97;&#x4F4D;&#x9700;&#x8981;&#x7684;&#x80FD;&#x529B;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x60F3;&#x505A;&#x591A;&#x4E2A;&#x9009;&#x62E9;&#xFF0C;&#x5236;&#x4F5C;&#x591A;&#x4EFD;&#x7B80;&#x5386;&#x4E5F;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
<p>&#x56DB;&#x3001;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x4E00;&#x4E9B;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x6B20;&#x7F3A;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x601D;&#x524D;&#x60F3;&#x540E;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5B9E;&#x5728;&#x662F;&#x6B20;&#x7F3A;&#x67D0;&#x4E00;&#x9879;&#x80FD;&#x529B;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x6211;&#x5EFA;&#x8BAE;&#x6700;&#x597D;&#x8FD8;&#x662F;&#x5728;&#x5B66;&#x6821;&#x7684;&#x671F;&#x95F4;&#x6076;&#x8865;&#x4E00;&#x4E0B;&#xFF0C;&#x6BD4;&#x5982;&#x6253;&#x6BD4;&#x8D5B;&#x6216;&#x8005;&#x5148;&#x505A;&#x4E00;&#x4EFD;&#x5C0F;&#x7684;&#x5B9E;&#x4E60;&#xFF1B;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x81EA;&#x5DF1;&#x7684;&#x81EA;&#x5B66;&#x80FD;&#x529B;&#x7684;&#x6210;&#x679C;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x786E;&#x5B9E;&#x662F;&#x5177;&#x5907;&#x76F8;&#x5E94;&#x7684;&#x80FD;&#x529B;&#xFF1A;&#x6BD4;&#x5982;&#x7F51;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;&#x7EC3;&#x624B;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#xFF0C;&#x5305;&#x88C5;&#x4E00;&#x4E0B;&#xFF0C;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x7684;&#x3002;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x7684;&#x8865;&#x5145;&#xFF0C;&#x8FD8;&#x662F;&#x4E3B;&#x8981;&#x4F9D;&#x9760;&#x5927;&#x5BB6;&#x5728;&#x5B66;&#x6821;&#x671F;&#x95F4;&#xFF0C;&#x540C;&#x5B66;&#x4EEC;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x4EA4;&#x6D41;&#x548C;&#x501F;&#x9274;&#x3002;<strong>&#x9700;&#x8981;&#x58F0;&#x660E;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x8BBA;&#x6587;&#x53EA;&#x662F;&#x4F17;&#x591A;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x62FF;&#x5F97;&#x51FA;&#x5176;&#x4ED6;&#x6BD4;&#x8BBA;&#x6587;&#x66F4;&#x5389;&#x5BB3;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#xFF0C;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x52A0;&#x5206;&#x662F;&#x4E0D;&#x8F93;&#x4E8E;&#x8BBA;&#x6587;&#x7684;&#x3002;(&#x6BD4;&#x5982;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x4E86;&#x67D0;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x5E93;)&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x8FC7;&#x4E8E;&#x770B;&#x91CD;&#x8BBA;&#x6587;&#xFF0C;&#x8BBA;&#x6587;&#x53EA;&#x662F;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x80FD;&#x529B;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x800C;&#x5DF2;&#x3002;</strong></p>
<p>&#x6240;&#x4EE5;&#x4E00;&#x5207;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#xFF0C;&#x90FD;&#x662F;&#x8981;&#x5148;&#x660E;&#x767D;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x5C97;&#x4F4D;&#x7684;&#x8981;&#x6C42;&#x3002;&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x6837;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x5462;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x603B;&#x7ED3;&#x4E86;&#x4E09;&#x4E2A;&#x9014;&#x5F84;&#xFF1A;</p>
<ul>
<li>&#x6700;&#x4E0D;&#x4F9D;&#x9760;&#x4EBA;&#x7684;&#xFF1A;&#x5C31;&#x662F;&#x53BB;&#x7F51;&#x7AD9;&#x4E0A;&#x641C;&#x8FD9;&#x4E2A;&#x5C97;&#x4F4D;&#x7684;&#x804C;&#x4F4D;&#x8981;&#x6C42;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x804C;&#x4F4D;&#x8981;&#x6C42;&#x53BB;&#x62D3;&#x5C55;&#x53BB;&#x5339;&#x914D;&#x3002;&#x95EE;&#x9898;&#x662F;&#x8FD9;&#x4E2A;&#x804C;&#x4F4D;&#x8981;&#x6C42;&#x901A;&#x5E38;&#x5176;&#x5B9E;&#x4E5F;&#x662F;HR&#x5199;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x592A;&#x61C2;&#x5177;&#x4F53;&#x67D0;&#x4E00;&#x4E2A;&#x5C97;&#x4F4D;&#x5230;&#x5E95;&#x5728;&#x505A;&#x4E9B;&#x5565;&#x3002;&#x4E3A;&#x4E86;&#x4E0D;&#x51FA;&#x9519;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x4F1A;&#x770B;&#x770B;&#x5176;&#x4ED6;&#x4EBA;&#x5BF9;&#x8FD9;&#x4E2A;&#x804C;&#x4F4D;&#x8981;&#x6C42;&#x8BE5;&#x600E;&#x4E48;&#x5199;&#x3002;&#x6240;&#x4EE5;&#x9020;&#x6210;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x5E02;&#x9762;&#x4E0A;&#x641C;&#x5230;&#x7684;&#x804C;&#x4F4D;&#x8981;&#x6C42;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;&#x3002;&#x53EF;&#x80FD;&#x4F1A;&#x548C;&#x5177;&#x4F53;&#x7684;&#x5C97;&#x4F4D;&#x8981;&#x6C42;&#x4E0D;&#x600E;&#x4E48;&#x5339;&#x914D;&#x3002;</li>
<li>&#x4EBA;&#x8109;&#x5E7F;&#x578B;&#xFF1A;&#x591A;&#x95EE;&#x95EE;&#x8BA4;&#x8BC6;&#x7684;&#x4EBA;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x8BA4;&#x8BC6;&#x5FC3;&#x4EEA;&#x7684;&#x7EC4;&#x91CC;&#x7684;&#x540C;&#x5B66;&#x6216;&#x8005;&#x5E08;&#x5144;&#x5E08;&#x59D0;&#xFF0C;&#x4ED6;&#x4EEC;&#x6700;&#x719F;&#x6089;&#x7EC4;&#x91CC;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x4EE5;&#x53CA;&#x8BE5;&#x5728;&#x4E48;&#x51C6;&#x5907;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x8FD8;&#x80FD;&#x5E2E;&#x4F60;&#x900F;&#x70B9;&#x9898;&#x3002;</li>
<li>&#x81EA;&#x5DF1;&#x66F4;&#x751F;&#x578B;&#xFF1A;&#x591A;&#x53C2;&#x52A0;&#x9762;&#x8BD5;&#x3002;&#x4E00;&#x662F;&#x9762;&#x8BD5;&#x591A;&#x4E86;&#x81EA;&#x5DF1;&#x5FC3;&#x91CC;&#x5C31;&#x4F1A;&#x6709;&#x70B9;&#x8C31;&#xFF1B;&#x4E8C;&#x662F;&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x540E;&#x4E00;&#x822C;&#x9762;&#x8BD5;&#x5B98;&#x90FD;&#x4F1A;&#x95EE;&#x4E00;&#x53E5;&#x4F60;&#x6709;&#x4EC0;&#x4E48;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#x4E48;&#xFF1F;&#x6293;&#x4F4F;&#x8FD9;&#x4E2A;&#x673A;&#x4F1A;&#x53EF;&#x4EE5;&#x5411;&#x9762;&#x8BD5;&#x5B98;&#x8BF7;&#x6559;&#x4E00;&#x4E8C;&#xFF0C;&#x6BD4;&#x5982;&#x5E94;&#x8BE5;&#x51C6;&#x5907;&#x4E9B;&#x5565;&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x51C6;&#x5907;&#xFF0C;&#x8FD9;&#x4E9B;&#x5176;&#x5B9E;&#x90FD;&#x53EF;&#x4EE5;&#x95EE;&#x95EE;&#x4ED6;&#x4EEC;&#x3002;&#x6BD5;&#x7ADF;&#x8FD9;&#x672C;&#x8D28;&#x4E0A;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x95FB;&#x9053;&#x6709;&#x5148;&#x540E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BDA;&#x5FC3;&#x53BB;&#x95EE;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x4E0D;&#x4F1A;&#x5BF9;&#x4F60;&#x6076;&#x8BED;&#x76F8;&#x5411;&#x7684;&#x3002;</li>
</ul>
<p><strong>&#x5176;&#x5B9E;&#x5F52;&#x6839;&#x5230;&#x5E95;&#xFF0C;&#x7B80;&#x5386;&#x953B;&#x70BC;&#x7684;&#x662F;&#x81EA;&#x5DF1;&#x4FE1;&#x606F;&#x7EC4;&#x7EC7;&#x548C;&#x5F52;&#x7EB3;&#x7684;&#x80FD;&#x529B;&#x3002;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5176;&#x5B9E;&#x5728;&#x4F60;&#x7684;&#x7B80;&#x5386;&#x4EA4;&#x5230;&#x9762;&#x8BD5;&#x5B98;&#x624B;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x5BF9;&#x4F60;&#x7684;&#x80FD;&#x529B;&#x8003;&#x6838;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x6389;&#x4EE5;&#x8F7B;&#x5FC3;&#x54E6;~</strong></p>
<hr>
<p>&#x73B0;&#x5728;&#x5982;&#x679C;&#x6709;&#x65B0;&#x540C;&#x5B66;&#x60F3;&#x5E2E;&#x5FD9;&#x5185;&#x63A8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x57FA;&#x672C;&#x4E0A;&#x770B;&#x4E00;&#x773C;&#x4ED6;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x4ED6;&#x901A;&#x8FC7;&#x7684;&#x6982;&#x7387;&#x6709;&#x591A;&#x5927;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x4E00;&#x65B9;&#x9762;&#x8981;&#x91CD;&#x89C6;&#x81EA;&#x5DF1;&#x7684;&#x7B80;&#x5386;&#x7F16;&#x6392;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x8981;&#x501F;&#x7740;&#x7B80;&#x5386;&#x5236;&#x4F5C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x91CD;&#x65B0;&#x68B3;&#x7406;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x5F53;&#x524D;&#x7684;&#x72B6;&#x6001;&#x548C;&#x80FD;&#x529B;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x53CA;&#x65F6;&#x7684;&#x505A;&#x597D;&#x67E5;&#x6F0F;&#x8865;&#x7F3A;&#xFF0C;&#x4E3A;&#x6B63;&#x5F0F;&#x7684;&#x9762;&#x8BD5;&#x548C;&#x4E0B;&#x4E00;&#x6B65;&#x7684;&#x4EBA;&#x751F;&#x505A;&#x597D;&#x51C6;&#x5907;&#x3002;</p>
<p><strong>&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x7B80;&#x5386;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4E09;&#x7701;&#x543E;&#x8EAB;&#x7684;&#x5DE5;&#x5177;&#x3002;</strong></p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> &#x4F5C;&#x8005;: <a href="https://dongfengchi.github.io/algo_engineer_zero_to_one" target="_blank">&#x5CF0;&#x6C60;</a>&#xFF0C;&#x4E00;&#x4E2A;&#x7231;&#x8BFB;&#x4E66;&#x7684;&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08; </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> &#x6700;&#x8FD1;&#x66F4;&#x65B0;&#xFF1A; 2021-03-09 06:44:53 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2-process.html" class="navigation navigation-prev " aria-label="Previous page: 2-2 整体流程">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="4-interview.html" class="navigation navigation-next " aria-label="Next page: 2-4 面试准备">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2-3 简历制作","level":"3.3","depth":1,"next":{"title":"2-4 面试准备","level":"3.4","depth":1,"path":"chap02/4-interview.md","ref":"./chap02/4-interview.md","articles":[]},"previous":{"title":"2-2 整体流程","level":"3.2","depth":1,"path":"chap02/2-process.md","ref":"./chap02/2-process.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","-sharing","github-buttons","editlink","ga","-highlight","prism","bibtex-indexed-cite","anchor-navigation-ex","page-footer-ex","splitter","todo","copy-code-button","expandable-chapters-small","donate","katex","statistics"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"ignore":["mermaid","eval-js"],"css":["prismjs/themes/prism-solarizedlight.css"]},"statistics":{"bd_url":"https://hm.baidu.com/hm.js","cnzz_url":"https://s95.cnzz.com/z_stat.php","google_url":"https://www.googletagmanager.com/gtag/js","cnzz_id":1279720611},"editlink":{"label":"Edit","multilingual":false,"base":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"},"todo":{},"page-footer-ex":{"copyright":"作者: [峰池](https://dongfengchi.github.io/algo_engineer_zero_to_one)，一个爱读书的算法工程师","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"最近更新："},"splitter":{},"search-pro":{"cutWordLib":"nodejieba","defineWord":["Gitbook Use"]},"donate":{"alipay":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat.jpg","alipayText":"微信打赏","button":"赏","title":"","wechat":"https://dongfengchi.github.io/algo_engineer_zero_to_one/wechat_mp.jpg","wechatText":"关注公众号：峰池"},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":false},"bibtex-indexed-cite":{"path":"/"},"github-buttons":{"buttons":[{"user":"dongfengchi","repo":"algo_engineer_zero_to_one","type":"star","size":"small","count":true}]},"expandable-chapters-small":{},"links":{"sidebar":{"Home":"https://github.com/dongfengchi/algo_engineer_zero_to_one/"}},"copy-code-button":{},"ga":{"configuration":"auto","token":"G-0FKP0E9H88"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"峰池","pdf":{"pageNumbers":true,"fontSize":14,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":30,"left":30,"top":32,"bottom":32}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"bibCount":0,"variables":{},"title":"算法工程师从零到一","bib":[],"gitbook":"*"},"file":{"path":"chap02/3-resume.md","mtime":"2021-03-09T06:44:53.212Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-09T06:45:42.115Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-statistics/statistics.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

